sources_org/lisp.org
;-*- mode: Org; fill-column: 110;-*-
