lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-14 Tue 13:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org38098be">1. common operations</a>
<ul>
<li><a href="#org8005c44">1.1. get list of functions if file:</a></li>
<li><a href="#orgef15d06">1.2. print list</a></li>
</ul>
</li>
<li><a href="#org0de9a09">2. common structures</a></li>
<li><a href="#orgf2bd7a3">3. Lisp - philosophy, patterns</a></li>
<li><a href="#org6f0613d">4. features</a></li>
<li><a href="#org85e76ca">5. compilation</a></li>
<li><a href="#orged46d0f">6. symbols, special characters</a>
<ul>
<li><a href="#org72f7bc4">6.1. Steps for info:</a></li>
<li><a href="#org1358f45">6.2. meaning with Backquote (`) macroses</a></li>
</ul>
</li>
<li><a href="#org1c83de0">7. terms</a></li>
<li><a href="#org2979144">8. advanced terms</a></li>
<li><a href="#org90b006f">9. evaluation process and forms</a>
<ul>
<li><a href="#orgbe2ee59">9.1. Special Forms</a></li>
</ul>
</li>
<li><a href="#orgc8a09c1">10. dialects</a>
<ul>
<li><a href="#org51c575e">10.1. <span class="todo TODO">TODO</span> Common lisp vs Emacs Lisp</a></li>
</ul>
</li>
<li><a href="#org4969512">11. types</a>
<ul>
<li><a href="#org5a3e739">11.1. basic</a></li>
<li><a href="#org6e8a10a">11.2. literals</a></li>
<li><a href="#orgce6c9ba">11.3. lists</a>
<ul>
<li><a href="#orgdef3476">11.3.1. basic</a></li>
<li><a href="#org7920e2a">11.3.2. Association Lists</a></li>
<li><a href="#orgf8d8e5b">11.3.3. list operators</a></li>
</ul>
</li>
<li><a href="#orgd29f926">11.4. symbol type</a></li>
<li><a href="#org55f0167">11.5. nil and t - special symbols that always evaluate to themselves</a></li>
<li><a href="#org3bff604">11.6. type conversion</a></li>
<li><a href="#org08603e5">11.7. get type or find type</a></li>
<li><a href="#org2622159">11.8. Basic Types Predicate</a></li>
<li><a href="#org5622745">11.9. evaluation process</a></li>
</ul>
</li>
<li><a href="#org440f8f0">12. char</a></li>
<li><a href="#org3773949">13. strings</a>
<ul>
<li><a href="#orge55dfa9">13.1. ex</a></li>
</ul>
</li>
<li><a href="#orgdac7603">14. comments</a>
<ul>
<li><a href="#orgffeaeb2">14.1. inside comments</a></li>
<li><a href="#org5724530">14.2. conventies</a></li>
</ul>
</li>
<li><a href="#org8386e81">15. symbols and strings</a></li>
<li><a href="#org0bceadd">16. variables</a>
<ul>
<li><a href="#org312365a">16.1. terms</a></li>
<li><a href="#org7652e26">16.2. usage</a>
<ul>
<li><a href="#orgb2d5317">16.2.1. global or global binding:</a></li>
<li><a href="#org74b04a8">16.2.2. reference</a></li>
<li><a href="#org9df4d9a">16.2.3. local:</a></li>
</ul>
</li>
<li><a href="#orgf46335c">16.3. Dynamic Scoping (Local Variables) and lexical scoping</a></li>
<li><a href="#org9f81099">16.4. Generalized Variables</a></li>
<li><a href="#org6a344d4">16.5. ex</a></li>
</ul>
</li>
<li><a href="#org460c5ef">17. Control structures: sequencing, conditions, Iteration</a>
<ul>
<li><a href="#orgfb76f1f">17.1. conditions</a>
<ul>
<li><a href="#org2b9221b">17.1.1. test-clause</a></li>
<li><a href="#org5b9165b">17.1.2. if else</a></li>
<li><a href="#org1df4cc8">17.1.3. comparison</a></li>
<li><a href="#org928ea22">17.1.4. nil and empty</a></li>
<li><a href="#org194164f">17.1.5. cond</a></li>
</ul>
</li>
<li><a href="#org32f09c8">17.2. case</a>
<ul>
<li><a href="#orgb7a6982">17.2.1. cond</a></li>
<li><a href="#org5de7406">17.2.2. cl-case </a></li>
<li><a href="#org5949a4d">17.2.3. pcase</a></li>
</ul>
</li>
<li><a href="#org79f49d2">17.3. loops</a>
<ul>
<li><a href="#org185b251">17.3.1. while</a></li>
<li><a href="#orgc352072">17.3.2. cl-loop</a></li>
<li><a href="#org7845be8">17.3.3. dolist</a></li>
<li><a href="#org48e4f2b">17.3.4. dotimes</a></li>
<li><a href="#orgaf2a056">17.3.5. usecase add-hook group of hooks</a></li>
<li><a href="#orge04f2ab">17.3.6. links</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf73fa83">18. Functions</a>
<ul>
<li><a href="#orgcdb8ed5">18.1. progn</a></li>
<li><a href="#org6795b2f">18.2. defun</a></li>
<li><a href="#orgfa09d0e">18.3. arguments</a></li>
<li><a href="#org5198dd6">18.4. (&amp;rest args) unrolling</a></li>
<li><a href="#orgeba5617">18.5. Function Calling</a></li>
<li><a href="#orgfe83410">18.6. Named parameters:</a></li>
<li><a href="#orge3eb40b">18.7. lambda</a>
<ul>
<li><a href="#orgde3a171">18.7.1. Inline Functions</a></li>
<li><a href="#org307063b">18.7.2. Special Form: function function-object</a></li>
</ul>
</li>
<li><a href="#org7d75387">18.8. closure</a></li>
<li><a href="#orgba5f398">18.9. Interactive Functions</a>
<ul>
<li><a href="#org2d83f74">18.9.1. links</a></li>
<li><a href="#org469425f">18.9.2. ex</a></li>
</ul>
</li>
<li><a href="#orgf2af155">18.10. arguments</a></li>
<li><a href="#orgefa6636">18.11. Functions with Property List argument</a></li>
<li><a href="#org66bf8b7">18.12. return</a></li>
<li><a href="#org1736a6a">18.13. by reference or by value?</a></li>
<li><a href="#orgfb91377">18.14. functions that do nothin</a></li>
</ul>
</li>
<li><a href="#orgc1eda10">19. Structures</a></li>
<li><a href="#orgc639c5a">20. printing</a></li>
<li><a href="#orgc8436c8">21. Macros</a>
<ul>
<li><a href="#org446d8bc">21.1. inline function</a></li>
</ul>
</li>
<li><a href="#orgf1f8f03">22. regex</a>
<ul>
<li><a href="#org1edd8c9">22.1. characters:</a></li>
<li><a href="#orga44c5af">22.2. commands</a>
<ul>
<li><a href="#orgb7bb6a1">22.2.1. rx</a></li>
<li><a href="#org1c86107">22.2.2. search</a></li>
<li><a href="#org758576c">22.2.3. <span class="todo TODO">TODO</span> matching</a></li>
</ul>
</li>
<li><a href="#org5e363a2">22.3. special characters</a></li>
<li><a href="#orga48d379">22.4. groups</a></li>
<li><a href="#org7964f3e">22.5. links</a></li>
</ul>
</li>
<li><a href="#org478ffc5">23. paths</a></li>
<li><a href="#orga6cf5ba">24. Emacs Code Conventions</a>
<ul>
<li><a href="#org0ad48b5">24.1. variable name conventions</a></li>
<li><a href="#org0a4853d">24.2. commands</a></li>
<li><a href="#orgaa59ce6">24.3. recommendation</a></li>
</ul>
</li>
<li><a href="#org6a330dd">25. examples</a></li>
<li><a href="#org12d474d">26. USE CASES</a>
<ul>
<li><a href="#org9976ecf">26.1. measure time of execution of any function</a></li>
<li><a href="#org840b747">26.2. working with tabular data</a></li>
</ul>
</li>
<li><a href="#orgcab409f">27. Emacs Lisp</a>
<ul>
<li><a href="#org4adb8f8">27.1. help</a></li>
<li><a href="#org839fa7a">27.2. Keys:</a></li>
<li><a href="#org0977e09">27.3. Commands</a></li>
<li><a href="#orgc8d1e2e">27.4. ask user input</a></li>
<li><a href="#org67ece24">27.5. suppress messages by function and subfunctions</a></li>
<li><a href="#orgc997e07">27.6. execute shell command</a></li>
<li><a href="#org0acef8d">27.7. defcustom</a></li>
<li><a href="#org48140fb">27.8. map</a></li>
<li><a href="#org9dc669f">27.9. buffers</a></li>
<li><a href="#org2d421d8">27.10. cl-loop</a></li>
<li><a href="#orge152710">27.11. convetions and style guide</a></li>
<li><a href="#orge8ca709">27.12. advices-reverence</a></li>
<li><a href="#org7187c7e">27.13. functional programming - stream of data</a></li>
<li><a href="#org7f25660">27.14. testing</a>
<ul>
<li><a href="#org9fb1def">27.14.1. ERT: Emacs Lisp Regression Testing</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb838d1b">28. MELPA</a>
<ul>
<li><a href="#org2ad05fc">28.1. lint</a></li>
<li><a href="#org77c9e50">28.2. byte-compile</a></li>
</ul>
</li>
<li><a href="#org89c8782">29. errors handling - errors and throws and how to catch them</a>
<ul>
<li><a href="#orga05aa06">29.1. terms</a></li>
<li><a href="#org899bbbd">29.2. error symbols</a></li>
<li><a href="#orga627a25">29.3. functions</a></li>
<li><a href="#orga65b1ed">29.4. condition case</a></li>
<li><a href="#org6fc0466">29.5. catch and throw</a></li>
<li><a href="#orgc5532da">29.6. unwind-protect</a></li>
<li><a href="#orgc096db0">29.7. logging construction</a></li>
<li><a href="#org8ea75dc">29.8. links</a></li>
</ul>
</li>
<li><a href="#org679c8df">30. Error messages</a>
<ul>
<li><a href="#orgab403d0">30.1. wrong-type-argument</a></li>
<li><a href="#orgce62b40">30.2. Lisp error: (invalid-function</a></li>
<li><a href="#org1d0770e">30.3. nil in debugger, Why nil if it is not nil?</a></li>
</ul>
</li>
<li><a href="#orgcc14d18">31. Emacs API</a>
<ul>
<li><a href="#orgae495c7">31.1. terms</a></li>
<li><a href="#org0b6c957">31.2. Pointer</a></li>
<li><a href="#org0224b90">31.3. Marker</a></li>
<li><a href="#orgc9158cd">31.4. Buffers</a>
<ul>
<li><a href="#org51841f7">31.4.1. create temp copy</a></li>
<li><a href="#org3eeddc8">31.4.2. get value from buffer</a></li>
<li><a href="#orga7899fe">31.4.3. links</a></li>
</ul>
</li>
<li><a href="#org559dd28">31.5. Windows</a>
<ul>
<li><a href="#org55f8609">31.5.1. side windows</a></li>
</ul>
</li>
<li><a href="#org06c4378">31.6. Frames</a></li>
<li><a href="#org6e3fb78">31.7. temporary files</a>
<ul>
<li><a href="#org82b3316">31.7.1. ex</a></li>
<li><a href="#orgc9f0fc1">31.7.2. links</a></li>
</ul>
</li>
<li><a href="#org16d33cc">31.8. lines</a></li>
<li><a href="#orgc0ea46f">31.9. cleanup - temporary buffer</a></li>
<li><a href="#org158a720">31.10. highlight character at point</a></li>
<li><a href="#org786dfa4">31.11. modes</a></li>
<li><a href="#org8247dd1">31.12. Call external asynchronous</a>
<ul>
<li><a href="#orga09ab48">31.12.1. async-shell-command</a></li>
<li><a href="#org241eeb3">31.12.2. call-process-shell-command</a></li>
<li><a href="#org5a323fa">31.12.3. <span class="todo TODO">TODO</span> https://github.com/tkf/python-epc</a></li>
<li><a href="#orgb3e7667">31.12.4. <span class="todo TODO">TODO</span> https://www.gnu.org/software/emacs/manual/html_node/elisp/JSONRPC.html</a></li>
</ul>
</li>
<li><a href="#orgd5ae159">31.13. Timer</a></li>
<li><a href="#org62904b4">31.14. autoload</a></li>
<li><a href="#orge32e392">31.15. links</a></li>
</ul>
</li>
<li><a href="#orgfb75ef2">32. Libraries - popular</a>
<ul>
<li><a href="#orgab6b5e1">32.1. build in</a></li>
</ul>
</li>
<li><a href="#org9bee06a">33. links</a></li>
</ul>
</div>
</div>
<p>
;-<b>- mode: Org; fill-column: 110;-</b>-
</p>
