lisp.html
<div id="outline-container-org38098be" class="outline-2">
<h2 id="org38098be"><span class="section-number-2">1.</span> common operations</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8005c44" class="outline-3">
<h3 id="org8005c44"><span class="section-number-3">1.1.</span> get list of functions if file:</h3>
<div class="outline-text-3" id="text-1-1">
<p>
M-x occur RET defun RET
</p>
<ul class="org-ul">
<li>M-s o</li>
</ul>
</div>
</div>
<div id="outline-container-orgef15d06" class="outline-3">
<h3 id="orgef15d06"><span class="section-number-3">1.2.</span> print list</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
(mapc 'print calendar-holidays)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0de9a09" class="outline-2">
<h2 id="org0de9a09"><span class="section-number-2">2.</span> common structures</h2>
<div class="outline-text-2" id="text-2">
<p>
add "s" to every element of list "left-let":
</p>
<pre class="example">
(setq fin (mapcar (lambda (x) (cons s x)) left-let))
</pre>

<p>
flatten list by one level
</p>
<pre class="example">
(apply 'append v)
</pre>

<p>
all or every
</p>
<pre class="example">
(defun all (l) (cl-every #'identity l))
</pre>

<p>
all or every nil
</p>
<pre class="example">
(defun allnil (l) (cl-every #'null l))
</pre>

<p>
any t
</p>
<pre class="example">
(defun any (l) (cl-some #'identity l))
</pre>

<p>
any nil
</p>
<pre class="example">
(defun anynil (l) (cl-some #'null l))
</pre>


<p>
Apply map to every leaf of a tree like list
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">maptree</span> (f l)
<span style="color: #f08080; font-style: italic;">"Apply map to every leaf of a list."</span>
  (mapcar (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (x) (<span style="color: #8ac6f2; font-weight: bold;">if</span> (listp x)
                          (maptree f x)
                        <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">else</span>
                        (funcall f x)
                        )) <span style="color: #ccaa8f; font-weight: bold;">l))</span>
</pre>
</div>
<p>
Concatenate two lists
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> c1 '(1 (2) 3 4))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> c2 '(1 2 3 (4)))
(print (seq-concatenate 'list c1 c2))

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">add_one_to_another</span>(c1 c2)
  (apply 'append (list c1 c2)))
</pre>
</div>

<pre class="example">

(1 (2) 3 4 1 2 3 (4))
</pre>
</div>
</div>

<div id="outline-container-orgf2bd7a3" class="outline-2">
<h2 id="orgf2bd7a3"><span class="section-number-2">3.</span> Lisp - philosophy, patterns</h2>
<div class="outline-text-2" id="text-3">
<p>
everything is list, space is items separrator
</p>

<p>
<a href="https://aartaka.me/lisp-design-patterns">https://aartaka.me/lisp-design-patterns</a>
</p>
</div>
</div>
<div id="outline-container-org6f0613d" class="outline-2">
<h2 id="org6f0613d"><span class="section-number-2">4.</span> features</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://www.tutorialspoint.com/lisp/index.htm">https://www.tutorialspoint.com/lisp/index.htm</a>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html</a>
</p>

<p>
"Lots of Isolated Silly Parentheses"
1958 by John McCarthy
</p>

<ul class="org-ul">
<li>dynamic and strong typing, functional, reflective, meta</li>
<li>advanced object-oriented programming</li>
<li>prefix notation - operators are written before their operands</li>

<li>machine-independent, such as word length etc.</li>
<li>iterative design methodology, (easy extensibility ?)</li>
<li>allow updating the program dynamically</li>
<li>high level debugging</li>
<li>advanced object-oriented programming</li>
<li>convenient macro system?</li>
<li>expression-based ?</li>
<li>object-oriented condition system ?</li>
</ul>
</div>
</div>
<div id="outline-container-org85e76ca" class="outline-2">
<h2 id="org85e76ca"><span class="section-number-2">5.</span> compilation</h2>
<div class="outline-text-2" id="text-5">
<p>
batch-byte-compile:
</p>
<div class="org-src-container">
<pre class="src src-bash">emacs --quick -batch <span style="color: #95e454;">\</span>
         -l pinyin-isearch-loaders.el <span style="color: #95e454;">\</span>
         -l pinyin-isearch-pinyin.el <span style="color: #95e454;">\</span>
         -l pinyin-isearch-chars.el <span style="color: #95e454;">\</span>
         -l pinyin-isearch.el <span style="color: #95e454;">\</span>
         --eval <span style="color: #95e454;">"(setq byte-compile-error-on-warn ${ERROR_ON_WARN})"</span> <span style="color: #95e454;">\</span>
         -f batch-byte-compile <span style="color: #95e454;">\</span>
         pinyin-isearch.el pinyin-isearch-loaders.el pinyin-isearch-chars.el pinyin-isearch-pinyin.el
</pre>
</div>

<p>
To prevent compilation of file:
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Local Variables&#58;</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">no-byte-compile: t</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">End:</span>
<span style="color: #fa8072;">;;; </span><span style="color: #99968b; font-style: italic;">test.el ends here</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orged46d0f" class="outline-2">
<h2 id="orged46d0f"><span class="section-number-2">6.</span> symbols, special characters</h2>
<div class="outline-text-2" id="text-6">
<p>
(') is equal to (list) operator
</p>

<p>
"#"
</p>
<pre class="example">
(eq 'my-add #'my-add) -&gt; t
</pre>

<p>
can be used in front of a lambda expression indicating to the byte-compiler that the following expression can be byte compiled
</p>

<p>
used in the printed representation along with the left angle bracket (&lt;) to indicate that the object printed is a description
</p>

<p>
":" A symbol whose name starts with a colon (‘:’) is called a “keyword symbol”. act as constants, and are
 normally used only by comparing an unknown symbol with a few specific alternatives <a href="#orgfcde96c">17.2.2</a>
</p>

<div class="org-src-container">
<pre class="src src-elisp">(print (list 1 2))
(print #'(1 2))
</pre>
</div>

<pre class="example">

(1 2)

(1 2)
</pre>
</div>

<div id="outline-container-org72f7bc4" class="outline-3">
<h3 id="org72f7bc4"><span class="section-number-3">6.1.</span> Steps for info:</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>F1 i or M-x info RET (open the info browser)</li>
<li>d m elisp RET (open the elisp manual)</li>
<li>I # RET (list the entries for # in the index)</li>
</ul>
</div>
</div>
