lisp.md


<a id="org679f56a"></a>

# common operations


<a id="orgb011789"></a>

## get list of functions if file:

M-x occur RET defun RET

-   M-s o


<a id="orga393e7f"></a>

## print list

    (mapc 'print calendar-holidays)


<a id="org4a9b010"></a>

# common structures

add "s" to every element of list "left-let":

    (setq fin (mapcar (lambda (x) (cons s x)) left-let))

flatten list by one level

    (apply 'append v)

all or every

    (defun all (l) (cl-every #'identity l))

all or every nil

    (defun allnil (l) (cl-every #'null l))

any t

    (defun any (l) (cl-some #'identity l))

any nil

    (defun anynil (l) (cl-some #'null l))

Apply map to every leaf of a tree like list

    (defun maptree (f l)
    "Apply map to every leaf of a list."
      (mapcar (lambda (x) (if (listp x)
                              (maptree f x)
                            ;; else
                            (funcall f x)
                            )) l))

Concatenate two lists

    (setq c1 '(1 (2) 3 4))
    (setq c2 '(1 2 3 (4)))
    (print (seq-concatenate 'list c1 c2))
    
    (defun add_one_to_another(c1 c2)
      (apply 'append (list c1 c2)))

    
    (1 (2) 3 4 1 2 3 (4))


<a id="org1ace242"></a>

# Lisp - philosophy, patterns

everything is list, space is items separrator

<https://aartaka.me/lisp-design-patterns>


<a id="orgddb77a3"></a>

# features

<https://www.tutorialspoint.com/lisp/index.htm>
<https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html>

"Lots of Isolated Silly Parentheses"
1958 by John McCarthy

-   dynamic and strong typing, functional, reflective, meta
-   advanced object-oriented programming
-   prefix notation - operators are written before their operands

-   machine-independent, such as word length etc.
-   iterative design methodology, (easy extensibility ?)
-   allow updating the program dynamically
-   high level debugging
-   advanced object-oriented programming
-   convenient macro system?
-   expression-based ?
-   object-oriented condition system ?


<a id="org8b38f2d"></a>

# compilation

batch-byte-compile:

    emacs --quick -batch \
             -l pinyin-isearch-loaders.el \
             -l pinyin-isearch-pinyin.el \
             -l pinyin-isearch-chars.el \
             -l pinyin-isearch.el \
             --eval "(setq byte-compile-error-on-warn ${ERROR_ON_WARN})" \
             -f batch-byte-compile \
             pinyin-isearch.el pinyin-isearch-loaders.el pinyin-isearch-chars.el pinyin-isearch-pinyin.el

To prevent compilation of file:

    ;; Local Variables:
    ;; no-byte-compile: t
    ;; End:
    ;;; test.el ends here


<a id="org6deadac"></a>

# symbols, special characters

(') is equal to (list) operator

"#"

    (eq 'my-add #'my-add) -> t

can be used in front of a lambda expression indicating to the byte-compiler that the following expression can be byte compiled

used in the printed representation along with the left angle bracket (<) to indicate that the object printed is a description

":" A symbol whose name starts with a colon (‘:’) is called a “keyword symbol”. act as constants, and are
 normally used only by comparing an unknown symbol with a few specific alternatives [17.2.2](#orgcf520dc)

    (print (list 1 2))
    (print #'(1 2))

    
    (1 2)
    
    (1 2)


<a id="orgdbdbc4a"></a>

## Steps for info:

-   F1 i or M-x info RET (open the info browser)
-   d m elisp RET (open the elisp manual)
-   I # RET (list the entries for # in the index)
