sources_org/lisp.org
** meaning with Backquote (`) macroses
*Backquote (`) and comma (,)*
- (`) character signals that in the expression that follows, every subexpression not preceded by a comma is
 to be quoted, and every subexpression preceded by a comma is to be evaluated.
- (`) and (,) used instead of (') to make exception in quoting and for better looking
- (`) and (,) used in macro definition for the same reason

#+begin_src elisp :results output :exports both :eval no
(setq v1 2)
(setq e 2)
(setq v2 2)
(print `(progn (setq v1 ,@e) (setq ,v2 ,e)))
;;     ^ backquote,     ^          ^   ^ commas

(print '(progn (setq v1 e) `(setq ,v2 ,e)))
#+end_src

#+RESULTS:
:
: (progn (setq v1 . 2) (setq 2 2))
:
: (progn (setq v1 e) `(setq ,v2 ,e))

#+begin_src elisp :results none :exports code :eval no
;; (')
    (defmacro my-macro-1 (arg1 arg2)
      (list 'setq arg1 (list 'cons arg2 arg1)))
;; (`) and (,)
    (defmacro my-macro-2 (arg1 arg2)
      `(setq ,arg1 ,`(cons ,arg2 ,arg1)))
#+end_src

*Comma-splice (`)(,@)*
- This is particularly useful when writing macros with an &rest specifier.
#+begin_src elisp :results output :exports both :eval no
(setq v  '("oh boy"))
(print `(zap ,@v ,v))
#+end_src

#+RESULTS:
:
: (zap "oh boy" ("oh boy"))

#+begin_src elisp :results none :exports code :eval no
;;(`) (,)
    (let ((list '(a b c d)))
      `(elt1 ,list elt2))
        => (elt1 (a b c d) elt2)
;;(`) (,@)
    (let ((list '(a b c d)))
      `(elt1 ,@list elt2))
        => (elt1 a b c d elt2)
#+end_src

*Quote-comma (`)(',)* - insert sexp as a string without evaluation
#+begin_src elisp :results output :exports both :eval no
(defmacro explain-exp (exp)
  `(format "%s = %s" ',exp ,exp))
  ;;                 ^^

(print (explain-exp (+ 2 3)))

#+end_src

#+RESULTS:
:
: "(+ 2 3) = 5"

* terms
 must know:
- whitespace and () - separators;
- () = nil = atom and list
- expressions = prefix notation = (+ 1 2)
- special operators = (+, (list, (if. (lambda
- anonymous function (lambda (arg) (+ arg 1) )
- function (defun foo "optional comment" (a b c) (+ a b c))
- function are case-insensitive
- constants = Numbers, letter t, nil
- true = t, false = nil
- certain kinds of atom(arrays) can be separated into parts but not like lists,l
- function names that end with a "p" often means it return true=t of false=nil = predicate

 terms:
- Numbers :: are provided in various forms and representations
- Characters :: represent printed glyphs such as letters or text formatting operations
- atom :: elemental entities, *number* *symbols* and *strings* (list 2 3), nil, (ab-a#221), ("asd asd")
- symbols :: are named data objects: + foo forward-line - atom type
- list :: sequence of atoms or lists in (), nil; unlist and unquote: (apply 'function '(12 23))
- string :: "asd" - arrays of characters
- comment ::  ;
- form :: any object meant to be evaluated (+ 3 4 1)
- symbolic expression :: printed representation of both atoms and lists
- quote :: '(+3 4 1) list without evaluation
- function :: first symbol in list (call)
- variable ::
- special form ::
- macros :: translate lisp expression into another lisp expression
- Hash tables ::

 Arithmetic
  - +-*/%
  - (/ 7 2) ;3
  - (/7 2.0) ; 3.5
  - (expt 2 3) ; 2^3=8

* advanced terms
forms - a data object meant to be evaluated as a program to produce one or more values (which are also data
 objects). One may request evaluation of any data object, but only certain ones are meaningful.
- symbols and lists are meaningful forms:
  - 3, whose value is 3
  - (+ 3 4), whose value is 7
- *Meaningful forms* may be divided into three categories:
  - self-evaluating forms, such as numbers
  - symbols, which stand for variables
  - lists, may be divided into:
    - special forms
    - macro calls
    - function calls.

