lisp.html
<div id="outline-container-org1358f45" class="outline-3">
<h3 id="org1358f45"><span class="section-number-3">6.2.</span> meaning with Backquote (`) macroses</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<b>Backquote (`) and comma (,)</b>
</p>
<ul class="org-ul">
<li>(`) character signals that in the expression that follows, every subexpression not preceded by a comma is
to be quoted, and every subexpression preceded by a comma is to be evaluated.</li>
<li>(`) and (,) used instead of (') to make exception in quoting and for better looking</li>
<li>(`) and (,) used in macro definition for the same reason</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> v1 2)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> e 2)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> v2 2)
(print `(<span style="color: #8ac6f2; font-weight: bold;">progn</span> (<span style="color: #8ac6f2; font-weight: bold;">setq</span> v1 ,@e) (<span style="color: #8ac6f2; font-weight: bold;">setq</span> ,v2 ,e)))
<span style="color: #fa8072;">;;     </span><span style="color: #99968b; font-style: italic;">^ backquote,     ^          ^   ^ commas</span>

(print '(progn (<span style="color: #8ac6f2; font-weight: bold;">setq</span> v1 e) `(<span style="color: #8ac6f2; font-weight: bold;">setq</span> ,v2 ,e)))
</pre>
</div>

<pre class="example">

(progn (setq v1 . 2) (setq 2 2))

(progn (setq v1 e) `(setq ,v2 ,e))
</pre>


<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(')</span>
    (<span style="color: #8ac6f2; font-weight: bold;">defmacro</span> <span style="color: #cae682; font-weight: bold;">my-macro-1</span> (arg1 arg2)
      (list 'setq arg1 (list 'cons arg2 arg1)))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(`) and (,)</span>
    (<span style="color: #8ac6f2; font-weight: bold;">defmacro</span> <span style="color: #cae682; font-weight: bold;">my-macro-2</span> (arg1 arg2)
      `(<span style="color: #8ac6f2; font-weight: bold;">setq</span> ,arg1 ,`(cons ,arg2 ,arg1)))
</pre>
</div>

<p>
<b>Comma-splice (`)(,@)</b>
</p>
<ul class="org-ul">
<li>This is particularly useful when writing macros with an &amp;rest specifier.</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> v  '(<span style="color: #95e454;">"oh boy"</span>))
(print `(zap ,@v ,v))
</pre>
</div>

<pre class="example">

(zap "oh boy" ("oh boy"))
</pre>


<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;;</span><span style="color: #99968b; font-style: italic;">(`) (,)</span>
    (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((list '(a b c d)))
      `(elt1 ,list elt2))
        =&gt; (elt1 (a b c d) elt2)
<span style="color: #fa8072;">;;</span><span style="color: #99968b; font-style: italic;">(`) (,@)</span>
    (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((list '(a b c d)))
      `(elt1 ,@list elt2))
        =&gt; (elt1 a b c d elt2)
</pre>
</div>

<p>
<b>Quote-comma (`)(',)</b> - insert sexp as a string without evaluation
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defmacro</span> <span style="color: #cae682; font-weight: bold;">explain-exp</span> (exp)
  `(format <span style="color: #95e454;">"%s = %s"</span> ',exp ,exp))
  <span style="color: #fa8072;">;;                 </span><span style="color: #99968b; font-style: italic;">^^</span>

(print (explain-exp (+ 2 3)))

</pre>
</div>

<pre class="example">

"(+ 2 3) = 5"
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c83de0" class="outline-2">
<h2 id="org1c83de0"><span class="section-number-2">7.</span> terms</h2>
<div class="outline-text-2" id="text-7">
<p>
must know:
</p>
<ul class="org-ul">
<li>whitespace and () - separators;</li>
<li>() = nil = atom and list</li>
<li>expressions = prefix notation = (+ 1 2)</li>
<li>special operators = (+, (list, (if. (lambda</li>
<li>anonymous function (lambda (arg) (+ arg 1) )</li>
<li>function (defun foo "optional comment" (a b c) (+ a b c))</li>
<li>function are case-insensitive</li>
<li>constants = Numbers, letter t, nil</li>
<li>true = t, false = nil</li>
<li>certain kinds of atom(arrays) can be separated into parts but not like lists,l</li>
<li><p>
function names that end with a "p" often means it return true=t of false=nil = predicate
</p>

<p>
terms:
</p></li>
<li id="Numbers">are provided in various forms and representations</li>
<li id="Characters">represent printed glyphs such as letters or text formatting operations</li>
<li id="atom">elemental entities, <b>number</b> <b>symbols</b> and <b>strings</b> (list 2 3), nil, (ab-a#221), ("asd asd")</li>
<li id="symbols">are named data objects: + foo forward-line - atom type</li>
<li id="list">sequence of atoms or lists in (), nil; unlist and unquote: (apply 'function '(12 23))</li>
<li id="string">"asd" - arrays of characters</li>
<li id="comment">;</li>
<li id="form">any object meant to be evaluated (+ 3 4 1)</li>
<li id="symbolic expression">printed representation of both atoms and lists</li>
<li id="quote">'(+3 4 1) list without evaluation</li>
<li id="function">first symbol in list (call)</li>
<li id="variable"></li>

<li id="special form"></li>

<li id="macros">translate lisp expression into another lisp expression</li>
<li id="Hash tables">Arithmetic
<ul class="org-ul">
<li>+-*/%</li>
<li>(/ 7 2) ;3</li>
<li>(/7 2.0) ; 3.5</li>
<li>(expt 2 3) ; 2<sup>3</sup>=8</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2979144" class="outline-2">
<h2 id="org2979144"><span class="section-number-2">8.</span> advanced terms</h2>
<div class="outline-text-2" id="text-8">
<p>
forms - a data object meant to be evaluated as a program to produce one or more values (which are also data
 objects). One may request evaluation of any data object, but only certain ones are meaningful.
</p>
<ul class="org-ul">
<li>symbols and lists are meaningful forms:
<ul class="org-ul">
<li>3, whose value is 3</li>
<li>(+ 3 4), whose value is 7</li>
</ul></li>
<li><b>Meaningful forms</b> may be divided into three categories:
<ul class="org-ul">
<li>self-evaluating forms, such as numbers</li>
<li>symbols, which stand for variables</li>
<li>lists, may be divided into:
<ul class="org-ul">
<li>special forms</li>
<li>macro calls</li>
<li>function calls.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
