sources_org/lisp.org
* evaluation process and forms
- file to s-expressions
- defines syntax of List *forms* that a built from s-expressions
- determines which s-expressions are LISP forms.
- Eval - Returns the result of evaluating an AutoLisp expression.
  - Syntax : (eval expr)
- when you evaluate a function call form such as (car x), Emacs first evaluates the argument (the subform
  x). After evaluating the argument, Emacs executes the function (car)
- Two tupes:
  - Self-Evaluating Forms '123   ⇒ 123, 123 ⇒ 123, (eval '123) => 123
  - Symbol Forms (setq a 123) (eval 'a) => 123, a => 123

LISP form could be:
- An atom
- An empty or non-list
- Any list that has a symbol as its first element

*Special Forms* - is a primitive function specially marked so that its arguments are not all evaluated
- https://www.gnu.org/software/emacs/manual/html_node/elisp/Special-Forms.html
** Special Forms

and

    see Combining Conditions
catch

    see Catch and Throw
cond

    see Conditionals
condition-case

    see Handling Errors
defconst

    see Defining Variables
defvar

    see Defining Variables
function

    see Anonymous Functions
if

    see Conditionals
interactive

    see Interactive Call
lambda

    see Lambda Expressions
let
let*

    see Local Variables [[let]]
or

    see Combining Conditions
prog1
prog2
progn

    see Sequencing
quote

    see Quoting
save-current-buffer

    see Current Buffer
save-excursion

    see Excursions
save-restriction

    see Narrowing
setq

    see Setting Variables
setq-default

    see Creating Buffer-Local
unwind-protect

    see Nonlocal Exits
while

    see Iteration

* dialects
https://en.wikipedia.org/wiki/Emacs_Lisp

- Emacs Lisp or Elisp
- Common Lisp - for javaVM too
- Scheme - simple semantics and few different ways to form expressions. more minimalist design
- Clojure is a recent dialect . mainly the Java virtual machine
** TODO Common lisp vs Emacs Lisp
 https://www.gnu.org/software/emacs/manual/html_node/cl/Porting-Common-Lisp.html
 - Case-insensitivity for symbols
   - Common LISP expressions are case-insensitive - cos 45 or COS 45 are same
   - Emacs lisp - case-sensitive
 -

* types
** basic
everything atom or list

object - instance of type, object is a piece of data used and manipulated by Lisp programs

Linked lists -  one of Lisp's major data structures

s-expression or sexp - for code and data structure : (x y z) stands for (x . (y . (z . NIL)))

Constants:
- Numbers
- The letter t, that stands for logical true.
- The value nil, that stands for logical false, as well as an empty list.


atom - is a number or symbol or string in double quotation marks.

symbol - string of contiguous character - can consist of any number of alphanumeric characters other
than whitespace, open and closing parentheses, double and single quotes, backslash, comma, colon,
semicolon and vertical bar. To use these characters in a name, you need to use escape character (\).
- hello-from-tutorials-point
- 123008907
- *hello*
- Block#221
- abc123
- +1
- FOO                 ; A symbol named ‘FOO’, different from ‘foo’  for Emacs Lisp

A string is a group of characters enclosed in double quotation marks. "Hello world!"

primitive types:
- integer
- float
- cons
- symbol
- string
- vector
- hash-table
- subr
- byte-code function
- record
- plus several special types, such as buffer, that are related to editing

single inheritance?

each object belongs to one and only one primitive type

single quote: (write '(* 2 3)) - atoms or lists literally and don't want them evaluated or treated as function calls.
- Quoting - '123, (quote (+ 1 2))
- Self-Evaluating Forms - evaluate to themselves '123 => 123 (eval '123) => 123

types of types:
- Lisp programming types
- editing - unique to Emacs Lisp
** literals
#+begin_src elisp :results output
(print 1e3)
(print 'this-a-symbol)
(print 'vector->list)
(print 'symbol?)

;; Pair / Cons Cell
(print '(a . b))
(print'(a . 2999))

(print "list")
(print'(+ 2 3 (3 4) (5 6 (+ 3 4)) 10 'a 'b "hello" ))

(print "vectors")
(print [1 2 3 4 (+ 1 2 3 54)])
#+end_src

#+RESULTS:
#+begin_example

1000.0

this-a-symbol

vector->list

symbol\?

(a . b)

(a . 2999)

"list"

(+ 2 3 (3 4) (5 6 (+ 3 4)) 10 'a 'b "hello")

"vectors"

[1 2 3 4 (+ 1 2 3 54)]
#+end_example

