lisp.html

<div id="outline-container-org90b006f" class="outline-2">
<h2 id="org90b006f"><span class="section-number-2">9.</span> evaluation process and forms</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>file to s-expressions</li>
<li>defines syntax of List <b>forms</b> that a built from s-expressions</li>
<li>determines which s-expressions are LISP forms.</li>
<li>Eval - Returns the result of evaluating an AutoLisp expression.
<ul class="org-ul">
<li>Syntax : (eval expr)</li>
</ul></li>
<li>when you evaluate a function call form such as (car x), Emacs first evaluates the argument (the subform
x). After evaluating the argument, Emacs executes the function (car)</li>
<li>Two tupes:
<ul class="org-ul">
<li>Self-Evaluating Forms '123   ⇒ 123, 123 ⇒ 123, (eval '123) =&gt; 123</li>
<li>Symbol Forms (setq a 123) (eval 'a) =&gt; 123, a =&gt; 123</li>
</ul></li>
</ul>

<p>
LISP form could be:
</p>
<ul class="org-ul">
<li>An atom</li>
<li>An empty or non-list</li>
<li>Any list that has a symbol as its first element</li>
</ul>

<p>
<b>Special Forms</b> - is a primitive function specially marked so that its arguments are not all evaluated
</p>
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Special-Forms.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Special-Forms.html</a></li>
</ul>
</div>
<div id="outline-container-orgbe2ee59" class="outline-3">
<h3 id="orgbe2ee59"><span class="section-number-3">9.1.</span> Special Forms</h3>
<div class="outline-text-3" id="text-9-1">
<p>
and
</p>

<p>
    see Combining Conditions
catch
</p>

<p>
    see Catch and Throw
cond
</p>

<p>
    see Conditionals
condition-case
</p>

<p>
    see Handling Errors
defconst
</p>

<p>
    see Defining Variables
defvar
</p>

<p>
    see Defining Variables
function
</p>

<p>
    see Anonymous Functions
if
</p>

<p>
    see Conditionals
interactive
</p>

<p>
    see Interactive Call
lambda
</p>

<p>
    see Lambda Expressions
let
let*
</p>

<p>
    see Local Variables <a href="#org8287aaf">2</a>
or
</p>

<p>
    see Combining Conditions
prog1
prog2
progn
</p>

<p>
    see Sequencing
quote
</p>

<p>
    see Quoting
save-current-buffer
</p>

<p>
    see Current Buffer
save-excursion
</p>

<p>
    see Excursions
save-restriction
</p>

<p>
    see Narrowing
setq
</p>

<p>
    see Setting Variables
setq-default
</p>

<p>
    see Creating Buffer-Local
unwind-protect
</p>

<p>
    see Nonlocal Exits
while
</p>

<p>
see Iteration
</p>
</div>
</div>
</div>

<div id="outline-container-orgc8a09c1" class="outline-2">
<h2 id="orgc8a09c1"><span class="section-number-2">10.</span> dialects</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="https://en.wikipedia.org/wiki/Emacs_Lisp">https://en.wikipedia.org/wiki/Emacs_Lisp</a>
</p>

<ul class="org-ul">
<li>Emacs Lisp or Elisp</li>
<li>Common Lisp - for javaVM too</li>
<li>Scheme - simple semantics and few different ways to form expressions. more minimalist design</li>
<li>Clojure is a recent dialect . mainly the Java virtual machine</li>
</ul>
</div>
<div id="outline-container-org51c575e" class="outline-3">
<h3 id="org51c575e"><span class="section-number-3">10.1.</span> <span class="todo TODO">TODO</span> Common lisp vs Emacs Lisp</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/cl/Porting-Common-Lisp.html">https://www.gnu.org/software/emacs/manual/html_node/cl/Porting-Common-Lisp.html</a>
</p>
<ul class="org-ul">
<li>Case-insensitivity for symbols
<ul class="org-ul">
<li>Common LISP expressions are case-insensitive - cos 45 or COS 45 are same</li>
<li>Emacs lisp - case-sensitive</li>
</ul></li>
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4969512" class="outline-2">
<h2 id="org4969512"><span class="section-number-2">11.</span> types</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org5a3e739" class="outline-3">
<h3 id="org5a3e739"><span class="section-number-3">11.1.</span> basic</h3>
<div class="outline-text-3" id="text-11-1">
<p>
everything atom or list
</p>

<p>
object - instance of type, object is a piece of data used and manipulated by Lisp programs
</p>

<p>
Linked lists -  one of Lisp's major data structures
</p>

<p>
s-expression or sexp - for code and data structure : (x y z) stands for (x . (y . (z . NIL)))
</p>

<p>
Constants:
</p>
<ul class="org-ul">
<li>Numbers</li>
<li>The letter t, that stands for logical true.</li>
<li>The value nil, that stands for logical false, as well as an empty list.</li>
</ul>


<p>
atom - is a number or symbol or string in double quotation marks.
</p>

<p>
symbol - string of contiguous character - can consist of any number of alphanumeric characters other
than whitespace, open and closing parentheses, double and single quotes, backslash, comma, colon,
semicolon and vertical bar. To use these characters in a name, you need to use escape character (\).
</p>
<ul class="org-ul">
<li>hello-from-tutorials-point</li>
<li>123008907</li>
<li><b>hello</b></li>
<li>Block#221</li>
<li>abc123</li>
<li>+1</li>
<li>FOO                 ; A symbol named ‘FOO’, different from ‘foo’  for Emacs Lisp</li>
</ul>

<p>
A string is a group of characters enclosed in double quotation marks. "Hello world!"
</p>

<p>
primitive types:
</p>
<ul class="org-ul">
<li>integer</li>
<li>float</li>
<li>cons</li>
<li>symbol</li>
<li>string</li>
<li>vector</li>
<li>hash-table</li>
<li>subr</li>
<li>byte-code function</li>
<li>record</li>
<li>plus several special types, such as buffer, that are related to editing</li>
</ul>

<p>
single inheritance?
</p>

<p>
each object belongs to one and only one primitive type
</p>

<p>
single quote: (write '(* 2 3)) - atoms or lists literally and don't want them evaluated or treated as function calls.
</p>
<ul class="org-ul">
<li>Quoting - '123, (quote (+ 1 2))</li>
<li>Self-Evaluating Forms - evaluate to themselves '123 =&gt; 123 (eval '123) =&gt; 123</li>
</ul>

<p>
types of types:
</p>
<ul class="org-ul">
<li>Lisp programming types</li>
<li>editing - unique to Emacs Lisp</li>
</ul>
</div>
</div>
<div id="outline-container-org6e8a10a" class="outline-3">
<h3 id="org6e8a10a"><span class="section-number-3">11.2.</span> literals</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-elisp">(print 1e3)
(print 'this-a-symbol)
(print 'vector-&gt;list)
(print 'symbol?)

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Pair / Cons Cell</span>
(print '(a . b))
(print'(a . 2999))

(print <span style="color: #95e454;">"list"</span>)
(print'(+ 2 3 (3 4) (5 6 (+ 3 4)) 10 'a 'b <span style="color: #95e454;">"hello"</span> ))

(print <span style="color: #95e454;">"vectors"</span>)
(print [1 2 3 4 (+ 1 2 3 54)])
</pre>
</div>
</div>
</div>
