sources_org/lisp.org
** lists
sequence
- list - not a single primitive object; it is made of cons cells, one cell per element
- array: vector, string, char-table, bool-vector - fixed-length object with a slot for each of its elements.
*** basic
*list* is a Linked lists is a sequence of atoms and/or other lists enclosed in parentheses.
- Lists in Lisp are not a primitive data type they are built up from "cons cells"
- "cons cells" - ordered pair - (CAR CDR)
- each cell refers to the next one: CARs of the cons cells hold the elements of the list, and the CDRs are
 used to chain the list
- CDR of the last cons cell in a list is ‘nil’

: (setq bouquet '(rose violet buttercup))
#+begin_src text
     bouquet
      |
      |    --------------       ---------------       ----------------
      |   | car   | cdr  |     | car    | cdr  |     | car     | cdr  |
       -->| rose  |   o------->| violet |   o------->| butter- |  nil |
          |       |      |     |        |      |     | cup     |      |
           --------------       ---------------       ----------------
#+end_src

*** Association Lists
(alist-get key alist &optional default remove testfn)
**** clist
values and the keys - may be any Lisp objects
#+begin_src elisp :results output
;; Lists
(print '(10 203 40 "hello" () ("empty" 65)))

;; alist
(print '((a . b) (x . y) (2 . 3) (4 . (1 2 3 4 5))))

(print (cons 'a 'b))

(print (cons 'a (cons 'b (cons 'c nil))))

#+end_src

#+RESULTS:
:
: (10 203 40 "hello" nil ("empty" 65))
:
: ((a . b) (x . y) (2 . 3) (4 1 2 3 4 5))
:
: (a . b)
:
: (a b c)

#+begin_src elisp :results output :exports both :eval no
(setq
 vv
 (list
  (cons "aa" 23)
  (cons "bb" 24)
  (cons "cc" 33)))
(print vv)
(print (alist-get "aa" vv 999 nil 'string-equal))

;; get the value with key "bb". if not found, return 999. use string-equal for comparison
;; (print (alist-get "bb" xx 999 nil 'string-equal))
#+end_src

#+RESULTS:
:
: (("aa" . 23) ("bb" . 24) ("cc" . 33))
:
: 23

#+begin_src elisp :results output :exports both :eval no
(let (clist)
  (setq clist
          (append (list (cons "sd" "asd"))
                  clist))
  (print clist)
    )
#+end_src

#+RESULTS:
:
: (("sd" . "asd"))

**** alist - Association Lists
#+begin_src elisp :results output
(print '((a  b) (x  y) (2  3) (4  (1 2 3 4 5))))
(print (list (list 'a 'b) (list 'x 'y) (list 2 3) (list 2 '(1 2 3 4 5))))
#+end_src

#+RESULTS:
:
: ((a b) (x y) (2 3) (4 (1 2 3 4 5)))
:
: ((a b) (x y) (2 3) (2 (1 2 3 4 5)))

**** plist - Property Lists
requires less parenthesis and it is more human readable

two types:
- Text Properties.
- Symbol Properties.
***** plist examples
#+begin_src elisp :results output
(setq myvar '(:key1 value1 :key2 value2 :key3 1002.23 :key4 (a b c d e)))
(print (cl-loop for key in myvar by 'cddr
               collecting key))

#+end_src

#+RESULTS:
:
: (:key1 :key2 :key3 :key4)


#+begin_src elisp :results output
(print '(:key1 value1 :key2 value2 :key3 1002.23 :key4 (a b c d e)))
(print '(
:key1  value1
:key2  value2
:key3  value3
:key4  (a b c d e )
))
#+end_src

#+RESULTS:
:
: (:key1 value1 :key2 value2 :key3 1002.23 :key4 (a b c d e))
:
: (:key1 value1 :key2 value2 :key3 value3 :key4 (a b c d e))

***** functions
- (plist-get plist property)
- (plist-member plist property ) ; check
- (plist-put plist property value)
- get list of keys: (print (cl-loop for key in myvar by 'cddr collecting key))
***** Symbol Properties
- get symbol property :: get property from symbol. `eq' used, so any object is a legitimate property.
- put symbol property value :: .
- symbol-plist symbol :: .
***** text properties

**** examples plist, assoc, mapcar
#+begin_src elisp :results output
(setq dict '((pine . cones)
             (oak . acorns)
             (maple . seeds)))

(print dict)
;; Get a cell associated with a key
(print (assoc 'oak dict))
(print (assoc 'wrong dict))

(print (list
       (car (assoc 'oak dict))
       (cdr (assoc 'oak dict))
       ))
(print (car (assoc 'oak dict)))
;; Get all keys
(print (mapcar #'car dict))
;; Get all values
(print (mapcar #'cdr dict))
#+end_src

#+RESULTS:
#+begin_example

((pine . cones) (oak . acorns) (maple . seeds))

(oak . acorns)

nil

(oak acorns)

oak

(pine oak maple)

(cones acorns seeds)
#+end_example
