lisp.html

<div id="outline-container-orgce6c9ba" class="outline-3">
<h3 id="orgce6c9ba"><span class="section-number-3">11.3.</span> lists</h3>
<div class="outline-text-3" id="text-11-3">
<p>
sequence
</p>
<ul class="org-ul">
<li>list - not a single primitive object; it is made of cons cells, one cell per element</li>
<li>array: vector, string, char-table, bool-vector - fixed-length object with a slot for each of its elements.</li>
</ul>
</div>
<div id="outline-container-orgdef3476" class="outline-4">
<h4 id="orgdef3476"><span class="section-number-4">11.3.1.</span> basic</h4>
<div class="outline-text-4" id="text-11-3-1">
<p>
<b>list</b> is a Linked lists is a sequence of atoms and/or other lists enclosed in parentheses.
</p>
<ul class="org-ul">
<li>Lists in Lisp are not a primitive data type they are built up from "cons cells"</li>
<li>"cons cells" - ordered pair - (CAR CDR)</li>
<li>each cell refers to the next one: CARs of the cons cells hold the elements of the list, and the CDRs are
used to chain the list</li>
<li>CDR of the last cons cell in a list is ‘nil’</li>
</ul>

<pre class="example">
(setq bouquet '(rose violet buttercup))
</pre>

<div class="org-src-container">
<pre class="src src-text">     bouquet
      |
      |    --------------       ---------------       ----------------
      |   | car   | cdr  |     | car    | cdr  |     | car     | cdr  |
       --&gt;| rose  |   o-------&gt;| violet |   o-------&gt;| butter- |  nil |
          |       |      |     |        |      |     | cup     |      |
           --------------       ---------------       ----------------
</pre>
</div>
</div>
</div>

<div id="outline-container-org7920e2a" class="outline-4">
<h4 id="org7920e2a"><span class="section-number-4">11.3.2.</span> Association Lists</h4>
<div class="outline-text-4" id="text-11-3-2">
<p>
(alist-get key alist &amp;optional default remove testfn)
</p>
</div>
<ol class="org-ol">
<li><a id="org1e0d82a"></a>clist<br />
<div class="outline-text-5" id="text-11-3-2-1">
<p>
values and the keys - may be any Lisp objects
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Lists</span>
(print '(10 203 40 <span style="color: #95e454;">"hello"</span> () (<span style="color: #95e454;">"empty"</span> 65)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">alist</span>
(print '((a . b) (x . y) (2 . 3) (4 . (1 2 3 4 5))))

(print (cons 'a 'b))

(print (cons 'a (cons 'b (cons 'c nil))))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span>
 vv
 (list
  (cons <span style="color: #95e454;">"aa"</span> 23)
  (cons <span style="color: #95e454;">"bb"</span> 24)
  (cons <span style="color: #95e454;">"cc"</span> 33)))
(print vv)
(print (alist-get <span style="color: #95e454;">"aa"</span> vv 999 nil 'string-equal))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">get the value with key "bb". if not found, return 999. use string-equal for comparison</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print (alist-get "bb" xx 999 nil 'string-equal))</span>
</pre>
</div>

<pre class="example">

(("aa" . 23) ("bb" . 24) ("cc" . 33))

23
</pre>


<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">let</span> (clist)
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> clist
          (append (list (cons <span style="color: #95e454;">"sd"</span> <span style="color: #95e454;">"asd"</span>))
                  clist))
  (print clist)
    )
</pre>
</div>

<pre class="example">

(("sd" . "asd"))
</pre>
</div>
</li>

<li><a id="org7892571"></a>alist - Association Lists<br />
<div class="outline-text-5" id="text-11-3-2-2">
<div class="org-src-container">
<pre class="src src-elisp">(print '((a  b) (x  y) (2  3) (4  (1 2 3 4 5))))
(print (list (list 'a 'b) (list 'x 'y) (list 2 3) (list 2 '(1 2 3 4 5))))
</pre>
</div>
</div>
</li>

<li><a id="org63c5094"></a>plist - Property Lists<br />
<div class="outline-text-5" id="text-11-3-2-3">
<p>
requires less parenthesis and it is more human readable
</p>

<p>
two types:
</p>
<ul class="org-ul">
<li>Text Properties.</li>
<li>Symbol Properties.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgd1843ae"></a>plist examples<br />
<div class="outline-text-6" id="text-11-3-2-3-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> myvar '(<span style="color: #e5786d;">:key1</span> value1 <span style="color: #e5786d;">:key2</span> value2 <span style="color: #e5786d;">:key3</span> 1002.23 <span style="color: #e5786d;">:key4</span> (a b c d e)))
(print (<span style="color: #8ac6f2; font-weight: bold;">cl-loop</span> for key in myvar by 'cddr
               collecting key))

</pre>
</div>


<div class="org-src-container">
<pre class="src src-elisp">(print '(<span style="color: #e5786d;">:key1</span> value1 <span style="color: #e5786d;">:key2</span> value2 <span style="color: #e5786d;">:key3</span> 1002.23 <span style="color: #e5786d;">:key4</span> (a b c d e)))
(print '(
<span style="color: #e5786d;">:key1</span>  value1
<span style="color: #e5786d;">:key2</span>  value2
<span style="color: #e5786d;">:key3</span>  value3
<span style="color: #e5786d;">:key4</span>  (a b c d e )
))
</pre>
</div>
</div>
</li>

<li><a id="org51157c6"></a>functions<br />
<div class="outline-text-6" id="text-11-3-2-3-2">
<ul class="org-ul">
<li>(plist-get plist property)</li>
<li>(plist-member plist property ) ; check</li>
<li>(plist-put plist property value)</li>
<li>get list of keys: (print (cl-loop for key in myvar by 'cddr collecting key))</li>
</ul>
</div>
</li>
<li><a id="orgbf84ad5"></a>Symbol Properties<br />
<div class="outline-text-6" id="text-11-3-2-3-3">
<dl class="org-dl">
<dt>get symbol property</dt><dd>get property from symbol. `eq' used, so any object is a legitimate property.</dd>
<dt>put symbol property value</dt><dd>.</dd>
<dt>symbol-plist symbol</dt><dd>.</dd>
</dl>
</div>
</li>
<li><a id="org11ea8f3"></a>text properties<br /></li>
</ol>
</li>

<li><a id="org2fd6812"></a>examples plist, assoc, mapcar<br />
<div class="outline-text-5" id="text-11-3-2-4">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> dict '((pine . cones)
             (oak . acorns)
             (maple . seeds)))

(print dict)
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Get a cell associated with a key</span>
(print (assoc 'oak dict))
(print (assoc 'wrong dict))

(print (list
       (car (assoc 'oak dict))
       (cdr (assoc 'oak dict))
       ))
(print (car (assoc 'oak dict)))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Get all keys</span>
(print (mapcar #'car dict))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Get all values</span>
(print (mapcar #'cdr dict))
</pre>
</div>
</div>
</li>
</ol>
</div>
