lisp.md


<a id="org3397c7a"></a>

## lists

sequence

-   list - not a single primitive object; it is made of cons cells, one cell per element
-   array: vector, string, char-table, bool-vector - fixed-length object with a slot for each of its elements.


<a id="orgf89e4cc"></a>

### basic

**list** is a Linked lists is a sequence of atoms and/or other lists enclosed in parentheses.

-   Lists in Lisp are not a primitive data type they are built up from "cons cells"
-   "cons cells" - ordered pair - (CAR CDR)
-   each cell refers to the next one: CARs of the cons cells hold the elements of the list, and the CDRs are
    used to chain the list
-   CDR of the last cons cell in a list is ‘nil’

    (setq bouquet '(rose violet buttercup))

    bouquet
     |
     |    --------------       ---------------       ----------------
     |   | car   | cdr  |     | car    | cdr  |     | car     | cdr  |
      -->| rose  |   o------->| violet |   o------->| butter- |  nil |
         |       |      |     |        |      |     | cup     |      |
          --------------       ---------------       ----------------


<a id="orgf0b77a8"></a>

### Association Lists

(alist-get key alist &optional default remove testfn)

1.  clist

    values and the keys - may be any Lisp objects
    
        ;; Lists
        (print '(10 203 40 "hello" () ("empty" 65)))
        
        ;; alist
        (print '((a . b) (x . y) (2 . 3) (4 . (1 2 3 4 5))))
        
        (print (cons 'a 'b))
        
        (print (cons 'a (cons 'b (cons 'c nil))))
    
        (setq
         vv
         (list
          (cons "aa" 23)
          (cons "bb" 24)
          (cons "cc" 33)))
        (print vv)
        (print (alist-get "aa" vv 999 nil 'string-equal))
        
        ;; get the value with key "bb". if not found, return 999. use string-equal for comparison
        ;; (print (alist-get "bb" xx 999 nil 'string-equal))
    
        
        (("aa" . 23) ("bb" . 24) ("cc" . 33))
        
        23
    
        (let (clist)
          (setq clist
                  (append (list (cons "sd" "asd"))
                          clist))
          (print clist)
            )
    
        
        (("sd" . "asd"))

2.  alist - Association Lists

        (print '((a  b) (x  y) (2  3) (4  (1 2 3 4 5))))
        (print (list (list 'a 'b) (list 'x 'y) (list 2 3) (list 2 '(1 2 3 4 5))))

3.  plist - Property Lists

    requires less parenthesis and it is more human readable
    
    two types:
    
    -   Text Properties.
    -   Symbol Properties.
    
    1.  plist examples
    
            (setq myvar '(:key1 value1 :key2 value2 :key3 1002.23 :key4 (a b c d e)))
            (print (cl-loop for key in myvar by 'cddr
                           collecting key))
        
            (print '(:key1 value1 :key2 value2 :key3 1002.23 :key4 (a b c d e)))
            (print '(
            :key1  value1
            :key2  value2
            :key3  value3
            :key4  (a b c d e )
            ))
    
    2.  functions
    
        -   (plist-get plist property)
        -   (plist-member plist property ) ; check
        -   (plist-put plist property value)
        -   get list of keys: (print (cl-loop for key in myvar by 'cddr collecting key))
    
    3.  Symbol Properties
    
        -   **get symbol property:** get property from symbol. \`eq' used, so any object is a legitimate property.
        -   **put symbol property value:** .
        -   **symbol-plist symbol:** .
    
    4.  text properties

4.  examples plist, assoc, mapcar

        (setq dict '((pine . cones)
                     (oak . acorns)
                     (maple . seeds)))
        
        (print dict)
        ;; Get a cell associated with a key
        (print (assoc 'oak dict))
        (print (assoc 'wrong dict))
        
        (print (list
               (car (assoc 'oak dict))
               (cdr (assoc 'oak dict))
               ))
        (print (car (assoc 'oak dict)))
        ;; Get all keys
        (print (mapcar #'car dict))
        ;; Get all values
        (print (mapcar #'cdr dict))
