sources_org/lisp.org
*** list operators
- cons		construct
- car		return first element of list
- cdr		return all elements of list except of first
- list		wrap to list ()
- length/seq-length - get length
- nthcdr n	without first n elements
- nth n	get n element, starting from 0
- last		last element of list
- reverse seq
- append, nconc add elements to list
- member, memq - check if there is memeber with equal or eq - like “in” in Python
- push		add element existing list
- (setf (alist-get <key> <alist>) <value>)- replace element of list
- copy-sequence/tree - make copy
- reverse/nreverse - non destructive and destructive
- seq-elt	get element at index 0 - (len-1)
- seq-drop	[n:]
- seq-take	[:n]
- seq-filter PRED SEQUENCE) Return a list of all the elements in SEQUENCE for which PRED returns non-nil.
- (add-to-ordered-list LIST-VAR ELEMENT 3) ; Add ELEMENT to the value of LIST-VAR if it isn’t there yet in position.
**** init, append
#+begin_src elisp :results output :exports both :eval no
(defvar cc nil)
(setq cc (cons "asd2" cc))
(print cc)
#+end_src

#+RESULTS:
:
: ("asd2" "asd")

**** indexing
- (assoc KEY ALIST &optional TESTFN) - value is actually the first element of ALIST whose car equals KEY
- (assoc-string KEY LIST &optional CASE-FOLD) - for strings

#+begin_src elisp :results output :exports both :eval no
(defconst sisheng-vowel-table
  '(("ā" "a" "ā" "á" "ǎ" "à")
    ("ē" "e" "ē" "é" "ě" "è")
    ("ī" "i" "ī" "í" "ǐ" "ì")
    ("ō" "o" "ō" "ó" "ǒ" "ò")
    ("ū" "u" "ū" "ú" "ǔ" "ù")
    ("ǖ" "v" "ǖ" "ǘ" "ǚ" "ǜ")
    ("üē" "ve" "üē" "üé" "üě" "üè")))

(print (assoc-string "üē" sisheng-vowel-table))
#+end_src

#+RESULTS:
:
: ("üē" "ve" "üē" "üé" "üě" "üè")

**** cons, car, cdr
#+begin_src elisp :results output :exports both :eval no
;; (print (cons 'pine '(fir oak maple)))
(print (list
 (cons 'pine '(fir oak maple))
 (car '(rose violet daisy buttercup))
 (cdr '(rose violet daisy buttercup))
 ))
#+end_src

#+RESULTS:
:
: ((pine fir oak maple) rose (violet daisy buttercup))

**** nthcdr, nth, setcar, setcdr
#+begin_src elisp :results value
(list
 (nthcdr 2 '(rose fir oak maple))
 (nth 2 '(rose fir oak maple))
 (nth 1 '(rose fir oak maple))
 )
#+end_src

#+RESULTS:
| (oak maple) | oak | fir |

setcar

#+begin_src elisp :results output
(setq animals (list 'antelope 'giraffe 'lion 'tiger))
(print animals)
(print (setcar animals 'hippopotamus) )
(print animals)
#+end_src

#+RESULTS:
:
: (antelope giraffe lion tiger)
:
: hippopotamus
:
: (hippopotamus giraffe lion tiger)

setcdr
#+begin_src elisp :results output
(setq animals (list 'antelope 'giraffe 'lion 'tiger))
(print animals)
(print (setcdr animals 'hippopotamus) )
(print animals)
#+end_src

#+RESULTS:
:
: (antelope giraffe lion tiger)
:
: hippopotamus
:
: (antelope . hippopotamus)

