lisp.html
<div id="outline-container-orgf8d8e5b" class="outline-4">
<h4 id="orgf8d8e5b"><span class="section-number-4">11.3.3.</span> list operators</h4>
<div class="outline-text-4" id="text-11-3-3">
<ul class="org-ul">
<li>cons		construct</li>
<li>car		return first element of list</li>
<li>cdr		return all elements of list except of first</li>
<li>list		wrap to list ()</li>
<li>length/seq-length - get length</li>
<li>nthcdr n	without first n elements</li>
<li>nth n	get n element, starting from 0</li>
<li>last		last element of list</li>
<li>reverse seq</li>
<li>append, nconc add elements to list</li>
<li>member, memq - check if there is memeber with equal or eq - like “in” in Python</li>
<li>push		add element existing list</li>
<li>(setf (alist-get &lt;key&gt; &lt;alist&gt;) &lt;value&gt;)- replace element of list</li>
<li>copy-sequence/tree - make copy</li>
<li>reverse/nreverse - non destructive and destructive</li>
<li>seq-elt	get element at index 0 - (len-1)</li>
<li>seq-drop	[n:]</li>
<li>seq-take	[:n]</li>
<li>seq-filter PRED SEQUENCE) Return a list of all the elements in SEQUENCE for which PRED returns non-nil.</li>
<li>(add-to-ordered-list LIST-VAR ELEMENT 3) ; Add ELEMENT to the value of LIST-VAR if it isn’t there yet in position.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orga27035b"></a>init, append<br />
<div class="outline-text-5" id="text-11-3-3-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">cc</span> nil)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> cc (cons <span style="color: #95e454;">"asd2"</span> cc))
(print cc)
</pre>
</div>

<pre class="example">

("asd2" "asd")
</pre>
</div>
</li>

<li><a id="org5f63b6c"></a>indexing<br />
<div class="outline-text-5" id="text-11-3-3-2">
<ul class="org-ul">
<li>(assoc KEY ALIST &amp;optional TESTFN) - value is actually the first element of ALIST whose car equals KEY</li>
<li>(assoc-string KEY LIST &amp;optional CASE-FOLD) - for strings</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defconst</span> <span style="color: #cae682;">sisheng-vowel-table</span>
  '((<span style="color: #95e454;">"&#257;"</span> <span style="color: #95e454;">"a"</span> <span style="color: #95e454;">"&#257;"</span> <span style="color: #95e454;">"&#225;"</span> <span style="color: #95e454;">"&#462;"</span> <span style="color: #95e454;">"&#224;"</span>)
    (<span style="color: #95e454;">"&#275;"</span> <span style="color: #95e454;">"e"</span> <span style="color: #95e454;">"&#275;"</span> <span style="color: #95e454;">"&#233;"</span> <span style="color: #95e454;">"&#283;"</span> <span style="color: #95e454;">"&#232;"</span>)
    (<span style="color: #95e454;">"&#299;"</span> <span style="color: #95e454;">"i"</span> <span style="color: #95e454;">"&#299;"</span> <span style="color: #95e454;">"&#237;"</span> <span style="color: #95e454;">"&#464;"</span> <span style="color: #95e454;">"&#236;"</span>)
    (<span style="color: #95e454;">"&#333;"</span> <span style="color: #95e454;">"o"</span> <span style="color: #95e454;">"&#333;"</span> <span style="color: #95e454;">"&#243;"</span> <span style="color: #95e454;">"&#466;"</span> <span style="color: #95e454;">"&#242;"</span>)
    (<span style="color: #95e454;">"&#363;"</span> <span style="color: #95e454;">"u"</span> <span style="color: #95e454;">"&#363;"</span> <span style="color: #95e454;">"&#250;"</span> <span style="color: #95e454;">"&#468;"</span> <span style="color: #95e454;">"&#249;"</span>)
    (<span style="color: #95e454;">"&#470;"</span> <span style="color: #95e454;">"v"</span> <span style="color: #95e454;">"&#470;"</span> <span style="color: #95e454;">"&#472;"</span> <span style="color: #95e454;">"&#474;"</span> <span style="color: #95e454;">"&#476;"</span>)
    (<span style="color: #95e454;">"&#252;&#275;"</span> <span style="color: #95e454;">"ve"</span> <span style="color: #95e454;">"&#252;&#275;"</span> <span style="color: #95e454;">"&#252;&#233;"</span> <span style="color: #95e454;">"&#252;&#283;"</span> <span style="color: #95e454;">"&#252;&#232;"</span>)))

(print (assoc-string <span style="color: #95e454;">"&#252;&#275;"</span> sisheng-vowel-table))
</pre>
</div>

<pre class="example">

("üē" "ve" "üē" "üé" "üě" "üè")
</pre>
</div>
</li>

<li><a id="org50ab10a"></a>cons, car, cdr<br />
<div class="outline-text-5" id="text-11-3-3-3">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print (cons 'pine '(fir oak maple)))</span>
(print (list
 (cons 'pine '(fir oak maple))
 (car '(rose violet daisy buttercup))
 (cdr '(rose violet daisy buttercup))
 ))
</pre>
</div>

<pre class="example">

((pine fir oak maple) rose (violet daisy buttercup))
</pre>
</div>
</li>

<li><a id="orgdcc1ac4"></a>nthcdr, nth, setcar, setcdr<br />
<div class="outline-text-5" id="text-11-3-3-4">
<div class="org-src-container">
<pre class="src src-elisp">(list
 (nthcdr 2 '(rose fir oak maple))
 (nth 2 '(rose fir oak maple))
 (nth 1 '(rose fir oak maple))
 )
</pre>
</div>

<p>
setcar
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> animals (list 'antelope 'giraffe 'lion 'tiger))
(print animals)
(print (setcar animals 'hippopotamus) )
(print animals)
</pre>
</div>

<p>
setcdr
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> animals (list 'antelope 'giraffe 'lion 'tiger))
(print animals)
(print (setcdr animals 'hippopotamus) )
(print animals)
</pre>
</div>
</div>
</li>
