lisp.md


<a id="org6ce23d8"></a>

### list operators

-   cons		construct
-   car		return first element of list
-   cdr		return all elements of list except of first
-   list		wrap to list ()
-   length/seq-length - get length
-   nthcdr n	without first n elements
-   nth n	get n element, starting from 0
-   last		last element of list
-   reverse seq
-   append, nconc add elements to list
-   member, memq - check if there is memeber with equal or eq - like “in” in Python
-   push		add element existing list
-   (setf (alist-get <key> <alist>) <value>)- replace element of list
-   copy-sequence/tree - make copy
-   reverse/nreverse - non destructive and destructive
-   seq-elt	get element at index 0 - (len-1)
-   seq-drop	[n:]
-   seq-take	[:n]
-   seq-filter PRED SEQUENCE) Return a list of all the elements in SEQUENCE for which PRED returns non-nil.
-   (add-to-ordered-list LIST-VAR ELEMENT 3) ; Add ELEMENT to the value of LIST-VAR if it isn’t there yet in position.

1.  init, append

        (defvar cc nil)
        (setq cc (cons "asd2" cc))
        (print cc)
    
        
        ("asd2" "asd")

2.  indexing

    -   (assoc KEY ALIST &optional TESTFN) - value is actually the first element of ALIST whose car equals KEY
    -   (assoc-string KEY LIST &optional CASE-FOLD) - for strings
    
        (defconst sisheng-vowel-table
          '(("ā" "a" "ā" "á" "ǎ" "à")
            ("ē" "e" "ē" "é" "ě" "è")
            ("ī" "i" "ī" "í" "ǐ" "ì")
            ("ō" "o" "ō" "ó" "ǒ" "ò")
            ("ū" "u" "ū" "ú" "ǔ" "ù")
            ("ǖ" "v" "ǖ" "ǘ" "ǚ" "ǜ")
            ("üē" "ve" "üē" "üé" "üě" "üè")))
        
        (print (assoc-string "üē" sisheng-vowel-table))
    
        
        ("üē" "ve" "üē" "üé" "üě" "üè")

3.  cons, car, cdr

        ;; (print (cons 'pine '(fir oak maple)))
        (print (list
         (cons 'pine '(fir oak maple))
         (car '(rose violet daisy buttercup))
         (cdr '(rose violet daisy buttercup))
         ))
    
        
        ((pine fir oak maple) rose (violet daisy buttercup))

4.  nthcdr, nth, setcar, setcdr

        (list
         (nthcdr 2 '(rose fir oak maple))
         (nth 2 '(rose fir oak maple))
         (nth 1 '(rose fir oak maple))
         )
    
    setcar
    
        (setq animals (list 'antelope 'giraffe 'lion 'tiger))
        (print animals)
        (print (setcar animals 'hippopotamus) )
        (print animals)
    
    setcdr
    
        (setq animals (list 'antelope 'giraffe 'lion 'tiger))
        (print animals)
        (print (setcdr animals 'hippopotamus) )
        (print animals)
