sources_org/lisp.org
**** length, nth, cl-position, car, cdr, cons, reverse, append, remove-if-not, null, delq, push, pop
#+begin_src elisp :results output
(print (length '(1 2 3 4 5 6)))
;; nth element of a list
(print (list
(nth 0 '(0 1 2 3 4 5))
(nth 5 '(0 1 2 3 4 5))
(nth 10 '(0 1 2 3 4 5))
))

;; Position of list element (emacs 24.4 or later)
(print (cl-position 7 '(5 6 7 8)))

;; cdr - Removes first element of the list, returns the list tail.
(print  (cdr '(1 2 3 4 5)))
;; car - Returns the first list element
(print (car '(1 2 3 4 5)))
;; cons -  List constructor

(print (cons 10 '(1 2 3 4)))

;; reverse
(print (reverse '(1 2 3 4 5)))

;; append
(print (append '(1 "s") '( "a" "b" "c" "d")))

;; (print (remove-if-not (lambda (x) (> x 2))     '(1 2 3 4 5 6 7 8 9 10)))
#+end_src

#+RESULTS:
#+begin_example

6

(0 5 nil)

2

(2 3 4 5)

1

(10 1 2 3 4)

(5 4 3 2 1)

(1 "s" "a" "b" "c" "d")
#+end_example

#+begin_src elisp :results output
(print (list
        (null '(1 2 3 4 5))
        (null '())
        (null nil)))

;; Drop the firsts n elements of a list
(print (nthcdr 2 '(1 2 3 4)))

;; Delete an element of a list
(print (delq 1 '(1 2 3 4)))
(print (delq '(5) '(1 2 (5) 3 4)))
(print (delete '(5) '(1 2 (5) 3 4)))

;; Convert Vector to List
(print (number-sequence 0 10 2))

#+end_src

#+RESULTS:
#+begin_example

(nil t t)

(3 4)

(2 3 4)

(1 2 (5) 3 4)

(1 2 3 4)

(0 2 4 6 8 10)
#+end_example

#+begin_src elisp :results output :exports both :eval no
;; Modify list variables.
(setq alist '(a b c d e))
(print (push 'f alist))
(print (pop alist))
(print alist)
(print "asd")
#+end_src

#+RESULTS:
:
: (f a b c d e)
:
: f
:
: (a b c d e)
:
: "asd"

**** nconc
**** map
- (mapcar function sequence)
- (seq-some PRED SEQUENCE) - nil or first non-nil value returned by PRED.
#+begin_src elisp :results output :exports both :eval no
(print (mapcar #'1+ [1 2 3]))
#+end_src

#+RESULTS:
:
: (2 3 4)

#+begin_src elisp :results output :exports both :eval no
(setq properties '((a . 1)
                (b . 2)
                (c . 3)))
;; (print properties)
(seq-some (lambda (property) (print property)) properties)
(seq-some (lambda (property)
            (print (car property))
            (let
                  (print (car property)) )) ;; predicate for every property
                 properties)
#+end_src

#+RESULTS:
:
: (a . 1)
:
: a
:
: b
:
: c

https://www.gnu.org/software/emacs/manual/html_node/elisp/Mapping-Functions.html
**** USECASE: remove elemets of one list from another
#+begin_src elisp :results output :exports both :eval no
(defvar a '(2 3 45  4))
(defvar b '(3 45 6))
(mapc (lambda (x) (delq x a)) b )
(print a)

#+end_src

#+RESULTS:
:
: (2 4)

**** USECASE: find difference between lists
#+begin_src elisp :results output :exports both :eval no
(defvar a '(2 3 45  4))
(defvar b '(3 45 6))
(setq a2 (copy-tree a))
(seq-filter
(print a)

#+end_src

#+RESULTS:
:
: (2 4)

**** USECASE: get keys(), get values()
: (mapcar 'car '((key1 . value1) (key2 . value2) ...))
: (mapcar 'cdr '((key1 . value1) (key2 . value2) ...))
**** s
#+begin_src elisp :results output :exports both :eval no
(defun my-test (a b)
  (equal (car a) b))
;; (print (my-test '(a 3 4) )

(defun find-position (i elt seq)
  (seq-position seq elt (lambda (a b) (equal (nth i a) b))))

(defun find-next (i elt seq)
    (nth (1+ (find-position i elt seq)) seq))

;; (defun find-next (elt seq)
;;   (seq-position seq elt (lambda (a b) (equal (car a) b))))
;; (print (find-position 0 'a '((a 3 4) (b 4 2) (c 5 6))))  ; Returns1
(print (find-next 0 'b '((a 3 4) (b 4 2) (c 5 6))))  ; Returns1

#+end_src

#+RESULTS:
:
: (c 5 6)

