lisp.html

<li><a id="org014a811"></a>length, nth, cl-position, car, cdr, cons, reverse, append, remove-if-not, null, delq, push, pop<br />
<div class="outline-text-5" id="text-11-3-3-5">
<div class="org-src-container">
<pre class="src src-elisp">(print (length '(1 2 3 4 5 6)))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">nth element of a list</span>
(print (list
(nth 0 '(0 1 2 3 4 5))
(nth 5 '(0 1 2 3 4 5))
(nth 10 '(0 1 2 3 4 5))
))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Position of list element (emacs 24.4 or later)</span>
(print (cl-position 7 '(5 6 7 8)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">cdr - Removes first element of the list, returns the list tail.</span>
(print  (cdr '(1 2 3 4 5)))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">car - Returns the first list element</span>
(print (car '(1 2 3 4 5)))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">cons -  List constructor</span>

(print (cons 10 '(1 2 3 4)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">reverse</span>
(print (reverse '(1 2 3 4 5)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">append</span>
(print (append '(1 <span style="color: #95e454;">"s"</span>) '( <span style="color: #95e454;">"a"</span> <span style="color: #95e454;">"b"</span> <span style="color: #95e454;">"c"</span> <span style="color: #95e454;">"d"</span>)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print (remove-if-not (lambda (x) (&gt; x 2))     '(1 2 3 4 5 6 7 8 9 10)))</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(print (list
        (null '(1 2 3 4 5))
        (null '())
        (null nil)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Drop the firsts n elements of a list</span>
(print (nthcdr 2 '(1 2 3 4)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Delete an element of a list</span>
(print (delq 1 '(1 2 3 4)))
(print (delq '(5) '(1 2 (5) 3 4)))
(print (delete '(5) '(1 2 (5) 3 4)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Convert Vector to List</span>
(print (number-sequence 0 10 2))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Modify list variables.</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> alist '(a b c d e))
(print (<span style="color: #8ac6f2; font-weight: bold;">push</span> 'f alist))
(print (<span style="color: #8ac6f2; font-weight: bold;">pop</span> alist))
(print alist)
(print <span style="color: #95e454;">"asd"</span>)
</pre>
</div>

<pre class="example">

(f a b c d e)

f

(a b c d e)

"asd"
</pre>
</div>
</li>

<li><a id="orgcce4255"></a>nconc<br /></li>
<li><a id="org98e3f60"></a>map<br />
<div class="outline-text-5" id="text-11-3-3-7">
<ul class="org-ul">
<li>(mapcar function sequence)</li>
<li>(seq-some PRED SEQUENCE) - nil or first non-nil value returned by PRED.</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(print (mapcar #'1+ [1 2 3]))
</pre>
</div>

<pre class="example">

(2 3 4)
</pre>


<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> properties '((a . 1)
                (b . 2)
                (c . 3)))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print properties)</span>
(seq-some (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (property) (print property)) properties)
(seq-some (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (property)
            (print (car property))
            (<span style="color: #8ac6f2; font-weight: bold;">let</span>
                  (print (car property)) )) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">predicate for every property</span>
                 properties)
</pre>
</div>

<pre class="example">

(a . 1)

a

b

c
</pre>


<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Mapping-Functions.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Mapping-Functions.html</a>
</p>
</div>
</li>
<li><a id="org071ecdf"></a>USECASE: remove elemets of one list from another<br />
<div class="outline-text-5" id="text-11-3-3-8">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">a</span> '(2 3 45  4))
(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">b</span> '(3 45 6))
(mapc (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (x) (delq x a)) b )
(print a)

</pre>
</div>

<pre class="example">

(2 4)
</pre>
</div>
</li>

<li><a id="org7f7b02d"></a>USECASE: find difference between lists<br />
<div class="outline-text-5" id="text-11-3-3-9">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">a</span> '(2 3 45  4))
(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">b</span> '(3 45 6))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> a2 (copy-tree a))
(seq-filter
(print a)

</pre>
</div>

<pre class="example">

(2 4)
</pre>
</div>
</li>

<li><a id="orgb563272"></a>USECASE: get keys(), get values()<br />
<div class="outline-text-5" id="text-11-3-3-10">
<pre class="example">
(mapcar 'car '((key1 . value1) (key2 . value2) ...))
(mapcar 'cdr '((key1 . value1) (key2 . value2) ...))
</pre>
</div>
</li>
<li><a id="org9424df3"></a>s<br />
<div class="outline-text-5" id="text-11-3-3-11">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">my-test</span> (a b)
  (equal (car a) b))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print (my-test '(a 3 4) )</span>

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">find-position</span> (i elt seq)
  (seq-position seq elt (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (a b) (equal (nth i a) b))))

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">find-next</span> (i elt seq)
    (nth (1+ (find-position i elt seq)) seq))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(defun find-next (elt seq)</span>
<span style="color: #fa8072;">;;   </span><span style="color: #99968b; font-style: italic;">(seq-position seq elt (lambda (a b) (equal (car a) b))))</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print (find-position 0 'a '((a 3 4) (b 4 2) (c 5 6))))  ; Returns1</span>
(print (find-next 0 'b '((a 3 4) (b 4 2) (c 5 6))))  <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">Returns1</span>

</pre>
</div>

<pre class="example">

(c 5 6)
</pre>
</div>
</li>
</ol>
</div>
</div>
