sources_org/lisp.org
** symbol type
is literal (not evaluated).

- (symbolp sym) - Test if variable sym is a symbol
- (symbol-name 'sym) - ;; Get symbol as string
Get value from a symbol
- (symbol-value 'sym)
- (symbol-function 'sym)
- (symbol-plist 'sym)

Test if function is an elisp primitive
: (subrp (symbol-function 'goto-char))

#+begin_src elisp :results output
; Convert a symbol to string
(print (symbol-name 'wombat))
; Convert a String to Symbol
(print (intern "wombat"))
#+end_src

#+RESULTS:
:
: "wombat"
:
: wombat

** nil and t - special symbols that always evaluate to themselves
- symbol nil has three separate meanings:
  - it is a symbol with the name ‘nil’;
  - it is the logical truth value false;
  - it is the empty list—the list of zero elements.
- When used as a variable, nil always has the value nil.
- we write () when we wish to emphasize that it means the empty list, and we write nil when we wish to
  emphasize that it means the truth value false.
  - (cons 'foo ())                ; Emphasize the empty list
  - (setq foo-flag nil)           ; Emphasize the truth value false
- non-nil value is considered to be true
- *t* is the preferred way to represent the truth value true
- The symbol t always has the value t.

;;; Everything that is not "nil" is true:

** type conversion
#+begin_src elisp :results output
(list
 (cl-coerce '(a b c) 'vector)
 (cl-coerce 7.2 'float)
 (cl-coerce "a" 'character)
 (format "%s" 33.2222)
)

; Number <-> String
(print (number-to-string 1000))
(print (string-to-number "200"))

; Symbol <-> String
(print (symbol-name 'my-symbol))
(print (symbol-name :my-symbol))
; String to Symbol
(print (intern "some-symbol"))
#+end_src

#+RESULTS:
#+begin_example

"1000"

200

"my-symbol"

":my-symbol"

some-symbol
#+end_example

** get type or find type
#+begin_src elisp :results output
(print (list
 (type-of "a")
 (type-of 7.2)
 (type-of 'type-of)
))

(print (equal 'buffer (type-of (current-buffer))))
#+end_src

#+RESULTS:
:
: (string float symbol)
:
: t

** Basic Types Predicate
| Type   | Predicate | Literal         | Description                                       |
|--------+-----------+-----------------+---------------------------------------------------|
| Nil    | null      | nil '()         | Test if argument is nil                           |
| Number | numberp   | 100, 200e3      | Test if it is number.                             |
| String | stringp   | "hello"         | Test if it is string                              |
| Symbol | symbolp   | 'sym :keyworkd  | Test if it is a symbol.                           |
| Atom   | atom      | 'x "h" :key 200 | Everything that is not a list or pair is an atom. |
| List   | listp     | '(1 2 x y)      | Test if it is a list                              |
| Pair   | consp     | '( a . 200)     | Test if it is a pair (cons cell)                  |
| Vector | vectorp   | [1 200 'sym]    | Test if it is a vector                            |

| Object  | Predicate |
|---------+-----------|
| Buffer  | bufferp   |
| Window  | windowp   |
| Frame   | framep    |
| Process | processp  |
#+begin_src elisp :results output
(print (atom 10))
(print (null nil))
#+end_src

#+RESULTS:
:
: t
:
: t

