lisp.html

<div id="outline-container-orgd29f926" class="outline-3">
<h3 id="orgd29f926"><span class="section-number-3">11.4.</span> symbol type</h3>
<div class="outline-text-3" id="text-11-4">
<p>
is literal (not evaluated).
</p>

<ul class="org-ul">
<li>(symbolp sym) - Test if variable sym is a symbol</li>
<li>(symbol-name 'sym) - ;; Get symbol as string</li>
</ul>
<p>
Get value from a symbol
</p>
<ul class="org-ul">
<li>(symbol-value 'sym)</li>
<li>(symbol-function 'sym)</li>
<li>(symbol-plist 'sym)</li>
</ul>

<p>
Test if function is an elisp primitive
</p>
<pre class="example">
(subrp (symbol-function 'goto-char))
</pre>


<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">Convert a symbol to string</span>
(print (symbol-name 'wombat))
<span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">Convert a String to Symbol</span>
(print (intern <span style="color: #95e454;">"wombat"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org55f0167" class="outline-3">
<h3 id="org55f0167"><span class="section-number-3">11.5.</span> nil and t - special symbols that always evaluate to themselves</h3>
<div class="outline-text-3" id="text-11-5">
<ul class="org-ul">
<li>symbol nil has three separate meanings:
<ul class="org-ul">
<li>it is a symbol with the name ‘nil’;</li>
<li>it is the logical truth value false;</li>
<li>it is the empty list—the list of zero elements.</li>
</ul></li>
<li>When used as a variable, nil always has the value nil.</li>
<li>we write () when we wish to emphasize that it means the empty list, and we write nil when we wish to
emphasize that it means the truth value false.
<ul class="org-ul">
<li>(cons 'foo ())                ; Emphasize the empty list</li>
<li>(setq foo-flag nil)           ; Emphasize the truth value false</li>
</ul></li>
<li>non-nil value is considered to be true</li>
<li><b>t</b> is the preferred way to represent the truth value true</li>
<li>The symbol t always has the value t.</li>
</ul>

<p>
;;; Everything that is not "nil" is true:
</p>
</div>
</div>

<div id="outline-container-org3bff604" class="outline-3">
<h3 id="org3bff604"><span class="section-number-3">11.6.</span> type conversion</h3>
<div class="outline-text-3" id="text-11-6">
<div class="org-src-container">
<pre class="src src-elisp">(list
 (cl-coerce '(a b c) 'vector)
 (cl-coerce 7.2 'float)
 (cl-coerce <span style="color: #95e454;">"a"</span> 'character)
 (format <span style="color: #95e454;">"%s"</span> 33.2222)
)

<span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">Number &lt;-&gt; String</span>
(print (number-to-string 1000))
(print (string-to-number <span style="color: #95e454;">"200"</span>))

<span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">Symbol &lt;-&gt; String</span>
(print (symbol-name 'my-symbol))
(print (symbol-name <span style="color: #e5786d;">:my-symbol</span>))
<span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">String to Symbol</span>
(print (intern <span style="color: #95e454;">"some-symbol"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org08603e5" class="outline-3">
<h3 id="org08603e5"><span class="section-number-3">11.7.</span> get type or find type</h3>
<div class="outline-text-3" id="text-11-7">
<div class="org-src-container">
<pre class="src src-elisp">(print (list
 (type-of <span style="color: #95e454;">"a"</span>)
 (type-of 7.2)
 (type-of 'type-of)
))

(print (equal 'buffer (type-of (current-buffer))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2622159" class="outline-3">
<h3 id="org2622159"><span class="section-number-3">11.8.</span> Basic Types Predicate</h3>
<div class="outline-text-3" id="text-11-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Predicate</th>
<th scope="col" class="org-left">Literal</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Nil</td>
<td class="org-left">null</td>
<td class="org-left">nil '()</td>
<td class="org-left">Test if argument is nil</td>
</tr>

<tr>
<td class="org-left">Number</td>
<td class="org-left">numberp</td>
<td class="org-left">100, 200e3</td>
<td class="org-left">Test if it is number.</td>
</tr>

<tr>
<td class="org-left">String</td>
<td class="org-left">stringp</td>
<td class="org-left">"hello"</td>
<td class="org-left">Test if it is string</td>
</tr>

<tr>
<td class="org-left">Symbol</td>
<td class="org-left">symbolp</td>
<td class="org-left">'sym :keyworkd</td>
<td class="org-left">Test if it is a symbol.</td>
</tr>

<tr>
<td class="org-left">Atom</td>
<td class="org-left">atom</td>
<td class="org-left">'x "h" :key 200</td>
<td class="org-left">Everything that is not a list or pair is an atom.</td>
</tr>

<tr>
<td class="org-left">List</td>
<td class="org-left">listp</td>
<td class="org-left">'(1 2 x y)</td>
<td class="org-left">Test if it is a list</td>
</tr>

<tr>
<td class="org-left">Pair</td>
<td class="org-left">consp</td>
<td class="org-left">'( a . 200)</td>
<td class="org-left">Test if it is a pair (cons cell)</td>
</tr>

<tr>
<td class="org-left">Vector</td>
<td class="org-left">vectorp</td>
<td class="org-left">[1 200 'sym]</td>
<td class="org-left">Test if it is a vector</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Object</th>
<th scope="col" class="org-left">Predicate</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Buffer</td>
<td class="org-left">bufferp</td>
</tr>

<tr>
<td class="org-left">Window</td>
<td class="org-left">windowp</td>
</tr>

<tr>
<td class="org-left">Frame</td>
<td class="org-left">framep</td>
</tr>

<tr>
<td class="org-left">Process</td>
<td class="org-left">processp</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-elisp">(print (atom 10))
(print (null nil))
</pre>
</div>
</div>
</div>
