lisp.md


<a id="org839050d"></a>

## symbol type

is literal (not evaluated).

-   (symbolp sym) - Test if variable sym is a symbol
-   (symbol-name 'sym) - ;; Get symbol as string

Get value from a symbol

-   (symbol-value 'sym)
-   (symbol-function 'sym)
-   (symbol-plist 'sym)

Test if function is an elisp primitive

    (subrp (symbol-function 'goto-char))

    ; Convert a symbol to string
    (print (symbol-name 'wombat))
    ; Convert a String to Symbol
    (print (intern "wombat"))


<a id="org7576e41"></a>

## nil and t - special symbols that always evaluate to themselves

-   symbol nil has three separate meanings:
    -   it is a symbol with the name ‘nil’;
    -   it is the logical truth value false;
    -   it is the empty list—the list of zero elements.
-   When used as a variable, nil always has the value nil.
-   we write () when we wish to emphasize that it means the empty list, and we write nil when we wish to
    emphasize that it means the truth value false.
    -   (cons 'foo ())                ; Emphasize the empty list
    -   (setq foo-flag nil)           ; Emphasize the truth value false
-   non-nil value is considered to be true
-   **t** is the preferred way to represent the truth value true
-   The symbol t always has the value t.

;;; Everything that is not "nil" is true:


<a id="orgf7ebe4b"></a>

## type conversion

    (list
     (cl-coerce '(a b c) 'vector)
     (cl-coerce 7.2 'float)
     (cl-coerce "a" 'character)
     (format "%s" 33.2222)
    )
    
    ; Number <-> String
    (print (number-to-string 1000))
    (print (string-to-number "200"))
    
    ; Symbol <-> String
    (print (symbol-name 'my-symbol))
    (print (symbol-name :my-symbol))
    ; String to Symbol
    (print (intern "some-symbol"))


<a id="orgd09d285"></a>

## get type or find type

    (print (list
     (type-of "a")
     (type-of 7.2)
     (type-of 'type-of)
    ))
    
    (print (equal 'buffer (type-of (current-buffer))))


<a id="org1c418fb"></a>

## Basic Types Predicate

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Predicate</th>
<th scope="col" class="org-left">Literal</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Nil</td>
<td class="org-left">null</td>
<td class="org-left">nil '()</td>
<td class="org-left">Test if argument is nil</td>
</tr>


<tr>
<td class="org-left">Number</td>
<td class="org-left">numberp</td>
<td class="org-left">100, 200e3</td>
<td class="org-left">Test if it is number.</td>
</tr>


<tr>
<td class="org-left">String</td>
<td class="org-left">stringp</td>
<td class="org-left">"hello"</td>
<td class="org-left">Test if it is string</td>
</tr>


<tr>
<td class="org-left">Symbol</td>
<td class="org-left">symbolp</td>
<td class="org-left">'sym :keyworkd</td>
<td class="org-left">Test if it is a symbol.</td>
</tr>


<tr>
<td class="org-left">Atom</td>
<td class="org-left">atom</td>
<td class="org-left">'x "h" :key 200</td>
<td class="org-left">Everything that is not a list or pair is an atom.</td>
</tr>


<tr>
<td class="org-left">List</td>
<td class="org-left">listp</td>
<td class="org-left">'(1 2 x y)</td>
<td class="org-left">Test if it is a list</td>
</tr>


<tr>
<td class="org-left">Pair</td>
<td class="org-left">consp</td>
<td class="org-left">'( a . 200)</td>
<td class="org-left">Test if it is a pair (cons cell)</td>
</tr>


<tr>
<td class="org-left">Vector</td>
<td class="org-left">vectorp</td>
<td class="org-left">[1 200 'sym]</td>
<td class="org-left">Test if it is a vector</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Object</th>
<th scope="col" class="org-left">Predicate</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Buffer</td>
<td class="org-left">bufferp</td>
</tr>


<tr>
<td class="org-left">Window</td>
<td class="org-left">windowp</td>
</tr>


<tr>
<td class="org-left">Frame</td>
<td class="org-left">framep</td>
</tr>


<tr>
<td class="org-left">Process</td>
<td class="org-left">processp</td>
</tr>
</tbody>
</table>

    (print (atom 10))
    (print (null nil))
