lisp.html

<div id="outline-container-org5622745" class="outline-3">
<h3 id="org5622745"><span class="section-number-3">11.9.</span> evaluation process</h3>
<div class="outline-text-3" id="text-11-9">
<p>
As said in <a href="https://stackoverflow.com/questions/48363798/how-are-arguments-passed-into-functions-in-elisp">https://stackoverflow.com/questions/48363798/how-are-arguments-passed-into-functions-in-elisp</a>
 Passed by assignment, new variables created just like assignment works. Symbol of variable is evaluated first
 and then assignment to new symbol. (We do
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Mutability.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Mutability.html</a>
</p>

<p>
Mutability defines ability of functions to have side effect to argument.
</p>

<p>
If there is exist a function in Emacs Lisp that may modify type of argument then this argument may be
 considered as may be affected by side effect.
</p>
</div>
</div>
</div>
<div id="outline-container-org440f8f0" class="outline-2">
<h2 id="org440f8f0"><span class="section-number-2">12.</span> char</h2>
<div class="outline-text-2" id="text-12">
<p>
no way to distinguish integer from char.
</p>

<ul class="org-ul">
<li>get char at postion in string: (aref "foo" 0)</li>
<li>int/char to string: (char-to-string CHAR)</li>
</ul>

<pre class="example">
(equal 97 ?a ) ;; t
(equal 97 (string-to-char "a")) ;; t
</pre>


<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">let</span> (az)
  (<span style="color: #8ac6f2; font-weight: bold;">dolist</span> (h (number-sequence 97 122)) (<span style="color: #8ac6f2; font-weight: bold;">setq</span> az (cons (char-to-string h) az)) )
  (print az)
  )
</pre>
</div>

<pre class="example">

("z" "y" "x" "w" "v" "u" "t" "s" "r" "q" "p" "o" "n" "m" "l" "k" "j" "i" "h" "g" "f" "e" "d" "c" "b" "a")
</pre>


<p>
<a href="http://xahlee.info/emacs/emacs/elisp_char_datatype.html">http://xahlee.info/emacs/emacs/elisp_char_datatype.html</a>
</p>
</div>
</div>
<div id="outline-container-org3773949" class="outline-2">
<h2 id="org3773949"><span class="section-number-2">13.</span> strings</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>(format "notify-send &#x2013;expire-time 5000 -i emacs '%s'" msg)</li>
<li>(substring "abcdefg" 0 3)     ⇒ "abc"</li>
<li>(concat "abc" "-def")     ⇒ "abc-def"</li>
<li>(split-string "  two words " &amp;optional SEPARATORS OMIT-NULLS TRIM)   ⇒ ("two" "words")</li>
<li>(length "abc");; 3</li>
<li>(string-to-number "3")</li>
<li>(number-to-string 3)</li>
<li>(format "%d" 3)  ;; same as number-to-string but can also do format</li>
<li>endswith: (string-suffix-p "ending" a)</li>
<li>startswith: (string-prefix-p "beg" a)</li>
<li>compare string insensitive: (string-equal-ignore-case "a" "b")</li>
<li>replace substring: (defun string-replace (from-string to-string in-string)</li>
<li>split string: split-string (string &amp;optional separators omit-nulls trim)</li>
<li>combine-and-quote-strings (strings &amp;optional separator)</li>
<li>to characters: (split-string "abc" "" t) =&gt; ("a" "b" "c")</li>
<li>(number-to-string n) ; convert number to string</li>
</ul>

<p>
search, or contains
</p>
<ul class="org-ul">
<li>(string-match "ce" "central park") - find first occurance</li>
<li>(string-match-p "ce" "central park") - test that contains</li>
</ul>

<p>
libs:
</p>
<ul class="org-ul">
<li>subr.el</li>
</ul>

<p>
links
</p>
<ul class="org-ul">
<li><a href="http://xahlee.info/emacs/emacs/elisp_string_functions.html">http://xahlee.info/emacs/emacs/elisp_string_functions.html</a></li>
</ul>
</div>
<div id="outline-container-orge55dfa9" class="outline-3">
<h3 id="orge55dfa9"><span class="section-number-3">13.1.</span> ex</h3>
<div class="outline-text-3" id="text-13-1">
<div class="org-src-container">
<pre class="src src-elisp">(print (mapconcat 'identity '(<span style="color: #95e454;">"aaa"</span> <span style="color: #95e454;">"bbb"</span> <span style="color: #95e454;">"ccc"</span>) <span style="color: #95e454;">","</span>))
(print (split-string <span style="color: #95e454;">"aaa,bbb,ccc"</span> <span style="color: #95e454;">","</span>))
(print (string-match <span style="color: #95e454;">"ce"</span> <span style="color: #95e454;">"central park"</span>))
(print (make-string 5 ?x))
<span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">S-expression from String</span>
(print (read-from-string
            <span style="color: #95e454;">"(</span>
<span style="color: #95e454;">               (POINT1  (X  10.2323)  (Y   20.2323))</span>
<span style="color: #95e454;">               (POINT2  (x  0.2)          (Y 923.23))</span>
<span style="color: #95e454;">               (POINT3  (x -10.5)       (Y 78,23))</span>
<span style="color: #95e454;">             )"</span>))

(<span style="color: #8ac6f2; font-weight: bold;">setq</span> raw <span style="color: #95e454;">"(:x 10 :y 20 :z 30 :w \"hello world\")"</span>)
(print (read raw))
(print (plist-get (read raw) <span style="color: #e5786d;">:x</span>))

<span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">Serialize a s-expression</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> sexp '(<span style="color: #e5786d;">:x</span> 10 <span style="color: #e5786d;">:y</span> 20 <span style="color: #e5786d;">:z</span> 30 <span style="color: #e5786d;">:w</span> <span style="color: #95e454;">"hello world"</span>))
(print (prin1-to-string sexp))
</pre>
</div>

<pre class="example" id="org6e6af7b">

"aaa,bbb,ccc"

("aaa" "bbb" "ccc")

0

"xxxxx"

(((POINT1 (X 10.2323) (Y 20.2323)) (POINT2 (x 0.2) (Y 923.23)) (POINT3 (x -10.5) (Y 78 (\, 23)))) . 174)

(:x 10 :y 20 :z 30 :w "hello world")

10

"(:x 10 :y 20 :z 30 :w \"hello world\")"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdac7603" class="outline-2">
<h2 id="orgdac7603"><span class="section-number-2">14.</span> comments</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgffeaeb2" class="outline-3">
<h3 id="orgffeaeb2"><span class="section-number-3">14.1.</span> inside comments</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li>(`) backquoted comment</li>
</ul>
</div>
</div>
<div id="outline-container-org5724530" class="outline-3">
<h3 id="org5724530"><span class="section-number-3">14.2.</span> conventies</h3>
<div class="outline-text-3" id="text-14-2">
<ul class="org-ul">
<li>;; - for full line</li>
<li>; - for after line</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8386e81" class="outline-2">
<h2 id="org8386e81"><span class="section-number-2">15.</span> symbols and strings</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>(symbol-name 'some-symbol) -&gt; "some-symbol"</li>
<li>(make-symbol "foo") -&gt; 'foo</li>
</ul>
</div>
</div>
