lisp.md


<a id="org6d04d9a"></a>

## evaluation process

As said in <https://stackoverflow.com/questions/48363798/how-are-arguments-passed-into-functions-in-elisp>
 Passed by assignment, new variables created just like assignment works. Symbol of variable is evaluated first
 and then assignment to new symbol. (We do

<https://www.gnu.org/software/emacs/manual/html_node/elisp/Mutability.html>

Mutability defines ability of functions to have side effect to argument.

If there is exist a function in Emacs Lisp that may modify type of argument then this argument may be
 considered as may be affected by side effect.


<a id="org45c5d0b"></a>

# char

no way to distinguish integer from char.

-   get char at postion in string: (aref "foo" 0)
-   int/char to string: (char-to-string CHAR)

    (equal 97 ?a ) ;; t
    (equal 97 (string-to-char "a")) ;; t

    (let (az)
      (dolist (h (number-sequence 97 122)) (setq az (cons (char-to-string h) az)) )
      (print az)
      )

    
    ("z" "y" "x" "w" "v" "u" "t" "s" "r" "q" "p" "o" "n" "m" "l" "k" "j" "i" "h" "g" "f" "e" "d" "c" "b" "a")

<http://xahlee.info/emacs/emacs/elisp_char_datatype.html>


<a id="org419a3f3"></a>

# strings

-   (format "notify-send &#x2013;expire-time 5000 -i emacs '%s'" msg)
-   (substring "abcdefg" 0 3)     ⇒ "abc"
-   (concat "abc" "-def")     ⇒ "abc-def"
-   (split-string "  two words " &optional SEPARATORS OMIT-NULLS TRIM)   ⇒ ("two" "words")
-   (length "abc");; 3
-   (string-to-number "3")
-   (number-to-string 3)
-   (format "%d" 3)  ;; same as number-to-string but can also do format
-   endswith: (string-suffix-p "ending" a)
-   startswith: (string-prefix-p "beg" a)
-   compare string insensitive: (string-equal-ignore-case "a" "b")
-   replace substring: (defun string-replace (from-string to-string in-string)
-   split string: split-string (string &optional separators omit-nulls trim)
-   combine-and-quote-strings (strings &optional separator)
-   to characters: (split-string "abc" "" t) => ("a" "b" "c")
-   (number-to-string n) ; convert number to string

search, or contains

-   (string-match "ce" "central park") - find first occurance
-   (string-match-p "ce" "central park") - test that contains

libs:

-   subr.el

links

-   <http://xahlee.info/emacs/emacs/elisp_string_functions.html>


<a id="orged715fb"></a>

## ex

    (print (mapconcat 'identity '("aaa" "bbb" "ccc") ","))
    (print (split-string "aaa,bbb,ccc" ","))
    (print (string-match "ce" "central park"))
    (print (make-string 5 ?x))
    ; S-expression from String
    (print (read-from-string
                "(
                   (POINT1  (X  10.2323)  (Y   20.2323))
                   (POINT2  (x  0.2)          (Y 923.23))
                   (POINT3  (x -10.5)       (Y 78,23))
                 )"))
    
    (setq raw "(:x 10 :y 20 :z 30 :w \"hello world\")")
    (print (read raw))
    (print (plist-get (read raw) :x))
    
    ; Serialize a s-expression
    (setq sexp '(:x 10 :y 20 :z 30 :w "hello world"))
    (print (prin1-to-string sexp))

    
    "aaa,bbb,ccc"
    
    ("aaa" "bbb" "ccc")
    
    0
    
    "xxxxx"
    
    (((POINT1 (X 10.2323) (Y 20.2323)) (POINT2 (x 0.2) (Y 923.23)) (POINT3 (x -10.5) (Y 78 (\, 23)))) . 174)
    
    (:x 10 :y 20 :z 30 :w "hello world")
    
    10
    
    "(:x 10 :y 20 :z 30 :w \"hello world\")"


<a id="org821bb7a"></a>

# comments


<a id="org34319d2"></a>

## inside comments

-   (\`) backquoted comment


<a id="org8c1bd52"></a>

## conventies

-   ;; - for full line
-   ; - for after line


<a id="orge22c75b"></a>

# symbols and strings

-   (symbol-name 'some-symbol) -> "some-symbol"
-   (make-symbol "foo") -> 'foo
