lisp.html
<div id="outline-container-org0bceadd" class="outline-2">
<h2 id="org0bceadd"><span class="section-number-2">16.</span> variables</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org312365a" class="outline-3">
<h3 id="org312365a"><span class="section-number-3">16.1.</span> terms</h3>
<div class="outline-text-3" id="text-16-1">
<p>
a <b>symbol</b> with a value or a function definition attached to it. variable is a symbol that has a value, not
 function. use of a symbol as a variable is independent of its use as a function name.
</p>

<p>
<b>scoping rule</b> - default <b>dynamic scoping</b> - current binding as the innermost local binding, or the global
 binding if there is no local binding.
</p>
<ul class="org-ul">
<li><b>lexical scoping</b> - .all Emacs Lisp source files and the <b>scratch</b> buffer use lexical scoping. ( can be
enabled on a per-buffer basis. buffer-local variable ‘lexical-binding’ to a non-nil value. or ;; -<b>-
lexical-binding: t -</b>- in library)</li>
</ul>

<p>
local
</p>
<ul class="org-ul">
<li>function arguments</li>
<li><b>local bindings</b></li>
</ul>

<p>
<b>Generalized Variables</b> - special places that accept assignment with <b>setf</b>. (setf (car a) b)
</p>
</div>
</div>
<div id="outline-container-org7652e26" class="outline-3">
<h3 id="org7652e26"><span class="section-number-3">16.2.</span> usage</h3>
<div class="outline-text-3" id="text-16-2">
</div>
<div id="outline-container-orgb2d5317" class="outline-4">
<h4 id="orgb2d5317"><span class="section-number-4">16.2.1.</span> global or global binding:</h4>
<div class="outline-text-4" id="text-16-2-1">
<ul class="org-ul">
<li>(setq x '(a b)) - evaluate only second, set global,  replaces the variable</li>
<li>(setq-default [VAR VALUE]&#x2026;) - If a variable is buffer-local, then setq sets its local value in the current
buffer. setq-default sets the global default value.</li>
<li>(setf PLACE VAL PLACE VAL &#x2026;) - macro</li>
<li>(set 'x '(a b)) - both evaluated first ( same effect as setq). Function.</li>
<li><b>defvar</b> symbol [value [doc-string]] - global, announces your intention
<ul class="org-ul">
<li>(defvar bar 23 "The normal weight of a bar.")</li>
<li>for
<ul class="org-ul">
<li>it informs people that is <span class="underline">intended</span> to be used as a variable</li>
<li>it informs the Lisp system of this, optionally supplying an initial value and a documentation string.</li>
<li>it provides information to programming tools such as ‘etags’, allowing them to find where the variable was defined.</li>
</ul></li>
</ul></li>
<li><b>defconst</b> symbol value [doc-string] - variant for constants, constant is not enforced, may be changed!
<ul class="org-ul">
<li>(defconst zsh-shell "/usr/bin/zsh")</li>
</ul></li>
<li><b>setq-default</b> - for buffer, macro: set-default</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">a</span> 3)
(print a)
(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">a</span> 4) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">second ignored</span>
(print a)
</pre>
</div>

<pre class="example">

3

3
</pre>
</div>
</div>
<div id="outline-container-org74b04a8" class="outline-4">
<h4 id="org74b04a8"><span class="section-number-4">16.2.2.</span> reference</h4>
<div class="outline-text-4" id="text-16-2-2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> a 3)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> v 'a)
(set v 2) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">v is evaluated first</span>
(print a)
</pre>
</div>

<pre class="example">

2
</pre>
</div>
</div>

<div id="outline-container-org9df4d9a" class="outline-4">
<h4 id="org9df4d9a"><span class="section-number-4">16.2.3.</span> local:</h4>
<div class="outline-text-4" id="text-16-2-3">
<ul class="org-ul">
<li><b>setq-local</b> - macro: ? + make-local-variable</li>
<li><b>let</b> (bindings…) forms… -  The local bindings set up by let will be in effect only within the body of forms. <a id="org8287aaf"></a>
<ul class="org-ul">
<li>bindigs - set of symbols, the order of <span class="underline">bindings</span> is unspecified.</li>
<li>value-forms - are evaluated in the order they appear and before binding any of the symbols to them.</li>
<li>return: value is the value of the last form in forms.</li>
<li>ex. (let ((x 2)(y 'b)(z 'c)) (print x))</li>
</ul></li>
<li>let* - like let, but it binds each variable right after computing its local value, with order.</li>
<li>(boundp 'sym) - Test if variable is defined</li>
<li><b>symbolp</b> Test if variable sym is a symbol</li>
<li><b>symbol-value</b> - returns the value stored in SYMBOL’s value cell.
<ul class="org-ul">
<li>(symbol-value 'abracadabra)</li>
</ul></li>
<li><b>defvar-local</b> - buffer-local variable, macro: defvar + make-variable-buffer-local</li>
<li><b>buffer-local-value</b> - get buffer-local variable from another buffer</li>
<li>setq-default</li>
<li>(setq-default left-margin-width 10 right-margin-width 8)</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defvar</span> <span style="color: #cae682;">ssss</span> (+ 1 1))
(print ssss)
</pre>
</div>

<pre class="example">

2
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf46335c" class="outline-3">
<h3 id="orgf46335c"><span class="section-number-3">16.3.</span> Dynamic Scoping (Local Variables) and lexical scoping</h3>
<div class="outline-text-3" id="text-16-3">
<ul class="org-ul">
<li>(makunbound 'x)        ; Void the local binding.</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(print (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((x 1) (y 10)) (+ (* 4 x) (* 5 y)) ))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print x) ;; Symbol's value as variable is void: x</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print y)</span>
</pre>
</div>

<p>
Problem of dynamic scoping, that lexical scoping is fixing:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">getx</span> ()
  x)            <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">x is used free in this function.</span>

(<span style="color: #8ac6f2; font-weight: bold;">let</span> ((x 1))    <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">x is lexically bound.</span>
  (getx)) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">error&#8594; Symbol's value as variable is void: x</span>
</pre>
</div>
</div>
</div>
