lisp.md


<a id="org674861e"></a>

# variables


<a id="orge88d36e"></a>

## terms

a **symbol** with a value or a function definition attached to it. variable is a symbol that has a value, not
 function. use of a symbol as a variable is independent of its use as a function name.

**scoping rule** - default **dynamic scoping** - current binding as the innermost local binding, or the global
 binding if there is no local binding.

-   **lexical scoping** - .all Emacs Lisp source files and the **scratch** buffer use lexical scoping. ( can be
    enabled on a per-buffer basis. buffer-local variable ‘lexical-binding’ to a non-nil value. or ;; -**-
    lexical-binding: t -**- in library)

local

-   function arguments
-   **local bindings**

**Generalized Variables** - special places that accept assignment with **setf**. (setf (car a) b)


<a id="org158f4e5"></a>

## usage


<a id="org3293cb7"></a>

### global or global binding:

-   (setq x '(a b)) - evaluate only second, set global,  replaces the variable
-   (setq-default [VAR VALUE]&#x2026;) - If a variable is buffer-local, then setq sets its local value in the current
    buffer. setq-default sets the global default value.
-   (setf PLACE VAL PLACE VAL &#x2026;) - macro
-   (set 'x '(a b)) - both evaluated first ( same effect as setq). Function.
-   **defvar** symbol [value [doc-string]] - global, announces your intention
    -   (defvar bar 23 "The normal weight of a bar.")
    -   for
        -   it informs people that is <span class="underline">intended</span> to be used as a variable
        -   it informs the Lisp system of this, optionally supplying an initial value and a documentation string.
        -   it provides information to programming tools such as ‘etags’, allowing them to find where the variable was defined.
-   **defconst** symbol value [doc-string] - variant for constants, constant is not enforced, may be changed!
    -   (defconst zsh-shell "/usr/bin/zsh")
-   **setq-default** - for buffer, macro: set-default

    (defvar a 3)
    (print a)
    (defvar a 4) ;; second ignored
    (print a)

    
    3
    
    3


<a id="orgec2d99c"></a>

### reference

    (setq a 3)
    (setq v 'a)
    (set v 2) ; v is evaluated first
    (print a)

    
    2


<a id="org8e0c866"></a>

### local:

-   **setq-local** - macro: ? + make-local-variable
-   **let** (bindings…) forms… -  The local bindings set up by let will be in effect only within the body of forms. <a id="org6cdbe9b"></a>
    -   bindigs - set of symbols, the order of <span class="underline">bindings</span> is unspecified.
    -   value-forms - are evaluated in the order they appear and before binding any of the symbols to them.
    -   return: value is the value of the last form in forms.
    -   ex. (let ((x 2)(y 'b)(z 'c)) (print x))
-   let\* - like let, but it binds each variable right after computing its local value, with order.
-   (boundp 'sym) - Test if variable is defined
-   **symbolp** Test if variable sym is a symbol
-   **symbol-value** - returns the value stored in SYMBOL’s value cell.
    -   (symbol-value 'abracadabra)
-   **defvar-local** - buffer-local variable, macro: defvar + make-variable-buffer-local
-   **buffer-local-value** - get buffer-local variable from another buffer
-   setq-default
-   (setq-default left-margin-width 10 right-margin-width 8)

    (defvar ssss (+ 1 1))
    (print ssss)

    
    2


<a id="orgb9e586a"></a>

## Dynamic Scoping (Local Variables) and lexical scoping

-   (makunbound 'x)        ; Void the local binding.

    (print (let ((x 1) (y 10)) (+ (* 4 x) (* 5 y)) ))
    ;; (print x) ;; Symbol's value as variable is void: x
    ;; (print y)

Problem of dynamic scoping, that lexical scoping is fixing:

    (defun getx ()
      x)            ; x is used free in this function.
    
    (let ((x 1))    ; x is lexically bound.
      (getx)) ;; error→ Symbol's value as variable is void: x
