sources_org/lisp.org
** Generalized Variables
setf [place form] ...

- aref :: Return the element of ARRAY at index IDX. ARRAY: vector, a string, a char-table, a bool-vector, a record,
or a byte-code object.
- car ::  first element of list
- caar :: (car (car
- cadr :: (car (cdr
- cdr :: second and left of list
- cdar :: (cdr (car
- cddr :: (cdr (cdr
- elt :: Return element of SEQUENCE at index N.
- get :: Return the value of SYMBOL’s PROPNAME property.
- gethash :: Look up KEY in TABLE and return its associated value.
- nth :: Return the Nth element of LIST.
- nthcdr :: Take cdr N times on LIST, return the result.
- symbol-function :: Return SYMBOL’s function definition, or nil if that is void.
- symbol-plist :: .
- symbol-value :: .
** ex
z is bound to the old value of y, which is 2, not the new value of y, which is 1.
#+begin_src elisp
(setq y 2)
(let ((y 1) ;; define y
      (z y)) ;; define z
  (list y z)) ;; evaluate
(list y z) ;; error z is not defined
#+end_src

#+RESULTS:
| 1 | 2 |

#+begin_src elisp
(let (aaa) (setq aaa 2) (list aaa))
#+end_src

#+RESULTS:
| 2 |

* Control structures: sequencing, conditions, Iteration
https://www.gnu.org/software/emacs/manual/html_node/elisp/Control-Structures.html
** conditions
- cond (cond   (test1    action1)   (test2    action2) (condition body-forms…) ... )
  - (condition body-forms…)
- when (when (test-clause) (action1) (action2) ... ) - alternative to if without else and requirement for (progn
- if (if (test-clause) (then-action1) (else-action2))
- case (case  (keyform) ((key1)   (action1   action2 ...) ((key2)   (action1   action2 ...) ) ... )
- (not),
- (and), If no arg yields nil, return the last arg’s value.
- (or), (xor)
- (unless cond - (when nil

