lisp.html

<div id="outline-container-org9f81099" class="outline-3">
<h3 id="org9f81099"><span class="section-number-3">16.4.</span> Generalized Variables</h3>
<div class="outline-text-3" id="text-16-4">
<p>
setf [place form] &#x2026;
</p>

<dl class="org-dl">
<dt>aref</dt><dd>Return the element of ARRAY at index IDX. ARRAY: vector, a string, a char-table, a bool-vector, a record,</dd>
</dl>
<p>
or a byte-code object.
</p>
<dl class="org-dl">
<dt>car</dt><dd>first element of list</dd>
<dt>caar</dt><dd>(car (car</dd>
<dt>cadr</dt><dd>(car (cdr</dd>
<dt>cdr</dt><dd>second and left of list</dd>
<dt>cdar</dt><dd>(cdr (car</dd>
<dt>cddr</dt><dd>(cdr (cdr</dd>
<dt>elt</dt><dd>Return element of SEQUENCE at index N.</dd>
<dt>get</dt><dd>Return the value of SYMBOL’s PROPNAME property.</dd>
<dt>gethash</dt><dd>Look up KEY in TABLE and return its associated value.</dd>
<dt>nth</dt><dd>Return the Nth element of LIST.</dd>
<dt>nthcdr</dt><dd>Take cdr N times on LIST, return the result.</dd>
<dt>symbol-function</dt><dd>Return SYMBOL’s function definition, or nil if that is void.</dd>
<dt>symbol-plist</dt><dd>.</dd>
<dt>symbol-value</dt><dd>.</dd>
</dl>
</div>
</div>
<div id="outline-container-org6a344d4" class="outline-3">
<h3 id="org6a344d4"><span class="section-number-3">16.5.</span> ex</h3>
<div class="outline-text-3" id="text-16-5">
<p>
z is bound to the old value of y, which is 2, not the new value of y, which is 1.
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> y 2)
(<span style="color: #8ac6f2; font-weight: bold;">let</span> ((y 1) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">define y</span>
      (z y)) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">define z</span>
  (list y z)) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">evaluate</span>
(list y z) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">error z is not defined</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">let</span> (aaa) (<span style="color: #8ac6f2; font-weight: bold;">setq</span> aaa 2) (list aaa))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org460c5ef" class="outline-2">
<h2 id="org460c5ef"><span class="section-number-2">17.</span> Control structures: sequencing, conditions, Iteration</h2>
<div class="outline-text-2" id="text-17">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Control-Structures.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Control-Structures.html</a>
</p>
</div>
<div id="outline-container-orgfb76f1f" class="outline-3">
<h3 id="orgfb76f1f"><span class="section-number-3">17.1.</span> conditions</h3>
<div class="outline-text-3" id="text-17-1">
<ul class="org-ul">
<li>cond (cond   (test1    action1)   (test2    action2) (condition body-forms…) &#x2026; )
<ul class="org-ul">
<li>(condition body-forms…)</li>
</ul></li>
<li>when (when (test-clause) (action1) (action2) &#x2026; ) - alternative to if without else and requirement for (progn</li>
<li>if (if (test-clause) (then-action1) (else-action2))</li>
<li>case (case  (keyform) ((key1)   (action1   action2 &#x2026;) ((key2)   (action1   action2 &#x2026;) ) &#x2026; )</li>
<li>(not),</li>
<li>(and), If no arg yields nil, return the last arg’s value.</li>
<li>(or), (xor)</li>
<li>(unless cond - (when nil</li>
</ul>
</div>
