lisp.md


<a id="org1f553a6"></a>

## Generalized Variables

setf [place form] &#x2026;

-   **aref:** Return the element of ARRAY at index IDX. ARRAY: vector, a string, a char-table, a bool-vector, a record,

or a byte-code object.

-   **car:** first element of list
-   **caar:** (car (car
-   **cadr:** (car (cdr
-   **cdr:** second and left of list
-   **cdar:** (cdr (car
-   **cddr:** (cdr (cdr
-   **elt:** Return element of SEQUENCE at index N.
-   **get:** Return the value of SYMBOL’s PROPNAME property.
-   **gethash:** Look up KEY in TABLE and return its associated value.
-   **nth:** Return the Nth element of LIST.
-   **nthcdr:** Take cdr N times on LIST, return the result.
-   **symbol-function:** Return SYMBOL’s function definition, or nil if that is void.
-   **symbol-plist:** .
-   **symbol-value:** .


<a id="org2d42d0a"></a>

## ex

z is bound to the old value of y, which is 2, not the new value of y, which is 1.

    (setq y 2)
    (let ((y 1) ;; define y
          (z y)) ;; define z
      (list y z)) ;; evaluate
    (list y z) ;; error z is not defined

    (let (aaa) (setq aaa 2) (list aaa))


<a id="org1674c4d"></a>

# Control structures: sequencing, conditions, Iteration

<https://www.gnu.org/software/emacs/manual/html_node/elisp/Control-Structures.html>


<a id="org62a280e"></a>

## conditions

-   cond (cond   (test1    action1)   (test2    action2) (condition body-forms…) &#x2026; )
    -   (condition body-forms…)
-   when (when (test-clause) (action1) (action2) &#x2026; ) - alternative to if without else and requirement for (progn
-   if (if (test-clause) (then-action1) (else-action2))
-   case (case  (keyform) ((key1)   (action1   action2 &#x2026;) ((key2)   (action1   action2 &#x2026;) ) &#x2026; )
-   (not),
-   (and), If no arg yields nil, return the last arg’s value.
-   (or), (xor)
-   (unless cond - (when nil
