sources_org/lisp.org
*** test-clause
- (null nil/t)
- Comparison Operations
  - = 	Checks if the values of the operands are all equal or not, if yes then condition becomes true. 	(= A B) is not true.
  - /= 	Checks if the values of the operands are all different or not, if values are not equal then condition becomes true. 	(/= A B) is true.
  - > 	Checks if the values of the operands are monotonically decreasing. 	(> A B) is not true.
  - < 	Checks if the values of the operands are monotonically increasing. 	(< A B) is true.
  - >= 	Checks if the value of any left operand is greater than or equal to the value of next right operand, if yes then condition becomes true. 	(>= A B) is not true.
  - <= 	Checks if the value of any left operand is less than or equal to the value of its right operand, if yes then condition becomes true. 	(<= A B) is true.
  - max 	It compares two or more arguments and returns the maximum value. 	(max A B) returns 20
  - min 	It compares two or more arguments and returns the minimum value. 	(min A B) returns 10
- Logical Operations
  - and
  - or
  - not
- any: (not (cl-every 'null))
- all:
- (cl-every 'booleanp) ; nil or t

| a     | b     | eq  | eql | \=    | string= | equal | equalp |
|-------+-------+-----+-----+-------+---------+-------+--------|
| 5     | 5     | t   | t   | t     | error   | t     | t      |
| 5     | 5.0   | nil | t   | t     | error   | nil   | t      |
| “a”   | “a”   | nil | nil | error | t       | t     | t      |
| “a”   | ‘a    | nil | nil | error | t       | nil   | nil    |
| a     | a     | t   | t   | error | error   | t     | t      |
| “a”   | “A”   | nil | nil | error | nil     | nil   | t      |
| (1 2) | (1 2) | nil | nil | error | error   | t     | t      |
*** if else
#+begin_src elisp :results output
(if (> 3 5)
  ;; if case
    (print "< 3 5")
  ;; else case
    (print ">= 3 5")
    (print "else again")
    )

; else if:
(if  (> 3 5) ; test-expression1
    (print "> 3 5") ; then-expression1
    (if (= 3 5) ; test-expression2
        (print "== 3 5") ; then-expression2
        (print "/= 3 5") ; else-expression2
      )
    )

;; ; else if 2:
(cond ( (= 1 0) ; test-expression1 ; if true - Any remaining clauses are ignored.
       (print "=x 1 0") ; then-expression1
       )
      ((>  3 3) ; test-expression2
       ; then-expression2
       (print "> 3 3")
       )
      (t (print "default") ; else-expression2 or default expression
       )
      )
#+end_src

#+RESULTS:
:
: ">= 3 5"
:
: "else again"
:
: "/= 3 5"
:
: "default"

*** comparison
#+begin_src elisp :results output :exports both :eval no
;; Compare Numbers
(setq a 2)
(print (= 2 (+ a 1)))
(print (= 2 (+ 1 1)))

;; Compare Symbols and Numbers
(print (eq a 2))

;; Compare Elements of a List
(print (equal (list 1 2 3 4) (list 1 2 3 4)))

(print "Compare Strings")
(print (string= "hello" "hello"))

#+end_src

#+RESULTS:
#+begin_example

nil

t

t

t

"Compare Strings"

t
#+end_example

