lisp.html

<div id="outline-container-org2b9221b" class="outline-4">
<h4 id="org2b9221b"><span class="section-number-4">17.1.1.</span> test-clause</h4>
<div class="outline-text-4" id="text-17-1-1">
<ul class="org-ul">
<li>(null nil/t)</li>
<li>Comparison Operations
<ul class="org-ul">
<li>= 	Checks if the values of the operands are all equal or not, if yes then condition becomes true. 	(= A B) is not true.</li>
<li>/= 	Checks if the values of the operands are all different or not, if values are not equal then condition becomes true. 	(/= A B) is true.</li>
<li>&gt; 	Checks if the values of the operands are monotonically decreasing. 	(&gt; A B) is not true.</li>
<li>&lt; 	Checks if the values of the operands are monotonically increasing. 	(&lt; A B) is true.</li>
<li>&gt;= 	Checks if the value of any left operand is greater than or equal to the value of next right operand, if yes then condition becomes true. 	(&gt;= A B) is not true.</li>
<li>&lt;= 	Checks if the value of any left operand is less than or equal to the value of its right operand, if yes then condition becomes true. 	(&lt;= A B) is true.</li>
<li>max 	It compares two or more arguments and returns the maximum value. 	(max A B) returns 20</li>
<li>min 	It compares two or more arguments and returns the minimum value. 	(min A B) returns 10</li>
</ul></li>
<li>Logical Operations
<ul class="org-ul">
<li>and</li>
<li>or</li>
<li>not</li>
</ul></li>
<li>any: (not (cl-every 'null))</li>
<li>all:</li>
<li>(cl-every 'booleanp) ; nil or t</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">a</th>
<th scope="col" class="org-left">b</th>
<th scope="col" class="org-left">eq</th>
<th scope="col" class="org-left">eql</th>
<th scope="col" class="org-left">\=</th>
<th scope="col" class="org-left">string=</th>
<th scope="col" class="org-left">equal</th>
<th scope="col" class="org-left">equalp</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">5</td>
<td class="org-left">5</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-left">5</td>
<td class="org-left">5.0</td>
<td class="org-left">nil</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">error</td>
<td class="org-left">nil</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-left">“a”</td>
<td class="org-left">“a”</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-left">“a”</td>
<td class="org-left">‘a</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">a</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-left">“a”</td>
<td class="org-left">“A”</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">error</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-left">(1 2)</td>
<td class="org-left">(1 2)</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5b9165b" class="outline-4">
<h4 id="org5b9165b"><span class="section-number-4">17.1.2.</span> if else</h4>
<div class="outline-text-4" id="text-17-1-2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">if</span> (&gt; 3 5)
  <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">if case</span>
    (print <span style="color: #95e454;">"&lt; 3 5"</span>)
  <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">else case</span>
    (print <span style="color: #95e454;">"&gt;= 3 5"</span>)
    (print <span style="color: #95e454;">"else again"</span>)
    )

<span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">else if:</span>
(<span style="color: #8ac6f2; font-weight: bold;">if</span>  (&gt; 3 5) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">test-expression1</span>
    (print <span style="color: #95e454;">"&gt; 3 5"</span>) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">then-expression1</span>
    (<span style="color: #8ac6f2; font-weight: bold;">if</span> (= 3 5) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">test-expression2</span>
        (print <span style="color: #95e454;">"== 3 5"</span>) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">then-expression2</span>
        (print <span style="color: #95e454;">"/= 3 5"</span>) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">else-expression2</span>
      )
    )

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">; else if 2:</span>
(<span style="color: #8ac6f2; font-weight: bold;">cond</span> ( (= 1 0) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">test-expression1 ; if true - Any remaining clauses are ignored.</span>
       (print <span style="color: #95e454;">"=x 1 0"</span>) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">then-expression1</span>
       )
      ((&gt;  3 3) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">test-expression2</span>
       <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">then-expression2</span>
       (print <span style="color: #95e454;">"&gt; 3 3"</span>)
       )
      (t (print <span style="color: #95e454;">"default"</span>) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">else-expression2 or default expression</span>
       )
      )
</pre>
</div>
</div>
</div>

<div id="outline-container-org1df4cc8" class="outline-4">
<h4 id="org1df4cc8"><span class="section-number-4">17.1.3.</span> comparison</h4>
<div class="outline-text-4" id="text-17-1-3">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Compare Numbers</span>
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> a 2)
(print (= 2 (+ a 1)))
(print (= 2 (+ 1 1)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Compare Symbols and Numbers</span>
(print (eq a 2))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Compare Elements of a List</span>
(print (equal (list 1 2 3 4) (list 1 2 3 4)))

(print <span style="color: #95e454;">"Compare Strings"</span>)
(print (string= <span style="color: #95e454;">"hello"</span> <span style="color: #95e454;">"hello"</span>))

</pre>
</div>

<pre class="example" id="orgeefbfce">

nil

t

t

t

"Compare Strings"

t
</pre>
</div>
</div>
