lisp.md


<a id="orge9f9923"></a>

### test-clause

-   (null nil/t)
-   Comparison Operations
    -   = 	Checks if the values of the operands are all equal or not, if yes then condition becomes true. 	(= A B) is not true.
    -   /= 	Checks if the values of the operands are all different or not, if values are not equal then condition becomes true. 	(/= A B) is true.
    -   > 	Checks if the values of the operands are monotonically decreasing. 	(> A B) is not true.
    -   < 	Checks if the values of the operands are monotonically increasing. 	(< A B) is true.
    -   >= 	Checks if the value of any left operand is greater than or equal to the value of next right operand, if yes then condition becomes true. 	(>= A B) is not true.
    -   <= 	Checks if the value of any left operand is less than or equal to the value of its right operand, if yes then condition becomes true. 	(<= A B) is true.
    -   max 	It compares two or more arguments and returns the maximum value. 	(max A B) returns 20
    -   min 	It compares two or more arguments and returns the minimum value. 	(min A B) returns 10
-   Logical Operations
    -   and
    -   or
    -   not
-   any: (not (cl-every 'null))
-   all:
-   (cl-every 'booleanp) ; nil or t

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">a</th>
<th scope="col" class="org-left">b</th>
<th scope="col" class="org-left">eq</th>
<th scope="col" class="org-left">eql</th>
<th scope="col" class="org-left">\=</th>
<th scope="col" class="org-left">string=</th>
<th scope="col" class="org-left">equal</th>
<th scope="col" class="org-left">equalp</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">5</td>
<td class="org-left">5</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>


<tr>
<td class="org-left">5</td>
<td class="org-left">5.0</td>
<td class="org-left">nil</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">error</td>
<td class="org-left">nil</td>
<td class="org-left">t</td>
</tr>


<tr>
<td class="org-left">“a”</td>
<td class="org-left">“a”</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>


<tr>
<td class="org-left">“a”</td>
<td class="org-left">‘a</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
</tr>


<tr>
<td class="org-left">a</td>
<td class="org-left">a</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>


<tr>
<td class="org-left">“a”</td>
<td class="org-left">“A”</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">error</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">t</td>
</tr>


<tr>
<td class="org-left">(1 2)</td>
<td class="org-left">(1 2)</td>
<td class="org-left">nil</td>
<td class="org-left">nil</td>
<td class="org-left">error</td>
<td class="org-left">error</td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>
</tbody>
</table>


<a id="org55a70d7"></a>

### if else

    (if (> 3 5)
      ;; if case
        (print "< 3 5")
      ;; else case
        (print ">= 3 5")
        (print "else again")
        )
    
    ; else if:
    (if  (> 3 5) ; test-expression1
        (print "> 3 5") ; then-expression1
        (if (= 3 5) ; test-expression2
            (print "== 3 5") ; then-expression2
            (print "/= 3 5") ; else-expression2
          )
        )
    
    ;; ; else if 2:
    (cond ( (= 1 0) ; test-expression1 ; if true - Any remaining clauses are ignored.
           (print "=x 1 0") ; then-expression1
           )
          ((>  3 3) ; test-expression2
           ; then-expression2
           (print "> 3 3")
           )
          (t (print "default") ; else-expression2 or default expression
           )
          )


<a id="org3e0d056"></a>

### comparison

    ;; Compare Numbers
    (setq a 2)
    (print (= 2 (+ a 1)))
    (print (= 2 (+ 1 1)))
    
    ;; Compare Symbols and Numbers
    (print (eq a 2))
    
    ;; Compare Elements of a List
    (print (equal (list 1 2 3 4) (list 1 2 3 4)))
    
    (print "Compare Strings")
    (print (string= "hello" "hello"))

    
    nil
    
    t
    
    t
    
    t
    
    "Compare Strings"
    
    t
