sources_org/lisp.org
*** nil and empty
nil is equivalent to the boolean value false, there is no need to compare to it explicitly.

empty list is equivalent to nil

invert true to false: (null) or (not)
- (null '()) =>  T
- (null nil) =>  T
- (null t) =>  NIL
- (null 1) =>  NIL

#+begin_src elisp
(if nil
    (print 'true)
  'very-false)

#+end_src

#+RESULTS:
: very-false

*** cond
#+begin_src elisp :results output :exports both :eval no
(cond
     (win (select-window win))
     (alive-p (switch-to-buffer last-buffer))
     (t (dired (cdr item))))
#+end_src
** case
*** cond
#+begin_src elisp :results output :exports both :eval no
(setq x "s")
(cond ((numberp x) (print x))
      ((stringp x) (print "wtf"))
)
#+end_src

#+RESULTS:
:
: "wtf"

*** cl-case <<cl-case>>
#+begin_src elisp :results output
(defun test-cl-case (operation x y)
  (cl-case operation
    (:mul (* x y))
    (:add (+ x y))
    (:sub (- x y))
    (:div (/ x y))
    (otherwise nil)))

(print (test-cl-case :mul 2 10))
(print (test-cl-case :sub 10 2))
(print (test-cl-case :add 10 2))
(print (test-cl-case :div 10 2))
#+end_src

#+RESULTS:
:
: 20
:
: 8
:
: 12
:
: 5

*** pcase
#+begin_src elisp :results value :exports both :eval no

(pcase "string here"
  ;; string
  ((and (pred stringp) msg)
   (message "%s" msg))

  ;; symbol
  ('success       (message "Done!"))
  ('would-block   (message "Sorry, can't do it now"))
  ('read-only     (message "The shmliblick is read-only"))
  ('access-denied (message "You do not have the needed rights"))

  ;; default
  (code           (message "Unknown return code %S" code)))

#+end_src

#+RESULTS:
: string here

** loops
*** while
#+begin_src elisp :results output
(setq num 0)
(while (< num 4)
  (print (format "Iteration %d." num))
  (setq num (1+ num))
  )
#+end_src

#+RESULTS:
:
: "Iteration 0."
:
: "Iteration 1."
:
: "Iteration 2."
:
: "Iteration 3."

*** cl-loop
- require 'cl-lib
#+begin_src elisp :results output :exports both :eval no
(cl-loop for n from 2 below 9 by 1
      do (print n))
#+end_src

#+RESULTS:
#+begin_example

2

3

4

5

6

7

8
#+end_example

Cycle with enumeration:
#+begin_src elisp :results none :exports code :eval no
(cl-loop for pair in clist
           for i from 1
           when (string-equal (cdr pair) value)
           do (cl-return (nth i clist))
           finally return nil))
#+end_src
*** dolist
#+begin_src elisp :results output :exports both :eval no
(dolist (h (number-sequence 4 6))
        (print h)
)

#+end_src

#+RESULTS:
:
: 4
:
: 5
:
: 6

#+begin_src elisp :results output
(dolist (h '(a b c))
  (print h))
#+end_src

#+RESULTS:
:
: a
:
: b
:
: c

#+begin_src elisp :results output
;; (dolist (h string("abc"))
;;   (print h))
(print (string-to-char "asd"))
#+end_src

#+RESULTS:
:
: 97

*** dotimes
#+begin_src elisp :results output
(dotimes (i 3) (print i))
#+end_src

#+RESULTS:
:
: 0
:
: 1
:
: 2

#+begin_src elisp :results output
(do (variable-definition*)
    (end-test-form result-form*)
  statement*)

#+end_src

#+RESULTS:
:
: 110

*** usecase add-hook group of hooks
#+begin_src elisp :results output :exports both :eval no

#+end_src
*** links
https://www.gnu.org/software/emacs/manual/html_node/eintr/Loops-_0026-Recursion.html

* Functions
** progn
- (progn BODY...) - Eval BODY forms sequentially and return value of last one.
- prog1 for instance evaluates all expressions and returns the value of the first
- prog2 evaluates all expressions and returns the value of the second
