lisp.html

<div id="outline-container-org928ea22" class="outline-4">
<h4 id="org928ea22"><span class="section-number-4">17.1.4.</span> nil and empty</h4>
<div class="outline-text-4" id="text-17-1-4">
<p>
nil is equivalent to the boolean value false, there is no need to compare to it explicitly.
</p>

<p>
empty list is equivalent to nil
</p>

<p>
invert true to false: (null) or (not)
</p>
<ul class="org-ul">
<li>(null '()) =&gt;  T</li>
<li>(null nil) =&gt;  T</li>
<li>(null t) =&gt;  NIL</li>
<li>(null 1) =&gt;  NIL</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">if</span> nil
    (print 'true)
  'very-false)

</pre>
</div>
</div>
</div>

<div id="outline-container-org194164f" class="outline-4">
<h4 id="org194164f"><span class="section-number-4">17.1.5.</span> cond</h4>
<div class="outline-text-4" id="text-17-1-5">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">cond</span>
     (win (select-window win))
     (alive-p (switch-to-buffer last-buffer))
     (t (dired (cdr item))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org32f09c8" class="outline-3">
<h3 id="org32f09c8"><span class="section-number-3">17.2.</span> case</h3>
<div class="outline-text-3" id="text-17-2">
</div>
<div id="outline-container-orgb7a6982" class="outline-4">
<h4 id="orgb7a6982"><span class="section-number-4">17.2.1.</span> cond</h4>
<div class="outline-text-4" id="text-17-2-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> x <span style="color: #95e454;">"s"</span>)
(<span style="color: #8ac6f2; font-weight: bold;">cond</span> ((numberp x) (print x))
      ((stringp x) (print <span style="color: #95e454;">"wtf"</span>))
)
</pre>
</div>

<pre class="example">

"wtf"
</pre>
</div>
</div>

<div id="outline-container-org5de7406" class="outline-4">
<h4 id="org5de7406"><span class="section-number-4">17.2.2.</span> cl-case <a id="orgfcde96c"></a></h4>
<div class="outline-text-4" id="text-17-2-2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">test-cl-case</span> (operation x y)
  (<span style="color: #8ac6f2; font-weight: bold;">cl-case</span> operation
    (<span style="color: #e5786d;">:mul</span> (* x y))
    (<span style="color: #e5786d;">:add</span> (+ x y))
    (<span style="color: #e5786d;">:sub</span> (- x y))
    (<span style="color: #e5786d;">:div</span> (/ x y))
    (otherwise nil)))

(print (test-cl-case <span style="color: #e5786d;">:mul</span> 2 10))
(print (test-cl-case <span style="color: #e5786d;">:sub</span> 10 2))
(print (test-cl-case <span style="color: #e5786d;">:add</span> 10 2))
(print (test-cl-case <span style="color: #e5786d;">:div</span> 10 2))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5949a4d" class="outline-4">
<h4 id="org5949a4d"><span class="section-number-4">17.2.3.</span> pcase</h4>
<div class="outline-text-4" id="text-17-2-3">
<div class="org-src-container">
<pre class="src src-elisp">
(<span style="color: #8ac6f2; font-weight: bold;">pcase</span> <span style="color: #95e454;">"string here"</span>
  <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">string</span>
  ((<span style="color: #8ac6f2; font-weight: bold;">and</span> (pred stringp) msg)
   (message <span style="color: #95e454;">"%s"</span> msg))

  <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">symbol</span>
  ('success       (message <span style="color: #95e454;">"Done!"</span>))
  ('would-block   (message <span style="color: #95e454;">"Sorry, can't do it now"</span>))
  ('read-only     (message <span style="color: #95e454;">"The shmliblick is read-only"</span>))
  ('access-denied (message <span style="color: #95e454;">"You do not have the needed rights"</span>))

  <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">default</span>
  (code           (message <span style="color: #95e454;">"Unknown return code %S"</span> code)))

</pre>
</div>

<pre class="example">
string here
</pre>
</div>
</div>
</div>

<div id="outline-container-org79f49d2" class="outline-3">
<h3 id="org79f49d2"><span class="section-number-3">17.3.</span> loops</h3>
<div class="outline-text-3" id="text-17-3">
</div>
<div id="outline-container-org185b251" class="outline-4">
<h4 id="org185b251"><span class="section-number-4">17.3.1.</span> while</h4>
<div class="outline-text-4" id="text-17-3-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> num 0)
(<span style="color: #8ac6f2; font-weight: bold;">while</span> (&lt; num 4)
  (print (format <span style="color: #95e454;">"Iteration %d."</span> num))
  (<span style="color: #8ac6f2; font-weight: bold;">setq</span> num (1+ num))
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc352072" class="outline-4">
<h4 id="orgc352072"><span class="section-number-4">17.3.2.</span> cl-loop</h4>
<div class="outline-text-4" id="text-17-3-2">
<ul class="org-ul">
<li>require 'cl-lib</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">cl-loop</span> for n from 2 below 9 by 1
      do (print n))
</pre>
</div>

<pre class="example" id="org1343922">

2

3

4

5

6

7

8
</pre>

<p>
Cycle with enumeration:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">cl-loop</span> for pair in clist
           for i from 1
           when (string-equal (cdr pair) value)
           do (<span style="color: #8ac6f2; font-weight: bold;">cl-return</span> (nth i clist))
           finally return nil))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7845be8" class="outline-4">
<h4 id="org7845be8"><span class="section-number-4">17.3.3.</span> dolist</h4>
<div class="outline-text-4" id="text-17-3-3">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">dolist</span> (h (number-sequence 4 6))
        (print h)
)

</pre>
</div>

<pre class="example">

4

5

6
</pre>


<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">dolist</span> (h '(a b c))
  (print h))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(dolist (h string("abc"))</span>
<span style="color: #fa8072;">;;   </span><span style="color: #99968b; font-style: italic;">(print h))</span>
(print (string-to-char <span style="color: #95e454;">"asd"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org48e4f2b" class="outline-4">
<h4 id="org48e4f2b"><span class="section-number-4">17.3.4.</span> dotimes</h4>
<div class="outline-text-4" id="text-17-3-4">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">dotimes</span> (i 3) (print i))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(do (variable-definition*)
    (end-test-form result-form*)
  statement*)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf2a056" class="outline-4">
<h4 id="orgaf2a056"><span class="section-number-4">17.3.5.</span> usecase add-hook group of hooks</h4>
<div class="outline-text-4" id="text-17-3-5">
<div class="org-src-container">
<pre class="src src-elisp">
</pre>
</div>
</div>
</div>
<div id="outline-container-orge04f2ab" class="outline-4">
<h4 id="orge04f2ab"><span class="section-number-4">17.3.6.</span> links</h4>
<div class="outline-text-4" id="text-17-3-6">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/Loops-_0026-Recursion.html">https://www.gnu.org/software/emacs/manual/html_node/eintr/Loops-_0026-Recursion.html</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf73fa83" class="outline-2">
<h2 id="orgf73fa83"><span class="section-number-2">18.</span> Functions</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-orgcdb8ed5" class="outline-3">
<h3 id="orgcdb8ed5"><span class="section-number-3">18.1.</span> progn</h3>
<div class="outline-text-3" id="text-18-1">
<ul class="org-ul">
<li>(progn BODY&#x2026;) - Eval BODY forms sequentially and return value of last one.</li>
<li>prog1 for instance evaluates all expressions and returns the value of the first</li>
<li>prog2 evaluates all expressions and returns the value of the second</li>
</ul>
</div>
</div>
