lisp.md


<a id="org7a5f8dd"></a>

### nil and empty

nil is equivalent to the boolean value false, there is no need to compare to it explicitly.

empty list is equivalent to nil

invert true to false: (null) or (not)

-   (null '()) =>  T
-   (null nil) =>  T
-   (null t) =>  NIL
-   (null 1) =>  NIL

    (if nil
        (print 'true)
      'very-false)


<a id="orgcec253c"></a>

### cond

    (cond
         (win (select-window win))
         (alive-p (switch-to-buffer last-buffer))
         (t (dired (cdr item))))


<a id="org1b5b4d2"></a>

## case


<a id="orgfdc532b"></a>

### cond

    (setq x "s")
    (cond ((numberp x) (print x))
          ((stringp x) (print "wtf"))
    )

    
    "wtf"


<a id="org0924f00"></a>

### cl-case <a id="orgcf520dc"></a>

    (defun test-cl-case (operation x y)
      (cl-case operation
        (:mul (* x y))
        (:add (+ x y))
        (:sub (- x y))
        (:div (/ x y))
        (otherwise nil)))
    
    (print (test-cl-case :mul 2 10))
    (print (test-cl-case :sub 10 2))
    (print (test-cl-case :add 10 2))
    (print (test-cl-case :div 10 2))


<a id="org5fe7bda"></a>

### pcase

    
    (pcase "string here"
      ;; string
      ((and (pred stringp) msg)
       (message "%s" msg))
    
      ;; symbol
      ('success       (message "Done!"))
      ('would-block   (message "Sorry, can't do it now"))
      ('read-only     (message "The shmliblick is read-only"))
      ('access-denied (message "You do not have the needed rights"))
    
      ;; default
      (code           (message "Unknown return code %S" code)))

    string here


<a id="org209ccf5"></a>

## loops


<a id="org2ccb442"></a>

### while

    (setq num 0)
    (while (< num 4)
      (print (format "Iteration %d." num))
      (setq num (1+ num))
      )


<a id="org229b92c"></a>

### cl-loop

-   require 'cl-lib

    (cl-loop for n from 2 below 9 by 1
          do (print n))

    
    2
    
    3
    
    4
    
    5
    
    6
    
    7
    
    8

Cycle with enumeration:

    (cl-loop for pair in clist
               for i from 1
               when (string-equal (cdr pair) value)
               do (cl-return (nth i clist))
               finally return nil))


<a id="org70b0414"></a>

### dolist

    (dolist (h (number-sequence 4 6))
            (print h)
    )

    
    4
    
    5
    
    6

    (dolist (h '(a b c))
      (print h))

    ;; (dolist (h string("abc"))
    ;;   (print h))
    (print (string-to-char "asd"))


<a id="org98056a4"></a>

### dotimes

    (dotimes (i 3) (print i))

    (do (variable-definition*)
        (end-test-form result-form*)
      statement*)


<a id="org04e7fc6"></a>

### usecase add-hook group of hooks


<a id="org1a71d72"></a>

### links

<https://www.gnu.org/software/emacs/manual/html_node/eintr/Loops-_0026-Recursion.html>


<a id="org07a9793"></a>

# Functions


<a id="org8f0e4d9"></a>

## progn

-   (progn BODY&#x2026;) - Eval BODY forms sequentially and return value of last one.
-   prog1 for instance evaluates all expressions and returns the value of the first
-   prog2 evaluates all expressions and returns the value of the second
