sources_org/lisp.org
** defun
- defines the symbol name as a function with argument list args
- Neither name nor args should be quoted.
- The return value of defun is undefined.
- Careful! defun redefines even primitive functions such as car without any hesitation or notification.
- fmakunbound - undefine

(defun function-name (a &optional b &rest c)
  "optional-documentation..."
  (interactive argument-passing-info)
  (indent indent-spec) ; declare Form
  body...)
** arguments
arguments can have clauses or markers: (required-vars…  [&optional [optional-vars…]]  [&rest rest-var])
  - &optional
  - &rest - list of arguemnts

#+begin_src elisp :results output :exports both :eval no
(defun a (&optional v)
       (print v)
)
(a)
#+end_src

#+RESULTS:
:
: nil

https://www.gnu.org/software/emacs/manual/html_node/elisp/Argument-List.html
** (&rest args) unrolling
: (seq-let (managed-major-mode project class contact language-id) (car args) ... )
** Function Calling
- funcall (function &rest arguments)
- apply (function &rest arguments) - last arg as list of args
- https://www.gnu.org/software/emacs/manual/html_node/elisp/Argument-List.html
- funcall-interactively
#+begin_src elisp :results output :exports both :eval no
(print (funcall 'list '(1 2 3)))
(print (apply 'list '(1 2 3)))
#+end_src

#+RESULTS:
:
: ((1 2 3))
:
: (1 2 3)

#+begin_src elisp :results output :exports both :eval no
(defun a (&optional v foo  c d &rest e)
       (interactive)
       (print (list v foo c d e)))
(a 1 2 3 4 5)
(defun b (&rest e)
       "function proxy"
       (interactive)
       (if (interactive-p)
           ;; (funcall-interactively 'a e)
           ;; (call-interactively 'a)
           (apply 'funcall-interactively 'a e)
         ;;else
         (apply 'a e))
  ;; (print e)
)
(print (vector (list 1 2 3 4) (list 1 2 3 4)))
(call-interactively 'a)
(call-interactively 'b)
(b 1 2 3 4 5)
(print "----")
(funcall-interactively 'a 1 2 3 4 5)
(funcall-interactively 'b 1 2 3 4 5)
#+end_src

#+RESULTS:
#+begin_example

(1 2 3 4 (5))

[(1 2 3 4) (1 2 3 4)]

(nil nil nil nil nil)

(nil nil nil nil nil)

(1 2 3 4 (5))

"----"

(1 2 3 4 (5))

(1 2 3 4 (5))
#+end_example

#+begin_src elisp
(defun averagenum (n1 n2 n3 n4)
  (/ ( + n1 n2 n3 n4) 4)
  )
(averagenum 2 3 4 10 )
;; 4


(setq f 'list)
;;     ⇒ list

(funcall f 'x 'y 'z)
  ;;   ⇒ (x y z)
#+end_src

#+begin_src elisp

(defun bar (n) (+ n 2))
(symbol-function 'bar)
;;     ⇒ (lambda (n) (+ n 2))

(fset 'baz 'bar)
  ;;   ⇒ bar

(symbol-function 'baz)
    ;; ⇒ bar

#+end_src
** Named parameters:
To be able to supply arguments by name, we need to
- declare them with *&key <name>*
- we set them with *:name <value>*

Default values to key parameters:
- *&key (<name> <value>)*

#+begin_src elisp :results output :exports both :eval no
(defun hello (name &key happy)())
(hello "me" :happy t)

(defun hello (&optional name &key happy)())
(hello "me" :happy t)
#+end_src

#+RESULTS:

** lambda
- A lambda expression, by itself, has no name; it is an anonymous function.
- result is a closure object
- they are more commonly associated with symbols to make named functions
- A lambda form cannot be evaluated and it must appear only where LISP expects to find a function.


Macro: lambda args [doc] [interactive] body…

(lambda (x) (* x x))
     ⇒ (lambda (x) (* x x))
