lisp.html
<div id="outline-container-org6795b2f" class="outline-3">
<h3 id="org6795b2f"><span class="section-number-3">18.2.</span> defun</h3>
<div class="outline-text-3" id="text-18-2">
<ul class="org-ul">
<li>defines the symbol name as a function with argument list args</li>
<li>Neither name nor args should be quoted.</li>
<li>The return value of defun is undefined.</li>
<li>Careful! defun redefines even primitive functions such as car without any hesitation or notification.</li>
<li>fmakunbound - undefine</li>
</ul>

<p>
(defun function-name (a &amp;optional b &amp;rest c)
  "optional-documentation&#x2026;"
  (interactive argument-passing-info)
  (indent indent-spec) ; declare Form
  body&#x2026;)
</p>
</div>
</div>
<div id="outline-container-orgfa09d0e" class="outline-3">
<h3 id="orgfa09d0e"><span class="section-number-3">18.3.</span> arguments</h3>
<div class="outline-text-3" id="text-18-3">
<p>
arguments can have clauses or markers: (required-vars…  [&amp;optional [optional-vars…]]  [&amp;rest rest-var])
</p>
<ul class="org-ul">
<li>&amp;optional</li>
<li>&amp;rest - list of arguemnts</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">a</span> (<span style="color: #92a65e; font-weight: bold;">&amp;optional</span> v)
       (print v)
)
(a)
</pre>
</div>

<pre class="example">

nil
</pre>


<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Argument-List.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Argument-List.html</a>
</p>
</div>
</div>
<div id="outline-container-org5198dd6" class="outline-3">
<h3 id="org5198dd6"><span class="section-number-3">18.4.</span> (&amp;rest args) unrolling</h3>
<div class="outline-text-3" id="text-18-4">
<pre class="example">
(seq-let (managed-major-mode project class contact language-id) (car args) ... )
</pre>
</div>
</div>
<div id="outline-container-orgeba5617" class="outline-3">
<h3 id="orgeba5617"><span class="section-number-3">18.5.</span> Function Calling</h3>
<div class="outline-text-3" id="text-18-5">
<ul class="org-ul">
<li>funcall (function &amp;rest arguments)</li>
<li>apply (function &amp;rest arguments) - last arg as list of args</li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Argument-List.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Argument-List.html</a></li>
<li>funcall-interactively</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(print (funcall 'list '(1 2 3)))
(print (apply 'list '(1 2 3)))
</pre>
</div>

<pre class="example">

((1 2 3))

(1 2 3)
</pre>


<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">a</span> (<span style="color: #92a65e; font-weight: bold;">&amp;optional</span> v foo  c d <span style="color: #92a65e; font-weight: bold;">&amp;rest</span> e)
       (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
       (print (list v foo c d e)))
(a 1 2 3 4 5)
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">b</span> (<span style="color: #92a65e; font-weight: bold;">&amp;rest</span> e)
       <span style="color: #f08080; font-style: italic;">"function proxy"</span>
       (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
       (<span style="color: #8ac6f2; font-weight: bold;">if</span> (interactive-p)
           <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(funcall-interactively 'a e)</span>
           <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(call-interactively 'a)</span>
           (apply 'funcall-interactively 'a e)
         <span style="color: #fa8072;">;;</span><span style="color: #99968b; font-style: italic;">else</span>
         (apply 'a e))
  <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print e)</span>
)
(print (vector (list 1 2 3 4) (list 1 2 3 4)))
(call-interactively 'a)
(call-interactively 'b)
(b 1 2 3 4 5)
(print <span style="color: #95e454;">"----"</span>)
(funcall-interactively 'a 1 2 3 4 5)
(funcall-interactively 'b 1 2 3 4 5)
</pre>
</div>

<pre class="example" id="orge8a2c5b">

(1 2 3 4 (5))

[(1 2 3 4) (1 2 3 4)]

(nil nil nil nil nil)

(nil nil nil nil nil)

(1 2 3 4 (5))

"----"

(1 2 3 4 (5))

(1 2 3 4 (5))
</pre>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">averagenum</span> (n1 n2 n3 n4)
  (/ ( + n1 n2 n3 n4) 4)
  )
(averagenum 2 3 4 10 )
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">4</span>


(<span style="color: #8ac6f2; font-weight: bold;">setq</span> f 'list)
<span style="color: #fa8072;">;;     </span><span style="color: #99968b; font-style: italic;">&#8658; list</span>

(funcall f 'x 'y 'z)
  <span style="color: #fa8072;">;;   </span><span style="color: #99968b; font-style: italic;">&#8658; (x y z)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">bar</span> (n) (+ n 2))
(symbol-function 'bar)
<span style="color: #fa8072;">;;     </span><span style="color: #99968b; font-style: italic;">&#8658; (lambda (n) (+ n 2))</span>

(fset 'baz 'bar)
  <span style="color: #fa8072;">;;   </span><span style="color: #99968b; font-style: italic;">&#8658; bar</span>

(symbol-function 'baz)
    <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">&#8658; bar</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe83410" class="outline-3">
<h3 id="orgfe83410"><span class="section-number-3">18.6.</span> Named parameters:</h3>
<div class="outline-text-3" id="text-18-6">
<p>
To be able to supply arguments by name, we need to
</p>
<ul class="org-ul">
<li>declare them with <b>&amp;key &lt;name&gt;</b></li>
<li>we set them with <b>:name &lt;value&gt;</b></li>
</ul>

<p>
Default values to key parameters:
</p>
<ul class="org-ul">
<li><b>&amp;key (&lt;name&gt; &lt;value&gt;)</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">hello</span> (name <span style="color: #92a65e; font-weight: bold;">&amp;key</span> happy)())
(hello <span style="color: #95e454;">"me"</span> <span style="color: #e5786d;">:happy</span> t)

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">hello</span> (<span style="color: #92a65e; font-weight: bold;">&amp;optional</span> name <span style="color: #92a65e; font-weight: bold;">&amp;key</span> happy)())
(hello <span style="color: #95e454;">"me"</span> <span style="color: #e5786d;">:happy</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3eb40b" class="outline-3">
<h3 id="orge3eb40b"><span class="section-number-3">18.7.</span> lambda</h3>
<div class="outline-text-3" id="text-18-7">
<ul class="org-ul">
<li>A lambda expression, by itself, has no name; it is an anonymous function.</li>
<li>result is a closure object</li>
<li>they are more commonly associated with symbols to make named functions</li>
<li>A lambda form cannot be evaluated and it must appear only where LISP expects to find a function.</li>
</ul>


<p>
Macro: lambda args [doc] [interactive] body…
</p>

<p>
(lambda (x) (* x x))
     ⇒ (lambda (x) (* x x))
</p>
</div>
