lisp.md


<a id="orgd08490d"></a>

## defun

-   defines the symbol name as a function with argument list args
-   Neither name nor args should be quoted.
-   The return value of defun is undefined.
-   Careful! defun redefines even primitive functions such as car without any hesitation or notification.
-   fmakunbound - undefine

(defun function-name (a &optional b &rest c)
  "optional-documentation&#x2026;"
  (interactive argument-passing-info)
  (indent indent-spec) ; declare Form
  body&#x2026;)


<a id="org1c443f6"></a>

## arguments

arguments can have clauses or markers: (required-vars…  [&optional [optional-vars…]]  [&rest rest-var])

-   &optional
-   &rest - list of arguemnts

    (defun a (&optional v)
           (print v)
    )
    (a)

    
    nil

<https://www.gnu.org/software/emacs/manual/html_node/elisp/Argument-List.html>


<a id="org50b37f6"></a>

## (&rest args) unrolling

    (seq-let (managed-major-mode project class contact language-id) (car args) ... )


<a id="org1d57dfe"></a>

## Function Calling

-   funcall (function &rest arguments)
-   apply (function &rest arguments) - last arg as list of args
-   <https://www.gnu.org/software/emacs/manual/html_node/elisp/Argument-List.html>
-   funcall-interactively

    (print (funcall 'list '(1 2 3)))
    (print (apply 'list '(1 2 3)))

    
    ((1 2 3))
    
    (1 2 3)

    (defun a (&optional v foo  c d &rest e)
           (interactive)
           (print (list v foo c d e)))
    (a 1 2 3 4 5)
    (defun b (&rest e)
           "function proxy"
           (interactive)
           (if (interactive-p)
               ;; (funcall-interactively 'a e)
               ;; (call-interactively 'a)
               (apply 'funcall-interactively 'a e)
             ;;else
             (apply 'a e))
      ;; (print e)
    )
    (print (vector (list 1 2 3 4) (list 1 2 3 4)))
    (call-interactively 'a)
    (call-interactively 'b)
    (b 1 2 3 4 5)
    (print "----")
    (funcall-interactively 'a 1 2 3 4 5)
    (funcall-interactively 'b 1 2 3 4 5)

    
    (1 2 3 4 (5))
    
    [(1 2 3 4) (1 2 3 4)]
    
    (nil nil nil nil nil)
    
    (nil nil nil nil nil)
    
    (1 2 3 4 (5))
    
    "----"
    
    (1 2 3 4 (5))
    
    (1 2 3 4 (5))

    (defun averagenum (n1 n2 n3 n4)
      (/ ( + n1 n2 n3 n4) 4)
      )
    (averagenum 2 3 4 10 )
    ;; 4
    
    
    (setq f 'list)
    ;;     ⇒ list
    
    (funcall f 'x 'y 'z)
      ;;   ⇒ (x y z)

    
    (defun bar (n) (+ n 2))
    (symbol-function 'bar)
    ;;     ⇒ (lambda (n) (+ n 2))
    
    (fset 'baz 'bar)
      ;;   ⇒ bar
    
    (symbol-function 'baz)
        ;; ⇒ bar


<a id="org0ccb395"></a>

## Named parameters:

To be able to supply arguments by name, we need to

-   declare them with **&key <name>**
-   we set them with **:name <value>**

Default values to key parameters:

-   **&key (<name> <value>)**

    (defun hello (name &key happy)())
    (hello "me" :happy t)
    
    (defun hello (&optional name &key happy)())
    (hello "me" :happy t)


<a id="org35a4454"></a>

## lambda

-   A lambda expression, by itself, has no name; it is an anonymous function.
-   result is a closure object
-   they are more commonly associated with symbols to make named functions
-   A lambda form cannot be evaluated and it must appear only where LISP expects to find a function.

Macro: lambda args [doc] [interactive] body…

(lambda (x) (\* x x))
     ⇒ (lambda (x) (\* x x))
