sources_org/lisp.org
*** Inline Functions
- just like an ordinary function, except for one thing: when you byte-compile a call to the function the
function’s definition is expanded into the caller.
- calls run faster
- it reduces flexibility; if you change the definition of the function, calls already inlined still use the
  old definition until you recompile them.

defsubst name args [doc] [declare] [interactive] body…
*** Special Form: function function-object
- returns function-object without evaluating it
- it is similar to quote
- function-object is a valid lambda expression, this has two effects
  - When the code is byte-compiled, function-object is compiled into a byte-code function object
  - When lexical binding is enabled, function-object is converted into a closure

All equal:
(lambda (x) (* x x))
(function (lambda (x) (* x x)))
#'(lambda (x) (* x x))

** closure
A closure is a function that also carries a record of the lexical environment that existed when the function
 was defined. When it is invoked, any lexical variable references within its definition use the retained
 lexical environment.

Lambda macro or the function special form or the #' syntax (see Anonymous Functions), is automatically
 converted into a closure When lexical binding is enabled.
** Interactive Functions
 - A Lisp function becomes a command when its body contains, at top level, a form that calls the
   special form `(interactive...)’.
 - This special form does nothing when executed, but its presence in the function definition
   indicates that interactive calling is permitted.
 - Its argument controls the reading of the function arguments in an interactive call.
 - In interactive function all arguments should be after &optional or &rest to be called with (call-interactively

(interactive &optional arg-descriptor &rest modes)
- arg-descriptor: a string,  sequence of elements separated by newlines
  - P - raw prefix
  - p - numeric prefix

(call-interactive mode) - will switch off mode if mode is on.
*** links
- https://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Interactive.html
- https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html
- https://www.gnu.org/software/emacs/manual/html_node/elisp/Prefix-Command-Arguments.html
*** ex
#+begin_src elisp :results output :exports both :eval no
(defun hello ()
       "Hello World and you can call it via M-x hello."
       (interactive)
       (print "Hello World!"))
(call-interactively 'hello)
#+end_src

#+RESULTS:
:
: "Hello World!"

#+begin_src elisp :results output :exports both :eval no
(defun hello (&optional arg arg2)
       (interactive "P\np")
       ;; (print "%s" arg)
       (if  (eq arg2 4)
           (print "asd"))
       (print (list arg arg2 arg3))
)
(funcall-interactively 'hello '(1) 2 3)
(apply 'funcall-interactively 'hello '(nil 2))
;; use: C-u M-x hello
#+end_src

#+RESULTS:
:
: ((1) 2 (3))
:
: (nil 2 nil)

** arguments
- (lambda (a b c) (+ a b c)) - 3 arguments
- keyword &optional before the optional arguments
- To specify a list of zero or more extra arguments, include the keyword &rest before one final argument.
- (a b &optional c d &rest e) - here c and d optional and e is a list

