lisp.html
<div id="outline-container-orgde3a171" class="outline-4">
<h4 id="orgde3a171"><span class="section-number-4">18.7.1.</span> Inline Functions</h4>
<div class="outline-text-4" id="text-18-7-1">
<ul class="org-ul">
<li>just like an ordinary function, except for one thing: when you byte-compile a call to the function the</li>
</ul>
<p>
function’s definition is expanded into the caller.
</p>
<ul class="org-ul">
<li>calls run faster</li>
<li>it reduces flexibility; if you change the definition of the function, calls already inlined still use the
old definition until you recompile them.</li>
</ul>

<p>
defsubst name args [doc] [declare] [interactive] body…
</p>
</div>
</div>
<div id="outline-container-org307063b" class="outline-4">
<h4 id="org307063b"><span class="section-number-4">18.7.2.</span> Special Form: function function-object</h4>
<div class="outline-text-4" id="text-18-7-2">
<ul class="org-ul">
<li>returns function-object without evaluating it</li>
<li>it is similar to quote</li>
<li>function-object is a valid lambda expression, this has two effects
<ul class="org-ul">
<li>When the code is byte-compiled, function-object is compiled into a byte-code function object</li>
<li>When lexical binding is enabled, function-object is converted into a closure</li>
</ul></li>
</ul>

<p>
All equal:
(lambda (x) (* x x))
(function (lambda (x) (* x x)))
#'(lambda (x) (* x x))
</p>
</div>
</div>
</div>

<div id="outline-container-org7d75387" class="outline-3">
<h3 id="org7d75387"><span class="section-number-3">18.8.</span> closure</h3>
<div class="outline-text-3" id="text-18-8">
<p>
A closure is a function that also carries a record of the lexical environment that existed when the function
 was defined. When it is invoked, any lexical variable references within its definition use the retained
 lexical environment.
</p>

<p>
Lambda macro or the function special form or the #' syntax (see Anonymous Functions), is automatically
 converted into a closure When lexical binding is enabled.
</p>
</div>
</div>
<div id="outline-container-orgba5f398" class="outline-3">
<h3 id="orgba5f398"><span class="section-number-3">18.9.</span> Interactive Functions</h3>
<div class="outline-text-3" id="text-18-9">
<ul class="org-ul">
<li>A Lisp function becomes a command when its body contains, at top level, a form that calls the
special form `(interactive&#x2026;)’.</li>
<li>This special form does nothing when executed, but its presence in the function definition
indicates that interactive calling is permitted.</li>
<li>Its argument controls the reading of the function arguments in an interactive call.</li>
<li>In interactive function all arguments should be after &amp;optional or &amp;rest to be called with (call-interactively</li>
</ul>

<p>
(interactive &amp;optional arg-descriptor &amp;rest modes)
</p>
<ul class="org-ul">
<li>arg-descriptor: a string,  sequence of elements separated by newlines
<ul class="org-ul">
<li>P - raw prefix</li>
<li>p - numeric prefix</li>
</ul></li>
</ul>

<p>
(call-interactive mode) - will switch off mode if mode is on.
</p>
</div>
<div id="outline-container-org2d83f74" class="outline-4">
<h4 id="org2d83f74"><span class="section-number-4">18.9.1.</span> links</h4>
<div class="outline-text-4" id="text-18-9-1">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Interactive.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Interactive.html</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Prefix-Command-Arguments.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Prefix-Command-Arguments.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org469425f" class="outline-4">
<h4 id="org469425f"><span class="section-number-4">18.9.2.</span> ex</h4>
<div class="outline-text-4" id="text-18-9-2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">hello</span> ()
       <span style="color: #f08080; font-style: italic;">"Hello World and you can call it via M-x hello."</span>
       (<span style="color: #8ac6f2; font-weight: bold;">interactive</span>)
       (print <span style="color: #95e454;">"Hello World!"</span>))
(call-interactively 'hello)
</pre>
</div>

<pre class="example">

"Hello World!"
</pre>


<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">hello</span> (<span style="color: #92a65e; font-weight: bold;">&amp;optional</span> arg arg2)
       (<span style="color: #8ac6f2; font-weight: bold;">interactive</span> <span style="color: #95e454;">"P\np"</span>)
       <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print "%s" arg)</span>
       (<span style="color: #8ac6f2; font-weight: bold;">if</span>  (eq arg2 4)
           (print <span style="color: #95e454;">"asd"</span>))
       (print (list arg arg2 arg3))
)
(funcall-interactively 'hello '(1) 2 3)
(apply 'funcall-interactively 'hello '(nil 2))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">use: C-u M-x hello</span>
</pre>
</div>

<pre class="example">

((1) 2 (3))

(nil 2 nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2af155" class="outline-3">
<h3 id="orgf2af155"><span class="section-number-3">18.10.</span> arguments</h3>
<div class="outline-text-3" id="text-18-10">
<ul class="org-ul">
<li>(lambda (a b c) (+ a b c)) - 3 arguments</li>
<li>keyword &amp;optional before the optional arguments</li>
<li>To specify a list of zero or more extra arguments, include the keyword &amp;rest before one final argument.</li>
<li>(a b &amp;optional c d &amp;rest e) - here c and d optional and e is a list</li>
</ul>
</div>
</div>
