sources_org/lisp.org
** Functions with Property List argument
#+begin_src elisp :results output
(defun make-shell-interface (&rest params)
  "
  Create a shell interface.

  Possible parameters:

    :name      Name of shell
    :type      ['sh, 'bash, ...]
    :path      Path to program
    :buffer    Name of buffer

  "
  (let
       ((name   (plist-get params :name ))
        (type   (plist-get params :type))
        (path   (plist-get params :path))
        (buffer (plist-get params :buffer)))
    (list
     (cons 'name buffer)
     (cons 'type type)
     (cons 'path path)
     (cons 'buffer buffer))))


(print (make-shell-interface :name "pylaucher" :path "/usr/bin/python" :type 'sh :buffer "pyshell"))
;; ((name . "pyshell")
;;  (type . sh)
;;  (path . "/usr/bin/python")
;;  (buffer . "pyshell"))

(print (make-shell-interface :name "pylaucher" :path "/usr/bin/python" :type 'sh))
(print (make-shell-interface :name "pylaucher" :path "/usr/bin/python" :type 'bash))
;; ((name)
;;  (type . bash)
;;  (path . "/usr/bin/python")
;;  (buffer))

;; ELISP> (make-shell-interface :name "pylaucher" :path "/usr/bin/python")
;; ((name)
;;  (type)
;;  (path . "/usr/bin/python")
;;  (buffer))

;; ELISP> (make-shell-interface :name "pylaucher" )
;; ((name)
;;  (type)
;;  (path)
;;  (buffer))

;; ELISP> (make-shell-interface  )
;; ((name)
;;  (type)
;;  (path)
;;  (buffer))

;; ELISP> (make-shell-interface :buffer "pyshell"  :path "/usr/bin/python" :type 'sh :name "pylaucher")
;; ((name . "pyshell")
;;  (type . sh)
;;  (path . "/usr/bin/python")
;;  (buffer . "pyshell"))

#+end_src

#+RESULTS:
:
: ((name . "pyshell") (type . sh) (path . "/usr/bin/python") (buffer . "pyshell"))
:
: ((name) (type . sh) (path . "/usr/bin/python") (buffer))

** return
(info "(elisp) Nonlocal Exits").
- Throw
- block (info "(cl) Blocks and Exits")
- cl-defun
- defun*
#+begin_src elisp :results output :exports both :eval no
(defun my-func ()
  "Simplistic `catch'/`throw' example."
  (catch 'my-early-return
    (when t
      (throw 'my-early-return "this is the short-circuit result of catch"))
    "this is the fallback result of catch"))

#+end_src
** by reference or by value?
Passed by assignment, new reference created at argument.

https://www.gnu.org/software/emacs/manual/html_node/elisp/Mutability.html

Mutability defines ability of functions to have side effect to argument.

If there is exist a function that may modify object then it may be considered as may be affected by side effect.
** functions that do nothin
https://www.gnu.org/software/emacs/manual/html_node/elisp/Calling-Functions.html

- identity argument -> argument
- ignore &rest arguments -> nil
- always &rest arguments -> t
* Structures
- *Records* is to allow programmers to create objects with new types that are not built into Emacs.  They are
 used as the underlying representation of cl-defstruct and defclass instances.
- defclass
- cl-defstruct
- *vectors* are there if you need random access and also occupy less space.  general-purpose array whose elements can be any Lisp objects
  - used as internal structure for: kbd, symbols, byte-compiled function
