lisp.html

<div id="outline-container-orgefa6636" class="outline-3">
<h3 id="orgefa6636"><span class="section-number-3">18.11.</span> Functions with Property List argument</h3>
<div class="outline-text-3" id="text-18-11">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">make-shell-interface</span> (<span style="color: #92a65e; font-weight: bold;">&amp;rest</span> params)
  <span style="color: #f08080; font-style: italic;">"</span>
<span style="color: #f08080; font-style: italic;">  Create a shell interface.</span>

<span style="color: #f08080; font-style: italic;">  Possible parameters:</span>

<span style="color: #f08080; font-style: italic;">    :name      Name of shell</span>
<span style="color: #f08080; font-style: italic;">    :type      ['sh, 'bash, ...]</span>
<span style="color: #f08080; font-style: italic;">    :path      Path to program</span>
<span style="color: #f08080; font-style: italic;">    :buffer    Name of buffer</span>

<span style="color: #f08080; font-style: italic;">  "</span>
  (<span style="color: #8ac6f2; font-weight: bold;">let</span>
       ((name   (plist-get params <span style="color: #e5786d;">:name</span> ))
        (type   (plist-get params <span style="color: #e5786d;">:type</span>))
        (path   (plist-get params <span style="color: #e5786d;">:path</span>))
        (buffer (plist-get params <span style="color: #e5786d;">:buffer</span>)))
    (list
     (cons 'name buffer)
     (cons 'type type)
     (cons 'path path)
     (cons 'buffer buffer))))


(print (make-shell-interface <span style="color: #e5786d;">:name</span> <span style="color: #95e454;">"pylaucher"</span> <span style="color: #e5786d;">:path</span> <span style="color: #95e454;">"/usr/bin/python"</span> <span style="color: #e5786d;">:type</span> 'sh <span style="color: #e5786d;">:buffer</span> <span style="color: #95e454;">"pyshell"</span>))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">((name . "pyshell")</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(type . sh)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(path . "/usr/bin/python")</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(buffer . "pyshell"))</span>

(print (make-shell-interface <span style="color: #e5786d;">:name</span> <span style="color: #95e454;">"pylaucher"</span> <span style="color: #e5786d;">:path</span> <span style="color: #95e454;">"/usr/bin/python"</span> <span style="color: #e5786d;">:type</span> 'sh))
(print (make-shell-interface <span style="color: #e5786d;">:name</span> <span style="color: #95e454;">"pylaucher"</span> <span style="color: #e5786d;">:path</span> <span style="color: #95e454;">"/usr/bin/python"</span> <span style="color: #e5786d;">:type</span> 'bash))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">((name)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(type . bash)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(path . "/usr/bin/python")</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(buffer))</span>

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">ELISP&gt; (make-shell-interface :name "pylaucher" :path "/usr/bin/python")</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">((name)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(type)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(path . "/usr/bin/python")</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(buffer))</span>

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">ELISP&gt; (make-shell-interface :name "pylaucher" )</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">((name)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(type)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(path)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(buffer))</span>

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">ELISP&gt; (make-shell-interface  )</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">((name)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(type)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(path)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(buffer))</span>

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">ELISP&gt; (make-shell-interface :buffer "pyshell"  :path "/usr/bin/python" :type 'sh :name "pylaucher")</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">((name . "pyshell")</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(type . sh)</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(path . "/usr/bin/python")</span>
<span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">(buffer . "pyshell"))</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org66bf8b7" class="outline-3">
<h3 id="org66bf8b7"><span class="section-number-3">18.12.</span> return</h3>
<div class="outline-text-3" id="text-18-12">
<p>
(info "(elisp) Nonlocal Exits").
</p>
<ul class="org-ul">
<li>Throw</li>
<li>block (info "(cl) Blocks and Exits")</li>
<li>cl-defun</li>
<li>defun*</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">my-func</span> ()
  <span style="color: #f08080; font-style: italic;">"Simplistic `</span><span style="color: #e5786d; font-weight: bold; font-style: italic;">catch</span><span style="color: #f08080; font-style: italic;">'/`</span><span style="color: #e5786d; font-weight: bold; font-style: italic;">throw</span><span style="color: #f08080; font-style: italic;">' example."</span>
  (<span style="color: #8ac6f2; font-weight: bold;">catch</span> '<span style="color: #e5786d; font-weight: bold;">my-early-return</span>
    (<span style="color: #8ac6f2; font-weight: bold;">when</span> t
      (<span style="color: #8ac6f2; font-weight: bold;">throw</span> '<span style="color: #e5786d; font-weight: bold;">my-early-return</span> <span style="color: #95e454;">"this is the short-circuit result of catch"</span>))
    <span style="color: #95e454;">"this is the fallback result of catch"</span>))

</pre>
</div>
</div>
</div>
<div id="outline-container-org1736a6a" class="outline-3">
<h3 id="org1736a6a"><span class="section-number-3">18.13.</span> by reference or by value?</h3>
<div class="outline-text-3" id="text-18-13">
<p>
Passed by assignment, new reference created at argument.
</p>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Mutability.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Mutability.html</a>
</p>

<p>
Mutability defines ability of functions to have side effect to argument.
</p>

<p>
If there is exist a function that may modify object then it may be considered as may be affected by side effect.
</p>
</div>
</div>
<div id="outline-container-orgfb91377" class="outline-3">
<h3 id="orgfb91377"><span class="section-number-3">18.14.</span> functions that do nothin</h3>
<div class="outline-text-3" id="text-18-14">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Calling-Functions.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Calling-Functions.html</a>
</p>

<ul class="org-ul">
<li>identity argument -&gt; argument</li>
<li>ignore &amp;rest arguments -&gt; nil</li>
<li>always &amp;rest arguments -&gt; t</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc1eda10" class="outline-2">
<h2 id="orgc1eda10"><span class="section-number-2">19.</span> Structures</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li><b>Records</b> is to allow programmers to create objects with new types that are not built into Emacs.  They are
used as the underlying representation of cl-defstruct and defclass instances.</li>
<li>defclass</li>
<li>cl-defstruct</li>
<li><b>vectors</b> are there if you need random access and also occupy less space.  general-purpose array whose elements can be any Lisp objects
<ul class="org-ul">
<li>used as internal structure for: kbd, symbols, byte-compiled function</li>
</ul></li>
</ul>
</div>
</div>
