sources_org/lisp.org
* printing
- print - Print a newline at end.
- princ - does not add newline at end.  intended to produce output that is readable by people
- prin1 - does not add newline at end.
- format
- message - Print a Format String to the Messages Buffer.
- insert - Instert string to current buffer, at cursor position.
#+begin_src elisp :results output
(princ '("as" "asd"))
(print '("as" "asd"))
(pp '("as" "asd"))
#+end_src

#+RESULTS:
: (as asd)
: ("as" "asd")
: ("as" "asd")

#+begin_src elisp
(setq xbuff (generate-new-buffer "*my output*"))

(print "something" xbuff)

(switch-to-buffer xbuff )
#+end_src
* Macros
- expansion - Lisp expression which will in turn compute the value.

macro cannot be called with /apply/, /mapcar/ and so on


(macroexpand - expands form, if it is a macro call. If the result is another macro call, it is expanded in
 turn, until something which is not a macro call results

#+begin_src elisp
(defmacro inc (var)
   (list 'setq var (list '1+ var)))
(setq x 2)
(defun z(c)
    (inc c))
(inc x)
(z 3)
#+end_src

#+RESULTS:
: 4

#+begin_src elisp

(defmacro setq2 (v1 v2 e)
  (list 'progn (list 'setq v1 e) (list 'setq v2 e)))

(setq z 1)

(setq2 x y (+ z 3))

#+end_src

#+RESULTS:
: 4

#+begin_src elisp :results output :exports both :eval no
(defmacro setq2 (v1 v2 e)
  (list 'progn (list 'setq v1 e) (list 'setq v2 e)))

(print (macroexpand '(setq2 x y (+ x 2)) ) )
#+end_src

#+RESULTS:
:
: (progn (setq x (+ x 2)) (setq y (+ x 2)))

** inline function
function’s definition is expanded into the caller
: defsubst name args [doc] [declare] [interactive] body…

inline it as a compiler macro - more efficient.
: define-inline name args [doc] [declare] body… ¶
- (inline-quote expression) -
- inline-letevals (bindings…) body…  - This provides a convenient way to ensure that the arguments to an inlined function are evaluated exactly once, as well as to create local variables.
- inline-const-p expression - Return non-nil if the value of expression is already known.
- inline-const-val expression - Return the value of expression.
- inline-error format &rest args - Signal an error, formatting args according to format.

#+begin_src elisp
(define-inline myaccessor (obj)
  (inline-letevals (obj)
    (inline-quote (if (foo-p ,obj) (aref (cdr ,obj) 3) (aref ,obj 2)))))

;; equal to:
(defsubst myaccessor (obj)
  (if (foo-p obj) (aref (cdr obj) 3) (aref obj 2)))
#+end_src
* regex
** characters:
- special
- ordinary

normal escaping \[, for lisp: "\\[", also:"\n", "[ [:space:] ]"

** commands
*** rx
- (rx ...
- replace-regexp is for interactive use.
- In elisp you should use re-search-forward and replace-match to do things
#+begin_src elisp :results output :exports both :eval no
(print (rx bol
  (zero-or-more blank)
  (one-or-more digit)
  ":"))
#+end_src

#+RESULTS:
:
: "^[[:blank:]]*[[:digit:]]+:"

*** search
- search-forward
- re-search-forward
- string-match
- (looking-at "" ) - after point matches regular, does update the *match data*
- (looking-back "\n\\** ?" 2) - before point matches regular

Every successful *search* sets the *match data*. Match data normally describe the most recent search only.
- (match-string NUM &optional STRING)
  - NUM=0 - entire match
  - NUM>0 - subexpression ‘\(…\)’ in match
- replace-match
- match-data
- set-match-data
- string-match-p - do not modify match-data

#+begin_src elisp :results output :exports both :eval no
(match-string NUM &optional STRING)
#+end_src
*** TODO matching



