lisp.html
<div id="outline-container-orgc639c5a" class="outline-2">
<h2 id="orgc639c5a"><span class="section-number-2">20.</span> printing</h2>
<div class="outline-text-2" id="text-20">
<ul class="org-ul">
<li>print - Print a newline at end.</li>
<li>princ - does not add newline at end.  intended to produce output that is readable by people</li>
<li>prin1 - does not add newline at end.</li>
<li>format</li>
<li>message - Print a Format String to the Messages Buffer.</li>
<li>insert - Instert string to current buffer, at cursor position.</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(princ '(<span style="color: #95e454;">"as"</span> <span style="color: #95e454;">"asd"</span>))
(print '(<span style="color: #95e454;">"as"</span> <span style="color: #95e454;">"asd"</span>))
(pp '(<span style="color: #95e454;">"as"</span> <span style="color: #95e454;">"asd"</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> xbuff (generate-new-buffer <span style="color: #95e454;">"*my output*"</span>))

(print <span style="color: #95e454;">"something"</span> xbuff)

(switch-to-buffer xbuff )
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc8436c8" class="outline-2">
<h2 id="orgc8436c8"><span class="section-number-2">21.</span> Macros</h2>
<div class="outline-text-2" id="text-21">
<ul class="org-ul">
<li>expansion - Lisp expression which will in turn compute the value.</li>
</ul>

<p>
macro cannot be called with <i>apply</i>, <i>mapcar</i> and so on
</p>


<p>
(macroexpand - expands form, if it is a macro call. If the result is another macro call, it is expanded in
 turn, until something which is not a macro call results
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defmacro</span> <span style="color: #cae682; font-weight: bold;">inc</span> (var)
   (list 'setq var (list '1+ var)))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> x 2)
(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">z</span>(c)
    (inc c))
(inc x)
(z 3)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">
(<span style="color: #8ac6f2; font-weight: bold;">defmacro</span> <span style="color: #cae682; font-weight: bold;">setq2</span> (v1 v2 e)
  (list 'progn (list 'setq v1 e) (list 'setq v2 e)))

(<span style="color: #8ac6f2; font-weight: bold;">setq</span> z 1)

(setq2 x y (+ z 3))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defmacro</span> <span style="color: #cae682; font-weight: bold;">setq2</span> (v1 v2 e)
  (list 'progn (list 'setq v1 e) (list 'setq v2 e)))

(print (macroexpand '(setq2 x y (+ x 2)) ) )
</pre>
</div>

<pre class="example">

(progn (setq x (+ x 2)) (setq y (+ x 2)))
</pre>
</div>

<div id="outline-container-org446d8bc" class="outline-3">
<h3 id="org446d8bc"><span class="section-number-3">21.1.</span> inline function</h3>
<div class="outline-text-3" id="text-21-1">
<p>
function’s definition is expanded into the caller
</p>
<pre class="example">
defsubst name args [doc] [declare] [interactive] body…
</pre>


<p>
inline it as a compiler macro - more efficient.
</p>
<pre class="example">
define-inline name args [doc] [declare] body… ¶
</pre>

<ul class="org-ul">
<li>(inline-quote expression) -</li>
<li>inline-letevals (bindings…) body…  - This provides a convenient way to ensure that the arguments to an inlined function are evaluated exactly once, as well as to create local variables.</li>
<li>inline-const-p expression - Return non-nil if the value of expression is already known.</li>
<li>inline-const-val expression - Return the value of expression.</li>
<li>inline-error format &amp;rest args - Signal an error, formatting args according to format.</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">define-inline</span> <span style="color: #cae682; font-weight: bold;">myaccessor</span> (obj)
  (inline-letevals (obj)
    (inline-quote (<span style="color: #8ac6f2; font-weight: bold;">if</span> (foo-p ,obj) (aref (cdr ,obj) 3) (aref ,obj 2)))))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">equal to:</span>
(<span style="color: #8ac6f2; font-weight: bold;">defsubst</span> <span style="color: #cae682; font-weight: bold;">myaccessor</span> (obj)
  (<span style="color: #8ac6f2; font-weight: bold;">if</span> (foo-p obj) (aref (cdr obj) 3) (aref obj 2)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf1f8f03" class="outline-2">
<h2 id="orgf1f8f03"><span class="section-number-2">22.</span> regex</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-org1edd8c9" class="outline-3">
<h3 id="org1edd8c9"><span class="section-number-3">22.1.</span> characters:</h3>
<div class="outline-text-3" id="text-22-1">
<ul class="org-ul">
<li>special</li>
<li>ordinary</li>
</ul>

<p>
normal escaping \[, for lisp: "\\[", also:"\n", "[ [:space:] ]"
</p>
</div>
</div>

<div id="outline-container-orga44c5af" class="outline-3">
<h3 id="orga44c5af"><span class="section-number-3">22.2.</span> commands</h3>
<div class="outline-text-3" id="text-22-2">
</div>
<div id="outline-container-orgb7bb6a1" class="outline-4">
<h4 id="orgb7bb6a1"><span class="section-number-4">22.2.1.</span> rx</h4>
<div class="outline-text-4" id="text-22-2-1">
<ul class="org-ul">
<li>(rx &#x2026;</li>
<li>replace-regexp is for interactive use.</li>
<li>In elisp you should use re-search-forward and replace-match to do things</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(print (<span style="color: #8ac6f2; font-weight: bold;">rx</span> bol
  (zero-or-more blank)
  (one-or-more digit)
  <span style="color: #95e454;">":"</span>))
</pre>
</div>

<pre class="example">

"^[[:blank:]]*[[:digit:]]+:"
</pre>
</div>
</div>

<div id="outline-container-org1c86107" class="outline-4">
<h4 id="org1c86107"><span class="section-number-4">22.2.2.</span> search</h4>
<div class="outline-text-4" id="text-22-2-2">
<ul class="org-ul">
<li>search-forward</li>
<li>re-search-forward</li>
<li>string-match</li>
<li>(looking-at "" ) - after point matches regular, does update the <b>match data</b></li>
<li>(looking-back "\n\\** ?" 2) - before point matches regular</li>
</ul>

<p>
Every successful <b>search</b> sets the <b>match data</b>. Match data normally describe the most recent search only.
</p>
<ul class="org-ul">
<li>(match-string NUM &amp;optional STRING)
<ul class="org-ul">
<li>NUM=0 - entire match</li>
<li>NUM&gt;0 - subexpression ‘\(…\)’ in match</li>
</ul></li>
<li>replace-match</li>
<li>match-data</li>
<li>set-match-data</li>
<li>string-match-p - do not modify match-data</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(match-string NUM <span style="color: #92a65e; font-weight: bold;">&amp;optional</span> STRING)
</pre>
</div>
</div>
</div>
