lisp.md


<a id="org0228147"></a>

# printing

-   print - Print a newline at end.
-   princ - does not add newline at end.  intended to produce output that is readable by people
-   prin1 - does not add newline at end.
-   format
-   message - Print a Format String to the Messages Buffer.
-   insert - Instert string to current buffer, at cursor position.

    (princ '("as" "asd"))
    (print '("as" "asd"))
    (pp '("as" "asd"))

    (setq xbuff (generate-new-buffer "*my output*"))
    
    (print "something" xbuff)
    
    (switch-to-buffer xbuff )


<a id="org185a83b"></a>

# Macros

-   expansion - Lisp expression which will in turn compute the value.

macro cannot be called with *apply*, *mapcar* and so on

(macroexpand - expands form, if it is a macro call. If the result is another macro call, it is expanded in
 turn, until something which is not a macro call results

    (defmacro inc (var)
       (list 'setq var (list '1+ var)))
    (setq x 2)
    (defun z(c)
        (inc c))
    (inc x)
    (z 3)

    
    (defmacro setq2 (v1 v2 e)
      (list 'progn (list 'setq v1 e) (list 'setq v2 e)))
    
    (setq z 1)
    
    (setq2 x y (+ z 3))

    (defmacro setq2 (v1 v2 e)
      (list 'progn (list 'setq v1 e) (list 'setq v2 e)))
    
    (print (macroexpand '(setq2 x y (+ x 2)) ) )

    
    (progn (setq x (+ x 2)) (setq y (+ x 2)))


<a id="orgd23f005"></a>

## inline function

function’s definition is expanded into the caller

    defsubst name args [doc] [declare] [interactive] body…

inline it as a compiler macro - more efficient.

    define-inline name args [doc] [declare] body… ¶

-   (inline-quote expression) -
-   inline-letevals (bindings…) body…  - This provides a convenient way to ensure that the arguments to an inlined function are evaluated exactly once, as well as to create local variables.
-   inline-const-p expression - Return non-nil if the value of expression is already known.
-   inline-const-val expression - Return the value of expression.
-   inline-error format &rest args - Signal an error, formatting args according to format.

    (define-inline myaccessor (obj)
      (inline-letevals (obj)
        (inline-quote (if (foo-p ,obj) (aref (cdr ,obj) 3) (aref ,obj 2)))))
    
    ;; equal to:
    (defsubst myaccessor (obj)
      (if (foo-p obj) (aref (cdr obj) 3) (aref obj 2)))


<a id="org49cb527"></a>

# regex


<a id="org891aece"></a>

## characters:

-   special
-   ordinary

normal escaping \\[, for lisp: "\\\\[", also:"\n", "[ [:space:] ]"


<a id="org9d6912b"></a>

## commands


<a id="org2cace6a"></a>

### rx

-   (rx &#x2026;
-   replace-regexp is for interactive use.
-   In elisp you should use re-search-forward and replace-match to do things

    (print (rx bol
      (zero-or-more blank)
      (one-or-more digit)
      ":"))

    
    "^[[:blank:]]*[[:digit:]]+:"


<a id="org4696cd6"></a>

### search

-   search-forward
-   re-search-forward
-   string-match
-   (looking-at "" ) - after point matches regular, does update the **match data**
-   (looking-back "\n\\\\\*\* ?" 2) - before point matches regular

Every successful **search** sets the **match data**. Match data normally describe the most recent search only.

-   (match-string NUM &optional STRING)
    -   NUM=0 - entire match
    -   NUM>0 - subexpression ‘$…$’ in match
-   replace-match
-   match-data
-   set-match-data
-   string-match-p - do not modify match-data

    (match-string NUM &optional STRING)
