sources_org/lisp.org
** special characters
-  .        any character (but newline)
-  *        previous character or group, repeated 0 or more time
-  +        previous character or group, repeated 1 or more time
-  ?        previous character or group, repeated 0 or 1 time
- *?, +?, and ?? are non-greedy versions of *, +, and ?
-  ^        start of line
-  $        end of line
-  [...]    any character between brackets
-  [^..]    any character not in the brackets
-  [a-z]    any character between a and z
-  \        prevents interpretation of following special char
-  \|       or
-  \w       word constituent
-  \b       word boundary
-  \sc      character with c syntax (e.g. \s- for whitespace char)
-  \( \)    start/end of group
-  \&lt; \&gt;    start/end of word (faulty rendering: backslash + less-than and backslash + greater-than)
-  \_< \_>  start/end of symbol
-  \` \'    start/end of buffer/string
-  \1       string matched by the first group
-  \n       string matched by the nth group
-  \{3\}    previous character or group, repeated 3 times
-  \{3,\}   previous character or group, repeated 3 or more times
-  \{3,6\}  previous character or group, repeated 3 to 6 times
-  \=       match succeeds if it is located at point

** groups
C-u C-x = to display the category of the character under the cursor.
- \ca      ascii character
- \Ca      non-ascii character (newline included)
- \cl      latin character
- \cg      greek character
- [:digit:]  a digit, same as [0-9]
- [:alpha:]  a letter (an alphabetic character)
- [:alnum:]  a letter or a digit (an alphanumeric character)
- [:upper:]  a letter in uppercase
- [:lower:]  a letter in lowercase
- [:graph:]  a visible character
- [:print:]  a visible character plus the space character
- [:space:]  a whitespace character, as defined by the syntax table, but typically  [ \t\r\n\v\f ], which includes the newline character
- [:blank:]  a space or tab character
- [:xdigit:] an hexadecimal digit
- [:cntrl:]  a control character
- [:ascii:]  an ascii character
- [:nonascii:]  any non ascii character
- \s-   whitespace character
- \sw   word constituent
- \s_   symbol constituent
- \s.   punctuation character
- \s(   open delimiter character
- \s)   close delimiter character
- \s"   string quote character
- \s\   escape character
- \s/   character quote character
- \s$   paired delimiter
- \s'   expression prefix
- \s<   comment starter
- \s>   comment ender
- \s!   generic comment delimiter
- \s|   generic string delimiter
- \W, \B, and \Sc match any character that does not match \w, \b, and \sc.

#+begin_src elisp :results output :exports both :eval no
;; (print (string-match-p "^[:print:]+" "fsd"))
(print (string-match-p "^[[:print:]]$" "f"))
;; (print (string-match-p "^a+" "fsd"))
#+end_src

#+RESULTS:
:
: 0

** links
- https://www.emacswiki.org/emacs/RegularExpression
- https://www.gnu.org/software/emacs/manual/html_node/emacs/Regexps.html
* paths
*default-directory* - buffer-local variable with directory of current buffer file.
* Emacs Code Conventions
- M-x checkdoc.
** variable name conventions
‘...-hook’
     The variable is a normal hook (*note Hooks::).

‘...-function’
     The value is a function.

‘...-functions’
     The value is a list of functions.

‘...-form’
     The value is a form (an expression).

‘...-forms’
     The value is a list of forms (expressions).

‘...-predicate’
     The value is a predicate—a function of one argument that returns
     non-‘nil’ for success and ‘nil’ for failure.

‘...-flag’
     The value is significant only as to whether it is ‘nil’ or not.
     Since such variables often end up acquiring more values over time,
     this convention is not strongly recommended.

‘...-program’
     The value is a program name.

‘...-command’
     The value is a whole shell command.

‘...-switches’
     The value specifies options for a command.

‘PREFIX--...’
     The variable is intended for internal use and is defined in the
     file ‘PREFIX.el’.  (Emacs code contributed before 2018 may follow
     other conventions, which are being phased out.)

‘...-internal’
     The variable is intended for internal use and is defined in C code.
     (Emacs code contributed before 2018 may follow other conventions,
     which are being phased out.)
