lisp.html
<div id="outline-container-org758576c" class="outline-4">
<h4 id="org758576c"><span class="section-number-4">22.2.3.</span> <span class="todo TODO">TODO</span> matching</h4>
</div>
</div>



<div id="outline-container-org5e363a2" class="outline-3">
<h3 id="org5e363a2"><span class="section-number-3">22.3.</span> special characters</h3>
<div class="outline-text-3" id="text-22-3">
<ul class="org-ul">
<li>.        any character (but newline)</li>
<li>*        previous character or group, repeated 0 or more time</li>
<li>+        previous character or group, repeated 1 or more time</li>
<li>?        previous character or group, repeated 0 or 1 time</li>
<li>*?, +?, and ?? are non-greedy versions of *, +, and ?</li>
<li>^        start of line</li>
<li>$        end of line</li>
<li>[&#x2026;]    any character between brackets</li>
<li>[^..]    any character not in the brackets</li>
<li>[a-z]    any character between a and z</li>
<li>\        prevents interpretation of following special char</li>
<li>\|       or</li>
<li>\w       word constituent</li>
<li>\b       word boundary</li>
<li>\sc      character with c syntax (e.g. \s- for whitespace char)</li>
<li>\( \)    start/end of group</li>
<li>\&amp;lt; \&amp;gt;    start/end of word (faulty rendering: backslash + less-than and backslash + greater-than)</li>
<li>\_&lt; \_&gt;  start/end of symbol</li>
<li>\` \'    start/end of buffer/string</li>
<li>\1       string matched by the first group</li>
<li>\n       string matched by the nth group</li>
<li>\{3\}    previous character or group, repeated 3 times</li>
<li>\{3,\}   previous character or group, repeated 3 or more times</li>
<li>\{3,6\}  previous character or group, repeated 3 to 6 times</li>
<li>\=       match succeeds if it is located at point</li>
</ul>
</div>
</div>

<div id="outline-container-orga48d379" class="outline-3">
<h3 id="orga48d379"><span class="section-number-3">22.4.</span> groups</h3>
<div class="outline-text-3" id="text-22-4">
<p>
C-u C-x = to display the category of the character under the cursor.
</p>
<ul class="org-ul">
<li>\ca      ascii character</li>
<li>\Ca      non-ascii character (newline included)</li>
<li>\cl      latin character</li>
<li>\cg      greek character</li>
<li>[:digit:]  a digit, same as [0-9]</li>
<li>[:alpha:]  a letter (an alphabetic character)</li>
<li>[:alnum:]  a letter or a digit (an alphanumeric character)</li>
<li>[:upper:]  a letter in uppercase</li>
<li>[:lower:]  a letter in lowercase</li>
<li>[:graph:]  a visible character</li>
<li>[:print:]  a visible character plus the space character</li>
<li>[:space:]  a whitespace character, as defined by the syntax table, but typically  [ \t\r\n\v\f ], which includes the newline character</li>
<li>[:blank:]  a space or tab character</li>
<li>[:xdigit:] an hexadecimal digit</li>
<li>[:cntrl:]  a control character</li>
<li>[:ascii:]  an ascii character</li>
<li>[:nonascii:]  any non ascii character</li>
<li>\s-   whitespace character</li>
<li>\sw   word constituent</li>
<li>\s_   symbol constituent</li>
<li>\s.   punctuation character</li>
<li>\s(   open delimiter character</li>
<li>\s)   close delimiter character</li>
<li>\s"   string quote character</li>
<li>\s\   escape character</li>
<li>\s/   character quote character</li>
<li>\s$   paired delimiter</li>
<li>\s'   expression prefix</li>
<li>\s&lt;   comment starter</li>
<li>\s&gt;   comment ender</li>
<li>\s!   generic comment delimiter</li>
<li>\s|   generic string delimiter</li>
<li>\W, \B, and \Sc match any character that does not match \w, \b, and \sc.</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print (string-match-p "^[:print:]+" "fsd"))</span>
(print (string-match-p <span style="color: #95e454;">"^[[:print:]]$"</span> <span style="color: #95e454;">"f"</span>))
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(print (string-match-p "^a+" "fsd"))</span>
</pre>
</div>

<pre class="example">

0
</pre>
</div>
</div>

<div id="outline-container-org7964f3e" class="outline-3">
<h3 id="org7964f3e"><span class="section-number-3">22.5.</span> links</h3>
<div class="outline-text-3" id="text-22-5">
<ul class="org-ul">
<li><a href="https://www.emacswiki.org/emacs/RegularExpression">https://www.emacswiki.org/emacs/RegularExpression</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Regexps.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/Regexps.html</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org478ffc5" class="outline-2">
<h2 id="org478ffc5"><span class="section-number-2">23.</span> paths</h2>
<div class="outline-text-2" id="text-23">
<p>
<b>default-directory</b> - buffer-local variable with directory of current buffer file.
</p>
</div>
</div>
<div id="outline-container-orga6cf5ba" class="outline-2">
<h2 id="orga6cf5ba"><span class="section-number-2">24.</span> Emacs Code Conventions</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li>M-x checkdoc.</li>
</ul>
</div>
<div id="outline-container-org0ad48b5" class="outline-3">
<h3 id="org0ad48b5"><span class="section-number-3">24.1.</span> variable name conventions</h3>
<div class="outline-text-3" id="text-24-1">
<p>
‘&#x2026;-hook’
     The variable is a normal hook (*note Hooks::).
</p>

<p>
‘&#x2026;-function’
     The value is a function.
</p>

<p>
‘&#x2026;-functions’
     The value is a list of functions.
</p>

<p>
‘&#x2026;-form’
     The value is a form (an expression).
</p>

<p>
‘&#x2026;-forms’
     The value is a list of forms (expressions).
</p>

<p>
‘&#x2026;-predicate’
     The value is a predicate—a function of one argument that returns
     non-‘nil’ for success and ‘nil’ for failure.
</p>

<p>
‘&#x2026;-flag’
     The value is significant only as to whether it is ‘nil’ or not.
     Since such variables often end up acquiring more values over time,
     this convention is not strongly recommended.
</p>

<p>
‘&#x2026;-program’
     The value is a program name.
</p>

<p>
‘&#x2026;-command’
     The value is a whole shell command.
</p>

<p>
‘&#x2026;-switches’
     The value specifies options for a command.
</p>

<p>
‘PREFIX&#x2013;&#x2026;’
     The variable is intended for internal use and is defined in the
     file ‘PREFIX.el’.  (Emacs code contributed before 2018 may follow
     other conventions, which are being phased out.)
</p>

<p>
‘&#x2026;-internal’
     The variable is intended for internal use and is defined in C code.
     (Emacs code contributed before 2018 may follow other conventions,
     which are being phased out.)
</p>
</div>
</div>
