lisp.md


<a id="org95ac56f"></a>

### TODO matching


<a id="org7d4ae0e"></a>

## special characters

-   .        any character (but newline)
-   \*        previous character or group, repeated 0 or more time
-   +        previous character or group, repeated 1 or more time
-   ?        previous character or group, repeated 0 or 1 time
-   \*?, +?, and ?? are non-greedy versions of \*, +, and ?
-   ^        start of line
-   $        end of line
-   [&#x2026;]    any character between brackets
-   [^..]    any character not in the brackets
-   [a-z]    any character between a and z
-   \\        prevents interpretation of following special char
-   \\|       or
-   \w       word constituent
-   \b       word boundary
-   \sc      character with c syntax (e.g. \s- for whitespace char)
-   $ $    start/end of group
-   \\&lt; \\&gt;    start/end of word (faulty rendering: backslash + less-than and backslash + greater-than)
-   \\\_< \\\_>  start/end of symbol
-   \\\` \\'    start/end of buffer/string
-   \\1       string matched by the first group
-   \n       string matched by the nth group
-   \\{3\\}    previous character or group, repeated 3 times
-   \\{3,\\}   previous character or group, repeated 3 or more times
-   \\{3,6\\}  previous character or group, repeated 3 to 6 times
-   \\=       match succeeds if it is located at point


<a id="org18258ea"></a>

## groups

C-u C-x = to display the category of the character under the cursor.

-   \ca      ascii character
-   \Ca      non-ascii character (newline included)
-   \cl      latin character
-   \cg      greek character
-   [:digit:]  a digit, same as [0-9]
-   [:alpha:]  a letter (an alphabetic character)
-   [:alnum:]  a letter or a digit (an alphanumeric character)
-   [:upper:]  a letter in uppercase
-   [:lower:]  a letter in lowercase
-   [:graph:]  a visible character
-   [:print:]  a visible character plus the space character
-   [:space:]  a whitespace character, as defined by the syntax table, but typically  [ \t\r\n\v\f ], which includes the newline character
-   [:blank:]  a space or tab character
-   [:xdigit:] an hexadecimal digit
-   [:cntrl:]  a control character
-   [:ascii:]  an ascii character
-   [:nonascii:]  any non ascii character
-   \s-   whitespace character
-   \sw   word constituent
-   \s\_   symbol constituent
-   \s.   punctuation character
-   \s(   open delimiter character
-   \s)   close delimiter character
-   \s"   string quote character
-   \s\\   escape character
-   \s/   character quote character
-   \s$   paired delimiter
-   \s'   expression prefix
-   \s<   comment starter
-   \s>   comment ender
-   \s!   generic comment delimiter
-   \s|   generic string delimiter
-   \W, \B, and \Sc match any character that does not match \w, \b, and \sc.

    ;; (print (string-match-p "^[:print:]+" "fsd"))
    (print (string-match-p "^[[:print:]]$" "f"))
    ;; (print (string-match-p "^a+" "fsd"))

    
    0


<a id="orgc8dc855"></a>

## links

-   <https://www.emacswiki.org/emacs/RegularExpression>
-   <https://www.gnu.org/software/emacs/manual/html_node/emacs/Regexps.html>


<a id="org40a7dd1"></a>

# paths

**default-directory** - buffer-local variable with directory of current buffer file.


<a id="org65661b8"></a>

# Emacs Code Conventions

-   M-x checkdoc.


<a id="orgacde9a1"></a>

## variable name conventions

‘&#x2026;-hook’
     The variable is a normal hook (\*note Hooks::).

‘&#x2026;-function’
     The value is a function.

‘&#x2026;-functions’
     The value is a list of functions.

‘&#x2026;-form’
     The value is a form (an expression).

‘&#x2026;-forms’
     The value is a list of forms (expressions).

‘&#x2026;-predicate’
     The value is a predicate—a function of one argument that returns
     non-‘nil’ for success and ‘nil’ for failure.

‘&#x2026;-flag’
     The value is significant only as to whether it is ‘nil’ or not.
     Since such variables often end up acquiring more values over time,
     this convention is not strongly recommended.

‘&#x2026;-program’
     The value is a program name.

‘&#x2026;-command’
     The value is a whole shell command.

‘&#x2026;-switches’
     The value specifies options for a command.

‘PREFIX&#x2013;&#x2026;’
     The variable is intended for internal use and is defined in the
     file ‘PREFIX.el’.  (Emacs code contributed before 2018 may follow
     other conventions, which are being phased out.)

‘&#x2026;-internal’
     The variable is intended for internal use and is defined in C code.
     (Emacs code contributed before 2018 may follow other conventions,
     which are being phased out.)
