sources_org/lisp.org
** commands
- (;) - comment on the same line
- (;;) - comment on the new line
** recommendation
- All the variables should be let-bound; otherwise, you're altering global values.
- Code is not indented and hard to read.  Normally, sexp indentation in Emacs is aggressive enough that it
 takes effort to make code look like this, rather than to make it right.
- Use when instead of if, progn.

- https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips.html
- https://github.com/bbatsov/emacs-lisp-style-guide
- C mostly https://www.gnu.org/prep/standards/standards.html
- https://www.math.utah.edu/docs/info/elisp_38.html
* examples
1s
#+BEGIN_SRC lisp
 (list 1 2 (quote foo))
 (setq x (+ x 1)) = (incf x)


 ;;;; COMMENT-EXAMPLE function
 ;;; This function is useless
 ;;; except demonstrate comments.

 (defun asdas (x y)	;X is anything
	 ;; X is now not a list
	 ((sumbolp x)


#+END_SRC
* USE CASES
sort numbers:
- (sort '(1 2 3) '(lambda (a b) (< a b)))
- (sort '(2 4 7 3 9 1 5 4 6 3 8) #'<)
** measure time of execution of any function
#+begin_src elisp :results output :exports both :eval no
(defun my/time-call (time-call &rest args)
  (message "Ohai %s" args)
  (let ((start-time (float-time))
        (org-babel-python-command "/usr/bin/timeout 15 python")
        )
    (apply time-call args)
    (message "Call took %f seconds" (- (float-time) start-time)))
  )
(advice-add 'org-babel-python-evaluate-external-process :around #'my/time-call)
#+end_src
** working with tabular data
Save to .org file
#+NAME: students-multiple-grade
   | Name    | Math | English | Science |
   |---------+------+---------+---------|
   | Alice   | A    | B       | C       |
   | Bob     | B    | A       | B       |
   | Charlie | C    | A       | A       |

#+begin_src elisp :var students=students-multiple-grade :results output :exports both :eval no
(mapc (lambda (student)
        (let ((name (car student))
              (math (nth 1 student))
              (english (nth 2 student))
              (science (nth 3 student)))
        (with-temp-buffer
          (insert (concat "Name: " name "\n"))
          (insert (concat "Math: " math "\nEnglish: " english "\nScience: " science "\n"))
          (write-region (point-min) (point-max) (concat name ".org"))
          ;; Export PDF
          ;; (find-file (concat name ".org"))
          ;; (org-latex-export-to-pdf)
          )))
      students)
(print "Operation finished.")
#+end_src

#+RESULTS:
:
: "Operation finished."

: Wrote /home/u/tmp/Alice.org
: Wrote /home/u/tmp/Bob.org
: Wrote /home/u/tmp/Charlie.org

* Emacs Lisp
s
- introduction https://www.gnu.org/software/emacs/manual/html_mono/eintr.html
- short http://ergoemacs.org/emacs/elisp_basics.html

- function may reference local varibles in the scope it is called from, but not in the scope it was defined.
- REPL mode: M-x ielm
- cl.el
- .elc  - byte compiled code
- (message "hi %d")    ; %d number, %s string %S - lisp expression. - to buffer "*Messages*" C-h e
- (if nil "yes" "no") ; "no" ; (), '(), (list)
- (if t "yes" "no") ; "yes"; 0, "", [] - vector of 0 elements
- (not (and (or (< (<= (>= (= (/= not equal. Comparing strings: (equal (string-equal
- (equal - if same type and value
- (eq - if same Lisp object

** help
- get help:
  - F1 f
  - F1 S - descrybe symbol
