lisp.html
<div id="outline-container-org0a4853d" class="outline-3">
<h3 id="org0a4853d"><span class="section-number-3">24.2.</span> commands</h3>
<div class="outline-text-3" id="text-24-2">
<ul class="org-ul">
<li>(;) - comment on the same line</li>
<li>(;;) - comment on the new line</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa59ce6" class="outline-3">
<h3 id="orgaa59ce6"><span class="section-number-3">24.3.</span> recommendation</h3>
<div class="outline-text-3" id="text-24-3">
<ul class="org-ul">
<li>All the variables should be let-bound; otherwise, you're altering global values.</li>
<li>Code is not indented and hard to read.  Normally, sexp indentation in Emacs is aggressive enough that it
takes effort to make code look like this, rather than to make it right.</li>
<li>Use when instead of if, progn.</li>

<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips.html</a></li>
<li><a href="https://github.com/bbatsov/emacs-lisp-style-guide">https://github.com/bbatsov/emacs-lisp-style-guide</a></li>
<li>C mostly <a href="https://www.gnu.org/prep/standards/standards.html">https://www.gnu.org/prep/standards/standards.html</a></li>
<li><a href="https://www.math.utah.edu/docs/info/elisp_38.html">https://www.math.utah.edu/docs/info/elisp_38.html</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6a330dd" class="outline-2">
<h2 id="org6a330dd"><span class="section-number-2">25.</span> examples</h2>
<div class="outline-text-2" id="text-25">
<p>
1s
</p>
<div class="org-src-container">
<pre class="src src-lisp"> (list 1 2 (quote foo))
 (setq x (+ x 1)) = (incf x)


 <span style="color: #fa8072;">;;;; </span><span style="color: #99968b; font-style: italic;">COMMENT-EXAMPLE function</span>
 <span style="color: #fa8072;">;;; </span><span style="color: #99968b; font-style: italic;">This function is useless</span>
 <span style="color: #fa8072;">;;; </span><span style="color: #99968b; font-style: italic;">except demonstrate comments.</span>

 (<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">asdas</span> (x y)     <span style="color: #99968b; font-style: italic;">;X is anything</span>
         <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">X is now not a list</span>
         ((sumbolp x)


</pre>
</div>
</div>
</div>
<div id="outline-container-org12d474d" class="outline-2">
<h2 id="org12d474d"><span class="section-number-2">26.</span> USE CASES</h2>
<div class="outline-text-2" id="text-26">
<p>
sort numbers:
</p>
<ul class="org-ul">
<li>(sort '(1 2 3) '(lambda (a b) (&lt; a b)))</li>
<li>(sort '(2 4 7 3 9 1 5 4 6 3 8) #'&lt;)</li>
</ul>
</div>
<div id="outline-container-org9976ecf" class="outline-3">
<h3 id="org9976ecf"><span class="section-number-3">26.1.</span> measure time of execution of any function</h3>
<div class="outline-text-3" id="text-26-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">my/time-call</span> (time-call <span style="color: #92a65e; font-weight: bold;">&amp;rest</span> args)
  (message <span style="color: #95e454;">"Ohai %s"</span> args)
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((start-time (float-time))
        (org-babel-python-command <span style="color: #95e454;">"/usr/bin/timeout 15 python"</span>)
        )
    (apply time-call args)
    (message <span style="color: #95e454;">"Call took %f seconds"</span> (- (float-time) start-time)))
  )
(advice-add 'org-babel-python-evaluate-external-process <span style="color: #e5786d;">:around</span> #'my/time-call)
</pre>
</div>
</div>
</div>
<div id="outline-container-org840b747" class="outline-3">
<h3 id="org840b747"><span class="section-number-3">26.2.</span> working with tabular data</h3>
<div class="outline-text-3" id="text-26-2">
<p>
Save to .org file
</p>
<table id="orge42085f" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Math</th>
<th scope="col" class="org-left">English</th>
<th scope="col" class="org-left">Science</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Alice</td>
<td class="org-left">A</td>
<td class="org-left">B</td>
<td class="org-left">C</td>
</tr>

<tr>
<td class="org-left">Bob</td>
<td class="org-left">B</td>
<td class="org-left">A</td>
<td class="org-left">B</td>
</tr>

<tr>
<td class="org-left">Charlie</td>
<td class="org-left">C</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-elisp">(mapc (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (student)
        (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((name (car student))
              (math (nth 1 student))
              (english (nth 2 student))
              (science (nth 3 student)))
        (<span style="color: #8ac6f2; font-weight: bold;">with-temp-buffer</span>
          (insert (concat <span style="color: #95e454;">"Name: "</span> name <span style="color: #95e454;">"\n"</span>))
          (insert (concat <span style="color: #95e454;">"Math: "</span> math <span style="color: #95e454;">"\nEnglish: "</span> english <span style="color: #95e454;">"\nScience: "</span> science <span style="color: #95e454;">"\n"</span>))
          (write-region (point-min) (point-max) (concat name <span style="color: #95e454;">".org"</span>))
          <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">Export PDF</span>
          <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(find-file (concat name ".org"))</span>
          <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(org-latex-export-to-pdf)</span>
          )))
      students)
(print <span style="color: #95e454;">"Operation finished."</span>)
</pre>
</div>

<pre class="example">

"Operation finished."
</pre>


<pre class="example">
Wrote /home/u/tmp/Alice.org
Wrote /home/u/tmp/Bob.org
Wrote /home/u/tmp/Charlie.org
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcab409f" class="outline-2">
<h2 id="orgcab409f"><span class="section-number-2">27.</span> Emacs Lisp</h2>
<div class="outline-text-2" id="text-27">
<p>
s
</p>
<ul class="org-ul">
<li>introduction <a href="https://www.gnu.org/software/emacs/manual/html_mono/eintr.html">https://www.gnu.org/software/emacs/manual/html_mono/eintr.html</a></li>
<li>short <a href="http://ergoemacs.org/emacs/elisp_basics.html">http://ergoemacs.org/emacs/elisp_basics.html</a></li>

<li>function may reference local varibles in the scope it is called from, but not in the scope it was defined.</li>
<li>REPL mode: M-x ielm</li>
<li>cl.el</li>
<li>.elc  - byte compiled code</li>
<li>(message "hi %d")    ; %d number, %s string %S - lisp expression. - to buffer "<b>Messages</b>" C-h e</li>
<li>(if nil "yes" "no") ; "no" ; (), '(), (list)</li>
<li>(if t "yes" "no") ; "yes"; 0, "", [] - vector of 0 elements</li>
<li>(not (and (or (&lt; (&lt;= (&gt;= (= (/= not equal. Comparing strings: (equal (string-equal</li>
<li>(equal - if same type and value</li>
<li>(eq - if same Lisp object</li>
</ul>
</div>

<div id="outline-container-org4adb8f8" class="outline-3">
<h3 id="org4adb8f8"><span class="section-number-3">27.1.</span> help</h3>
<div class="outline-text-3" id="text-27-1">
<ul class="org-ul">
<li>get help:
<ul class="org-ul">
<li>F1 f</li>
<li>F1 S - descrybe symbol</li>
</ul></li>
</ul>
</div>
</div>
