lisp.md


<a id="org456721c"></a>

## commands

-   (;) - comment on the same line
-   (;;) - comment on the new line


<a id="org7c18ff1"></a>

## recommendation

-   All the variables should be let-bound; otherwise, you're altering global values.
-   Code is not indented and hard to read.  Normally, sexp indentation in Emacs is aggressive enough that it
    takes effort to make code look like this, rather than to make it right.
-   Use when instead of if, progn.

-   <https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips.html>
-   <https://github.com/bbatsov/emacs-lisp-style-guide>
-   C mostly <https://www.gnu.org/prep/standards/standards.html>
-   <https://www.math.utah.edu/docs/info/elisp_38.html>


<a id="org0ee8bbf"></a>

# examples

1s

    (list 1 2 (quote foo))
    (setq x (+ x 1)) = (incf x)
    
    
    ;;;; COMMENT-EXAMPLE function
    ;;; This function is useless
    ;;; except demonstrate comments.
    
    (defun asdas (x y)	;X is anything
    	;; X is now not a list
    	((sumbolp x)


<a id="orgcfbbca9"></a>

# USE CASES

sort numbers:

-   (sort '(1 2 3) '(lambda (a b) (< a b)))
-   (sort '(2 4 7 3 9 1 5 4 6 3 8) #'<)


<a id="org20f8cbf"></a>

## measure time of execution of any function

    (defun my/time-call (time-call &rest args)
      (message "Ohai %s" args)
      (let ((start-time (float-time))
            (org-babel-python-command "/usr/bin/timeout 15 python")
            )
        (apply time-call args)
        (message "Call took %f seconds" (- (float-time) start-time)))
      )
    (advice-add 'org-babel-python-evaluate-external-process :around #'my/time-call)


<a id="org7e28a5e"></a>

## working with tabular data

Save to .org file

<table id="orgcbdb35f" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Math</th>
<th scope="col" class="org-left">English</th>
<th scope="col" class="org-left">Science</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Alice</td>
<td class="org-left">A</td>
<td class="org-left">B</td>
<td class="org-left">C</td>
</tr>


<tr>
<td class="org-left">Bob</td>
<td class="org-left">B</td>
<td class="org-left">A</td>
<td class="org-left">B</td>
</tr>


<tr>
<td class="org-left">Charlie</td>
<td class="org-left">C</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
</tr>
</tbody>
</table>

    (mapc (lambda (student)
            (let ((name (car student))
                  (math (nth 1 student))
                  (english (nth 2 student))
                  (science (nth 3 student)))
            (with-temp-buffer
              (insert (concat "Name: " name "\n"))
              (insert (concat "Math: " math "\nEnglish: " english "\nScience: " science "\n"))
              (write-region (point-min) (point-max) (concat name ".org"))
              ;; Export PDF
              ;; (find-file (concat name ".org"))
              ;; (org-latex-export-to-pdf)
              )))
          students)
    (print "Operation finished.")

    
    "Operation finished."

    Wrote /home/u/tmp/Alice.org
    Wrote /home/u/tmp/Bob.org
    Wrote /home/u/tmp/Charlie.org


<a id="org9f46076"></a>

# Emacs Lisp

s

-   introduction <https://www.gnu.org/software/emacs/manual/html_mono/eintr.html>
-   short <http://ergoemacs.org/emacs/elisp_basics.html>

-   function may reference local varibles in the scope it is called from, but not in the scope it was defined.
-   REPL mode: M-x ielm
-   cl.el
-   .elc  - byte compiled code
-   (message "hi %d")    ; %d number, %s string %S - lisp expression. - to buffer "**Messages**" C-h e
-   (if nil "yes" "no") ; "no" ; (), '(), (list)
-   (if t "yes" "no") ; "yes"; 0, "", [] - vector of 0 elements
-   (not (and (or (< (<= (>= (= (/= not equal. Comparing strings: (equal (string-equal
-   (equal - if same type and value
-   (eq - if same Lisp object


<a id="org9197126"></a>

## help

-   get help:
    -   F1 f
    -   F1 S - descrybe symbol
