sources_org/lisp.org
** Keys:
 - <TAB>	Indent line
 - M-C-\	Indent region
 - M-;	Comment
 - C-x ;	Set comment column
 - <ESC> <TAB> Completion for Symbol Names
 Info:
 - C-h S	Info documentation for symbol
 - M-x woman or man   for operation system command, library function or system call.
 - C-h f	Emacs Lisp functions
 - c-h v	Emacs Lisp variable
 - C-x C-e	eval-last-sexp - Evaluate the expression to the left of cursor.
** Commands
- C-M-x (eval-defun)
- M-: (eval-expression)

** ask user input
#+begin_src lisp
(if (y-or-n-p "Do it?")
    (progn
      ;; code to do something here
    )
  (progn
    ;; code if user answered no.
  )
)
#+end_src
** suppress messages by function and subfunctions
#+begin_src elisp :results none :exports code :eval no
(defun suppress-messages (old-fun &rest args)
  (cl-flet ((silence (&rest args1) (ignore)))
    (advice-add 'message :around #'silence)
    (unwind-protect
         (apply old-fun args)
      (advice-remove 'message #'silence))))
(advice-add 'server-execute :around #'suppress-messages)
#+end_src
** execute shell command
https://www.eigenbahn.com/2020/01/19/painless-emacs-shell-commands
** defcustom
right way to set it in .emacs:
- (setopt global-subword-mode t)  if you have emacs 29 or later                                                                           Wed
- or (customize-set-variable global-subword-mode t)

#+begin_src elisp
(defcustom text-mode-hook nil
  "Normal hook run when entering Text mode and many related modes."
  :type 'hook ;; tells Emacs the kind of data to which text-mode-hook should be set and how to display the value in a Customization buffer.
  :options '(turn-on-auto-fill flyspell-mode) ;; keyword specifies a suggested list of values for the variable
  :group 'wp) ;;  in which group the variable is located.

# Emacs automaically manage this with M-x customize
(custom-set-variables  '(text-mode-hook '(turn-on-auto-fill text-mode-hook-identify)))
#+end_src
** map
src/fns.c

(mapc FUNCTION SEQUENCE)	Apply FUNCTION to each element of SEQUENCE for side effects only.

(mapcar FUNCTION SEQUENCE)	Apply FUNCTION to each element of SEQUENCE, and make a list of the results.

#+begin_src elisp :results output :exports both :eval no
(setq full-range '(1 2 3 4))
(setq re (mapcar (lambda (arg) (/ arg 2)) full-range))
(print re)
#+end_src

#+RESULTS:
:
: (0 1 1 2)

** buffers
- buffer-string - get buffer text as string with properties
- (buffer-substring-no-properties (point-min) (point-max)
- (buffer-name)
** cl-loop
cl-macs.el

(cl-loop for handler in some_list
   until (condition-case ...
