lisp.html
<div id="outline-container-org839fa7a" class="outline-3">
<h3 id="org839fa7a"><span class="section-number-3">27.2.</span> Keys:</h3>
<div class="outline-text-3" id="text-27-2">
<ul class="org-ul">
<li>&lt;TAB&gt;	Indent line</li>
<li>M-C-\	Indent region</li>
<li>M-;	Comment</li>
<li>C-x ;	Set comment column</li>
<li>&lt;ESC&gt; &lt;TAB&gt; Completion for Symbol Names</li>
</ul>
<p>
Info:
</p>
<ul class="org-ul">
<li>C-h S	Info documentation for symbol</li>
<li>M-x woman or man   for operation system command, library function or system call.</li>
<li>C-h f	Emacs Lisp functions</li>
<li>c-h v	Emacs Lisp variable</li>
<li>C-x C-e	eval-last-sexp - Evaluate the expression to the left of cursor.</li>
</ul>
</div>
</div>
<div id="outline-container-org0977e09" class="outline-3">
<h3 id="org0977e09"><span class="section-number-3">27.3.</span> Commands</h3>
<div class="outline-text-3" id="text-27-3">
<ul class="org-ul">
<li>C-M-x (eval-defun)</li>
<li>M-: (eval-expression)</li>
</ul>
</div>
</div>

<div id="outline-container-orgc8d1e2e" class="outline-3">
<h3 id="orgc8d1e2e"><span class="section-number-3">27.4.</span> ask user input</h3>
<div class="outline-text-3" id="text-27-4">
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #8ac6f2; font-weight: bold;">if</span> (y-or-n-p <span style="color: #95e454;">"Do it?"</span>)
    (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
      <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">code to do something here</span>
    )
  (<span style="color: #8ac6f2; font-weight: bold;">progn</span>
    <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">code if user answered no.</span>
  )
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org67ece24" class="outline-3">
<h3 id="org67ece24"><span class="section-number-3">27.5.</span> suppress messages by function and subfunctions</h3>
<div class="outline-text-3" id="text-27-5">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">suppress-messages</span> (old-fun <span style="color: #92a65e; font-weight: bold;">&amp;rest</span> args)
  (<span style="color: #8ac6f2; font-weight: bold;">cl-flet</span> ((silence (<span style="color: #92a65e; font-weight: bold;">&amp;rest</span> args1) (ignore)))
    (advice-add 'message <span style="color: #e5786d;">:around</span> #'silence)
    (<span style="color: #8ac6f2; font-weight: bold;">unwind-protect</span>
         (apply old-fun args)
      (advice-remove 'message #'silence))))
(advice-add 'server-execute <span style="color: #e5786d;">:around</span> #'suppress-messages)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc997e07" class="outline-3">
<h3 id="orgc997e07"><span class="section-number-3">27.6.</span> execute shell command</h3>
<div class="outline-text-3" id="text-27-6">
<p>
<a href="https://www.eigenbahn.com/2020/01/19/painless-emacs-shell-commands">https://www.eigenbahn.com/2020/01/19/painless-emacs-shell-commands</a>
</p>
</div>
</div>
<div id="outline-container-org0acef8d" class="outline-3">
<h3 id="org0acef8d"><span class="section-number-3">27.7.</span> defcustom</h3>
<div class="outline-text-3" id="text-27-7">
<p>
right way to set it in .emacs:
</p>
<ul class="org-ul">
<li>(setopt global-subword-mode t)  if you have emacs 29 or later                                                                           Wed</li>
<li>or (customize-set-variable global-subword-mode t)</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defcustom</span> <span style="color: #cae682;">text-mode-hook</span> nil
  <span style="color: #f08080; font-style: italic;">"Normal hook run when entering Text mode and many related modes."</span>
  <span style="color: #e5786d;">:type</span> 'hook <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">tells Emacs the kind of data to which text-mode-hook should be set and how to display the value in a Customization buffer.</span>
  <span style="color: #e5786d;">:options</span> '(turn-on-auto-fill flyspell-mode) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">keyword specifies a suggested list of values for the variable</span>
  <span style="color: #e5786d;">:group</span> 'wp) <span style="color: #fa8072;">;;  </span><span style="color: #99968b; font-style: italic;">in which group the variable is located.</span>

# Emacs automaically manage this with M-x customize
(custom-set-variables  '(text-mode-hook '(turn-on-auto-fill text-mode-hook-identify)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org48140fb" class="outline-3">
<h3 id="org48140fb"><span class="section-number-3">27.8.</span> map</h3>
<div class="outline-text-3" id="text-27-8">
<p>
src/fns.c
</p>

<p>
(mapc FUNCTION SEQUENCE)	Apply FUNCTION to each element of SEQUENCE for side effects only.
</p>

<p>
(mapcar FUNCTION SEQUENCE)	Apply FUNCTION to each element of SEQUENCE, and make a list of the results.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">setq</span> full-range '(1 2 3 4))
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> re (mapcar (<span style="color: #8ac6f2; font-weight: bold;">lambda</span> (arg) (/ arg 2)) full-range))
(print re)
</pre>
</div>

<pre class="example">

(0 1 1 2)
</pre>
</div>
</div>

<div id="outline-container-org9dc669f" class="outline-3">
<h3 id="org9dc669f"><span class="section-number-3">27.9.</span> buffers</h3>
<div class="outline-text-3" id="text-27-9">
<ul class="org-ul">
<li>buffer-string - get buffer text as string with properties</li>
<li>(buffer-substring-no-properties (point-min) (point-max)</li>
<li>(buffer-name)</li>
</ul>
</div>
</div>
<div id="outline-container-org2d421d8" class="outline-3">
<h3 id="org2d421d8"><span class="section-number-3">27.10.</span> cl-loop</h3>
<div class="outline-text-3" id="text-27-10">
<p>
cl-macs.el
</p>

<p>
(cl-loop for handler in some<sub>list</sub>
   until (condition-case &#x2026;
</p>
</div>
</div>
