lisp.html
<div id="outline-container-orge152710" class="outline-3">
<h3 id="orge152710"><span class="section-number-3">27.11.</span> convetions and style guide</h3>
<div class="outline-text-3" id="text-27-11">
<p>
comments:
</p>
<ul class="org-ul">
<li>; - used at the end of line</li>
<li>;; - used in code as separate line</li>
<li>;;; We use them for comments that should be considered a heading by Outline minor mode.</li>
<li>on’t end headings with a colon : or any other punctuation.</li>
</ul>

<p>
naming:
</p>
<ul class="org-ul">
<li>Prefix unused local (lexically scoped) variables with _. (lambda (x _y) x)</li>
<li>&#x2013; to denote private top-level definitions . <code>projectile--private-fun</code></li>
<li>lowercas with - separator: some-var</li>
<li>name of program as a prefix with ‘-’ separator
<ul class="org-ul">
<li>exceptions: ‘list-prefix’, ‘define-&#x2026;-prefix-&#x2026;’</li>
<li>you may use two or three alternative common prefixes</li>
</ul></li>
</ul>

<p>
functions:
</p>
<ul class="org-ul">
<li>“xxx-p” - check if true</li>
<li>Constructs that define a function or variable should be macros, not functions, and their names should start
with ‘define-’.</li>
<li>Use <code>lambdas</code> for local bindings and function calls, not for hooks or global variables.</li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Coding-Conventions.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Coding-Conventions.html</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips.html</a></li>
<li><a href="https://github.com/bbatsov/emacs-lisp-style-guide">https://github.com/bbatsov/emacs-lisp-style-guide</a></li>
</ul>


<p>
naming variables:
</p>
<ul class="org-ul">
<li>if the purpose of a variable is to store a single function, give it a name that ends in ‘-function’</li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips-for-Defining.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips-for-Defining.html</a></li>
</ul>

<p>
major mode: <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Major-Mode-Conventions.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Major-Mode-Conventions.html</a>
</p>

<p>
minor mode: <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Minor-Mode-Conventions.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Minor-Mode-Conventions.html</a>
</p>
</div>
</div>

<div id="outline-container-orge8ca709" class="outline-3">
<h3 id="orge8ca709"><span class="section-number-3">27.12.</span> advices-reverence</h3>
<div class="outline-text-3" id="text-27-12">
<p>
Look at apply, all after FUNCTION is arguments that FUNCTION should handle. r = &amp;rest args
</p>
<ul class="org-ul">
<li>:around        (lambda (&amp;rest r) (apply FUNCTION <b>OLDFUN</b> r))</li>
<li>:before        (lambda (&amp;rest r) (apply FUNCTION r) (apply <b>OLDFUN</b> r))</li>
<li>:after         (lambda (&amp;rest r) (prog1 (apply OLDFUN r) (apply FUNCTION r)))</li>
<li>:override      (lambda (&amp;rest r) (apply FUNCTION r))</li>
<li>:after-until   (lambda (&amp;rest r) (or (apply OLDFUN r) (apply FUNCTION r)))</li>
<li>:after-while   (lambda (&amp;rest r) (and (apply OLDFUN r) (apply FUNCTION r)))</li>
<li>:before-until  (lambda (&amp;rest r) (or (apply FUNCTION r) (apply OLDFUN r)))</li>
<li>:before-while  (lambda (&amp;rest r) (and (apply FUNCTION r) (apply OLDFUN r)))</li>
<li>:filter-args   (lambda (&amp;rest r) (apply OLDFUN (funcall FUNCTION r)))</li>
<li>:filter-return (lambda (&amp;rest r) (funcall FUNCTION (apply OLDFUN r)))</li>
</ul>

<p>
:around
</p>
<ul class="org-ul">
<li>(orig-fun &amp;rest args)</li>
</ul>

<p>
:override
</p>
<ul class="org-ul">
<li>(&amp;rest args)</li>
</ul>
</div>
</div>
<div id="outline-container-org7187c7e" class="outline-3">
<h3 id="org7187c7e"><span class="section-number-3">27.13.</span> functional programming - stream of data</h3>
<div class="outline-text-3" id="text-27-13">
<p>
Transducers <a href="https://codeberg.org/fosskers/transducers.el">https://codeberg.org/fosskers/transducers.el</a>
</p>
<ul class="org-ul">
<li>change calls</li>
</ul>

<p>
cl-lib, dash - alternatives
</p>

<p>
elpa stream - orthogonal
</p>

<p>
seq/generics
</p>
</div>
</div>
<div id="outline-container-org7f25660" class="outline-3">
<h3 id="org7f25660"><span class="section-number-3">27.14.</span> testing</h3>
<div class="outline-text-3" id="text-27-14">
</div>
<div id="outline-container-org9fb1def" class="outline-4">
<h4 id="org9fb1def"><span class="section-number-4">27.14.1.</span> ERT: Emacs Lisp Regression Testing</h4>
<div class="outline-text-4" id="text-27-14-1">
<p>
build-in <a href="file:///usr/share/emacs/29.1/lisp/emacs-lisp/ert.el">file:///usr/share/emacs/29.1/lisp/emacs-lisp/ert.el</a>
</p>
<ul class="org-ul">
<li>C-h i m ert RET</li>
<li>$info ert</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org32c3ddf"></a>ex<br />
<div class="outline-text-5" id="text-27-14-1-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">require</span> '<span style="color: #e5786d; font-weight: bold;">ert</span>)
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">(require 'tested-module)</span>
(<span style="color: #8ac6f2; font-weight: bold;">ert-deftest</span> <span style="color: #cae682; font-weight: bold;">csv-tests-end-of-field</span> ()
  (with-temp-buffe
   (should (= (+ 1 2) 4)))
)
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">execute test programmatically</span>
(ert-run-tests-interactively <span style="color: #95e454;">"csv-tests-end-of-field"</span>)
</pre>
</div>
</div>
</li>


<li><a id="org4409016"></a>links<br />
<div class="outline-text-5" id="text-27-14-1-2">
<p>
<a href="https://www.emacswiki.org/emacs/UnitTesting">https://www.emacswiki.org/emacs/UnitTesting</a>
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb838d1b" class="outline-2">
<h2 id="orgb838d1b"><span class="section-number-2">28.</span> MELPA</h2>
<div class="outline-text-2" id="text-28">
<p>
<a href="https://github.com/melpa/melpa">https://github.com/melpa/melpa</a>
</p>

<ul class="org-ul">
<li>M-x package-recipe-mode</li>
<li>M-x package-build-current-recipie</li>
<li>fork <a href="https://github.com/melpa/melpa/">https://github.com/melpa/melpa/</a></li>
<li>git clone own/melpa</li>
<li>git branch recipe</li>
<li>git checkout recipe</li>
<li>git cp ~/recipe own/melpa/recipies/</li>
<li>git add</li>
<li>git push</li>
</ul>
</div>
<div id="outline-container-org2ad05fc" class="outline-3">
<h3 id="org2ad05fc"><span class="section-number-3">28.1.</span> lint</h3>
<div class="outline-text-3" id="text-28-1">
<ul class="org-ul">
<li><a href="http://github.com/purcell/package-lint">http://github.com/purcell/package-lint</a></li>
</ul>

<p>
M-x package-install package-lint
</p>

<p>
usage: package-lint-current-buffer
</p>
</div>
</div>
<div id="outline-container-org77c9e50" class="outline-3">
<h3 id="org77c9e50"><span class="section-number-3">28.2.</span> byte-compile</h3>
<div class="outline-text-3" id="text-28-2">
<p>
M-x byte-compile-file
</p>
</div>
</div>
</div>
<div id="outline-container-org89c8782" class="outline-2">
<h2 id="org89c8782"><span class="section-number-2">29.</span> errors handling - errors and throws and how to catch them</h2>
<div class="outline-text-2" id="text-29">
</div>
