lisp.md


<a id="org9171cb4"></a>

## convetions and style guide

comments:

-   ; - used at the end of line
-   ;; - used in code as separate line
-   ;;; We use them for comments that should be considered a heading by Outline minor mode.
-   on’t end headings with a colon : or any other punctuation.

naming:

-   Prefix unused local (lexically scoped) variables with \_. (lambda (x \_y) x)
-   &#x2013; to denote private top-level definitions . `projectile--private-fun`
-   lowercas with - separator: some-var
-   name of program as a prefix with ‘-’ separator
    -   exceptions: ‘list-prefix’, ‘define-&#x2026;-prefix-&#x2026;’
    -   you may use two or three alternative common prefixes

functions:

-   “xxx-p” - check if true
-   Constructs that define a function or variable should be macros, not functions, and their names should start
    with ‘define-’.
-   Use `lambdas` for local bindings and function calls, not for hooks or global variables.
-   <https://www.gnu.org/software/emacs/manual/html_node/elisp/Coding-Conventions.html>
-   <https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips.html>
-   <https://github.com/bbatsov/emacs-lisp-style-guide>

naming variables:

-   if the purpose of a variable is to store a single function, give it a name that ends in ‘-function’
-   <https://www.gnu.org/software/emacs/manual/html_node/elisp/Tips-for-Defining.html>

major mode: <https://www.gnu.org/software/emacs/manual/html_node/elisp/Major-Mode-Conventions.html>

minor mode: <https://www.gnu.org/software/emacs/manual/html_node/elisp/Minor-Mode-Conventions.html>


<a id="orgbc963f7"></a>

## advices-reverence

Look at apply, all after FUNCTION is arguments that FUNCTION should handle. r = &rest args

-   :around        (lambda (&rest r) (apply FUNCTION **OLDFUN** r))
-   :before        (lambda (&rest r) (apply FUNCTION r) (apply **OLDFUN** r))
-   :after         (lambda (&rest r) (prog1 (apply OLDFUN r) (apply FUNCTION r)))
-   :override      (lambda (&rest r) (apply FUNCTION r))
-   :after-until   (lambda (&rest r) (or (apply OLDFUN r) (apply FUNCTION r)))
-   :after-while   (lambda (&rest r) (and (apply OLDFUN r) (apply FUNCTION r)))
-   :before-until  (lambda (&rest r) (or (apply FUNCTION r) (apply OLDFUN r)))
-   :before-while  (lambda (&rest r) (and (apply FUNCTION r) (apply OLDFUN r)))
-   :filter-args   (lambda (&rest r) (apply OLDFUN (funcall FUNCTION r)))
-   :filter-return (lambda (&rest r) (funcall FUNCTION (apply OLDFUN r)))

:around

-   (orig-fun &rest args)

:override

-   (&rest args)


<a id="orgc409aa6"></a>

## functional programming - stream of data

Transducers <https://codeberg.org/fosskers/transducers.el>

-   change calls

cl-lib, dash - alternatives

elpa stream - orthogonal

seq/generics


<a id="orgcc9761f"></a>

## testing


<a id="orgfc36589"></a>

### ERT: Emacs Lisp Regression Testing

build-in <file:///usr/share/emacs/29.1/lisp/emacs-lisp/ert.el>

-   C-h i m ert RET
-   $info ert

1.  ex

        (require 'ert)
        ;; (require 'tested-module)
        (ert-deftest csv-tests-end-of-field ()
          (with-temp-buffe
           (should (= (+ 1 2) 4)))
        )
        ;; execute test programmatically
        (ert-run-tests-interactively "csv-tests-end-of-field")

2.  links

    <https://www.emacswiki.org/emacs/UnitTesting>


<a id="org01f41b1"></a>

# MELPA

<https://github.com/melpa/melpa>

-   M-x package-recipe-mode
-   M-x package-build-current-recipie
-   fork <https://github.com/melpa/melpa/>
-   git clone own/melpa
-   git branch recipe
-   git checkout recipe
-   git cp ~/recipe own/melpa/recipies/
-   git add
-   git push


<a id="orgb1d7e46"></a>

## lint

-   <http://github.com/purcell/package-lint>

M-x package-install package-lint

usage: package-lint-current-buffer


<a id="orgc07e2fc"></a>

## byte-compile

M-x byte-compile-file


<a id="org5997345"></a>

# errors handling - errors and throws and how to catch them
