lisp.html
<div id="outline-container-orga05aa06" class="outline-3">
<h3 id="orga05aa06"><span class="section-number-3">29.1.</span> terms</h3>
<div class="outline-text-3" id="text-29-1">
<ul class="org-ul">
<li>signal and error - exception. Errors can be signaled only by Lisp primitives (including <b>signal</b> and <b>error</b>
functions)</li>
<li>cleanup expressions - catch for exception</li>
<li>error symbol - describes what kind of error it is, and which describes also a list of condition name. Each
error symbol has a set of parent <b>error conditions</b> that is a list of symbols:  error symbol itself and the symbol <b>error</b>.
<ul class="org-ul">
<li>error symbol may and may not "error conditions".</li>
</ul></li>
</ul>

<p>
<b>unwind-protect</b> - expressions to be evaluated in case of error.
</p>

<p>
<b>condition-case</b> - error handlers to recover control in case of error.
</p>
<ul class="org-ul">
<li>ignore-errors</li>
</ul>
<p>
<b>CONDITION-NAME</b> - in condition-case part of handlers
</p>
</div>
</div>
<div id="outline-container-org899bbbd" class="outline-3">
<h3 id="org899bbbd"><span class="section-number-3">29.2.</span> error symbols</h3>
<div class="outline-text-3" id="text-29-2">
<p>
(define-error
</p>

<p>
Properties:
</p>
<ul class="org-ul">
<li>error-conditions</li>
<li>error-message</li>
</ul>

<p>
Main errors:
</p>
<ul class="org-ul">
<li>error - also condition for almost all errors.</li>
<li>quit - don't have <b>error</b> condition</li>
<li>minibuffer-quit - don't have <b>error</b> condition</li>
</ul>

<p>
some errors:
</p>
<ul class="org-ul">
<li>args-out-of-range</li>
<li>wrong-type-argument</li>
<li>wrong-number-of-arguments</li>
<li>void-variable</li>
<li>void-function</li>
<li>user-error</li>
</ul>
</div>
</div>
<div id="outline-container-orga627a25" class="outline-3">
<h3 id="orga627a25"><span class="section-number-3">29.3.</span> functions</h3>
<div class="outline-text-3" id="text-29-3">
<ul class="org-ul">
<li>(error STRING &amp;rest ARGS) - make error with 'error symbol.</li>
<li>(signal ERROR-SYMBOL DATA) - An error symbol is a symbol with DATA.</li>
<li>(user-error FORMAT &amp;rest ARGS) - like error but use symbol 'user-error
‘error-conditions’ property that is a list of condition names.</li>
</ul>
</div>
</div>
<div id="outline-container-orga65b1ed" class="outline-3">
<h3 id="orga65b1ed"><span class="section-number-3">29.4.</span> condition case</h3>
<div class="outline-text-3" id="text-29-4">
<p>
(condition-case VAR BODYFORM &amp;rest HANDLERS) - Regain control when an error is signaled. When a handler
 handles an error, control returns to the ‘condition-case’ and it executes the handler’s BODY&#x2026; with VAR
 bound to (ERROR-SYMBOL . SIGNAL-DATA) from the error.
</p>
<ul class="org-ul">
<li><b>protected-form</b> - body</li>
<li><b>handlers</b> -  (CONDITION-NAME BODY&#x2026;) or (:success BODY&#x2026;)
<ul class="org-ul">
<li>condition - <b>condition name</b> of t matches any condition.</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(define-error 'new-error <span style="color: #95e454;">"A new error"</span>)
(<span style="color: #8ac6f2; font-weight: bold;">condition-case</span> e
  (<span style="color: #ccaa8f; font-weight: bold;">signal</span> 'wrong-type-argument <span style="color: #95e454;">"wtf"</span>)
  ('out-of-range (print <span style="color: #95e454;">"aa"</span>))
  <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">('error (print "tf"))</span>
  ('wrong-type-argument (print <span style="color: #95e454;">"cc"</span>))
)
(print (get 'wrong-type-argument 'error-conditions))
(print (get 'wrong-type-argument 'error-message))
</pre>
</div>

<pre class="example">

"cc"

(wrong-type-argument error)

"Wrong type argument"
</pre>


<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">catching any error and return nil if an error occurs:</span>
<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">handl erros that was thrown for ex. with ~(error "On last item")~</span>
(<span style="color: #8ac6f2; font-weight: bold;">condition-case</span> nil
    (load <span style="color: #95e454;">"asd"</span>)
  (<span style="color: #ccaa8f; font-weight: bold;">error</span> nil))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">catch error and print</span>
(<span style="color: #8ac6f2; font-weight: bold;">condition-case</span> nil
    (load <span style="color: #95e454;">"asd"</span>)
  (<span style="color: #ccaa8f; font-weight: bold;">error</span> (print <span style="color: #95e454;">"error!"</span>)))

<span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">debug and any error:</span>
(<span style="color: #8ac6f2; font-weight: bold;">condition-case</span> nil
    (load <span style="color: #95e454;">"asd"</span>)
  ((debug error) nil))

(<span style="color: #8ac6f2; font-weight: bold;">ignore-errors</span>  (load <span style="color: #95e454;">"asd"</span>))
</pre>
</div>

<pre class="example">

"error!"
</pre>
</div>
</div>
<div id="outline-container-org6fc0466" class="outline-3">
<h3 id="org6fc0466"><span class="section-number-3">29.5.</span> catch and throw</h3>
<div class="outline-text-3" id="text-29-5">
<p>
entirely <b>separate!</b> from errors and conditions.
</p>
<ul class="org-ul">
<li>catch tag body</li>
<li>throw tag value,  value is used as the value to return from that catch.</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">foo-outer</span> ()
  (<span style="color: #8ac6f2; font-weight: bold;">catch</span> '<span style="color: #e5786d; font-weight: bold;">foo</span>
    (foo-inner)
    )
)

(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">foo-inner</span> ()
  (<span style="color: #8ac6f2; font-weight: bold;">throw</span> '<span style="color: #e5786d; font-weight: bold;">foo</span> t))
(foo-outer)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5532da" class="outline-3">
<h3 id="orgc5532da"><span class="section-number-3">29.6.</span> unwind-protect</h3>
<div class="outline-text-3" id="text-29-6">
<p>
(unwind-protect BODYFORM UNWINDFORMS&#x2026;)
</p>
<ul class="org-ul">
<li>executes body-form with a guarantee that the cleanup-forms will be evaluated if control leaves</li>
<li>it permits you to make the data consistent again in the event of an <b>error</b> or <b>throw</b>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc096db0" class="outline-3">
<h3 id="orgc096db0"><span class="section-number-3">29.7.</span> logging construction</h3>
<div class="outline-text-3" id="text-29-7">
<p>
Open <b>Warnings</b> buffer and output error there:
#+begin<sub>src</sub> elisp :results output :exports both :eval no
(condition-case err
    (eval '(car) t)
  (error
   (display-warning
    (format "Error: %s\n"
            err)
    :error)
   nil))
</p>
</div>
</div>

<div id="outline-container-org8ea75dc" class="outline-3">
<h3 id="org8ea75dc"><span class="section-number-3">29.8.</span> links</h3>
<div class="outline-text-3" id="text-29-8">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Errors.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Errors.html</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Standard-Errors.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Standard-Errors.html</a></li>
<li></li>
</ul>
</div>
</div>
</div>
