lisp.md


<a id="org0ad3fdf"></a>

## terms

-   signal and error - exception. Errors can be signaled only by Lisp primitives (including **signal** and **error**
    functions)
-   cleanup expressions - catch for exception
-   error symbol - describes what kind of error it is, and which describes also a list of condition name. Each
    error symbol has a set of parent **error conditions** that is a list of symbols:  error symbol itself and the symbol **error**.
    -   error symbol may and may not "error conditions".

**unwind-protect** - expressions to be evaluated in case of error.

**condition-case** - error handlers to recover control in case of error.

-   ignore-errors

**CONDITION-NAME** - in condition-case part of handlers


<a id="org0f5b32b"></a>

## error symbols

(define-error

Properties:

-   error-conditions
-   error-message

Main errors:

-   error - also condition for almost all errors.
-   quit - don't have **error** condition
-   minibuffer-quit - don't have **error** condition

some errors:

-   args-out-of-range
-   wrong-type-argument
-   wrong-number-of-arguments
-   void-variable
-   void-function
-   user-error


<a id="org9c9e519"></a>

## functions

-   (error STRING &rest ARGS) - make error with 'error symbol.
-   (signal ERROR-SYMBOL DATA) - An error symbol is a symbol with DATA.
-   (user-error FORMAT &rest ARGS) - like error but use symbol 'user-error
    ‘error-conditions’ property that is a list of condition names.


<a id="orgfb682b8"></a>

## condition case

(condition-case VAR BODYFORM &rest HANDLERS) - Regain control when an error is signaled. When a handler
 handles an error, control returns to the ‘condition-case’ and it executes the handler’s BODY&#x2026; with VAR
 bound to (ERROR-SYMBOL . SIGNAL-DATA) from the error.

-   **protected-form** - body
-   **handlers** -  (CONDITION-NAME BODY&#x2026;) or (:success BODY&#x2026;)
    -   condition - **condition name** of t matches any condition.

    (define-error 'new-error "A new error")
    (condition-case e
      (signal 'wrong-type-argument "wtf")
      ('out-of-range (print "aa"))
      ;; ('error (print "tf"))
      ('wrong-type-argument (print "cc"))
    )
    (print (get 'wrong-type-argument 'error-conditions))
    (print (get 'wrong-type-argument 'error-message))

    
    "cc"
    
    (wrong-type-argument error)
    
    "Wrong type argument"

    ;; catching any error and return nil if an error occurs:
    ;; handl erros that was thrown for ex. with ~(error "On last item")~
    (condition-case nil
        (load "asd")
      (error nil))
    
    ;; catch error and print
    (condition-case nil
        (load "asd")
      (error (print "error!")))
    
    ;; debug and any error:
    (condition-case nil
        (load "asd")
      ((debug error) nil))
    
    (ignore-errors  (load "asd"))

    
    "error!"


<a id="org37d3d1a"></a>

## catch and throw

entirely **separate!** from errors and conditions.

-   catch tag body
-   throw tag value,  value is used as the value to return from that catch.

    (defun foo-outer ()
      (catch 'foo
        (foo-inner)
        )
    )
    
    (defun foo-inner ()
      (throw 'foo t))
    (foo-outer)


<a id="org5baad89"></a>

## unwind-protect

(unwind-protect BODYFORM UNWINDFORMS&#x2026;)

-   executes body-form with a guarantee that the cleanup-forms will be evaluated if control leaves
-   it permits you to make the data consistent again in the event of an **error** or **throw**.


<a id="org6fb8901"></a>

## logging construction

Open **Warnings** buffer and output error there:
\#+begin<sub>src</sub> elisp :results output :exports both :eval no
(condition-case err
    (eval '(car) t)
  (error
   (display-warning
    (format "Error: %s\n"
            err)
    :error)
   nil))


<a id="org85075b4"></a>

## links

-   <https://www.gnu.org/software/emacs/manual/html_node/elisp/Errors.html>
-   <https://www.gnu.org/software/emacs/manual/html_node/elisp/Standard-Errors.html>
-   
