lisp.html
<div id="outline-container-org679c8df" class="outline-2">
<h2 id="org679c8df"><span class="section-number-2">30.</span> Error messages</h2>
<div class="outline-text-2" id="text-30">
</div>
<div id="outline-container-orgab403d0" class="outline-3">
<h3 id="orgab403d0"><span class="section-number-3">30.1.</span> wrong-type-argument</h3>
<div class="outline-text-3" id="text-30-1">
<p>
symbol hello, not a number:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">condition-case</span> a
    (+ 2 nil)
  (<span style="color: #ccaa8f; font-weight: bold;">error</span> (print a)))


</pre>
</div>

<pre class="example">

(wrong-type-argument number-or-marker-p nil)
</pre>


<pre class="example">

</pre>


<p>
Wrong type argument: listp, notmuch-show-save-part
</p>


<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/Wrong-Type-of-Argument.html">https://www.gnu.org/software/emacs/manual/html_node/eintr/Wrong-Type-of-Argument.html</a>
</p>
</div>
</div>
<div id="outline-container-orgce62b40" class="outline-3">
<h3 id="orgce62b40"><span class="section-number-3">30.2.</span> Lisp error: (invalid-function</h3>
</div>

<div id="outline-container-org1d0770e" class="outline-3">
<h3 id="org1d0770e"><span class="section-number-3">30.3.</span> nil in debugger, Why nil if it is not nil?</h3>
<div class="outline-text-3" id="text-30-3">
<pre class="example">
Debugger entered--Lisp error: (wrong-type-argument number-or-marker-p nil)
* ediff-recenter-one-window(B)
</pre>


<p>
Error is actually in defsubst inside of this function, it is like a bug because of inline function.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcc14d18" class="outline-2">
<h2 id="orgcc14d18"><span class="section-number-2">31.</span> Emacs API</h2>
<div class="outline-text-2" id="text-31">
</div>
<div id="outline-container-orgae495c7" class="outline-3">
<h3 id="orgae495c7"><span class="section-number-3">31.1.</span> terms</h3>
<div class="outline-text-3" id="text-31-1">
<ul class="org-ul">
<li>Emacs Terminology 	Description</li>
<li>Point 	Cursor position, number of characters from beggining of the buffer to current cursor position.</li>
<li>Mark 	Beginning of the selected area.</li>
<li>Region 	Selected area/ text</li>
<li>Buffer 	Place where the user edit something. Not all buffers are bound to a file.</li>
<li>Frame 	The current window of emacs. Windows are grouped into frames. Each frame contains at least one window.</li>
<li>Windows Each frame can be split in sections that Emacs documentation calls windows. subdivide a frame into
multiple, non-overlapping windows.</li>
<li>Fill 	Word Wrap</li>
<li>Yank 	Copy</li>
<li>Kill Region 	Cut</li>
<li>Kill Ring 	Clipboard</li>
<li>Kill Buffer 	Close Buffer</li>
<li>Mode Line 	Status Bar</li>
<li>Font Locking 	Syntax Coloring</li>
</ul>
</div>
</div>
<div id="outline-container-org0b6c957" class="outline-3">
<h3 id="org0b6c957"><span class="section-number-3">31.2.</span> Pointer</h3>
<div class="outline-text-3" id="text-31-2">
<ul class="org-ul">
<li>(point) - current position</li>
<li>(goto-char position)</li>
<li>(line-beginning-position &amp;optional N) scan forward N - 1 lines first.</li>
<li>(beginning-of-line) - move cursor</li>
<li>(forward-line)</li>
<li>(next-line)</li>
<li>(current-column) - get position from begining of line</li>
<li>(current-indentation) - get position from begining of line where text exist (not white spaces)</li>
</ul>
<p>
(count-lines ? ?)
</p>

<p>
<a href="http://xahlee.info/emacs/emacs/elisp_all_about_lines.html">http://xahlee.info/emacs/emacs/elisp_all_about_lines.html</a>
</p>
</div>
</div>
<div id="outline-container-org0224b90" class="outline-3">
<h3 id="org0224b90"><span class="section-number-3">31.3.</span> Marker</h3>
<div class="outline-text-3" id="text-31-3">
<p>
The idea is that a marker positioned between two characters remains between those two characters despite
 insertion and deletion elsewhere in the buffer.
Marker:
</p>
<dl class="org-dl">
<dt>the marker position</dt><dd>position in buffer at the begining -  Insertion and deletion of text in the buffer relocate the marker.</dd>
<dt>the marker buffer</dt><dd>.</dd>
<dt>the insertion type</dt><dd>define behavion when text was inserter right at marker position.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgc9158cd" class="outline-3">
<h3 id="orgc9158cd"><span class="section-number-3">31.4.</span> Buffers</h3>
<div class="outline-text-3" id="text-31-4">
<ul class="org-ul">
<li>(current-buffer)</li>
<li>(with-current-buffer BUFFER-OR-NAME &amp;rest BODY) ;; Temporarily make a buffer current.</li>
<li>(set-buffer BUFFER-OR-NAME) - Make a buffer current. (but does not make it visible.) Return that buffer object. switch-to-buffer or pop-to-buffer.</li>
<li>(save-current-buffer &amp;rest BODY) - Execute BODY, then restore the current buffer that is before this function call.</li>
<li>(with-temp-buffer &amp;rest BODY) - Create a temporary buffer, and evaluate BODY, return the last expression.</li>
<li>(buffer-name BUFFER) - Return the name of BUFFER, as a string.</li>
<li>(buffer-live-p b) - Return t if OBJECT is a buffer which has not been killed.</li>
</ul>
<p>
<a href="http://xahlee.info/emacs/emacs/elisp_buffer_file_functions.html">http://xahlee.info/emacs/emacs/elisp_buffer_file_functions.html</a>
</p>
</div>

<div id="outline-container-org51841f7" class="outline-4">
<h4 id="org51841f7"><span class="section-number-4">31.4.1.</span> create temp copy</h4>
<div class="outline-text-4" id="text-31-4-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">ss</span> ()
  (<span style="color: #8ac6f2; font-weight: bold;">let</span> ((buffer (get-buffer-create <span style="color: #95e454;">" *temp*"</span>))
        (orbuf (current-buffer))
        (p (point)))
    (<span style="color: #8ac6f2; font-weight: bold;">save-excursion</span>
      (<span style="color: #8ac6f2; font-weight: bold;">with-current-buffer</span> buffer
        (insert (<span style="color: #8ac6f2; font-weight: bold;">with-current-buffer</span> orbuf (buffer-string))) <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">insert text from orbuf to this</span>
        (goto-char p)
        <span style="color: #fa8072;">;; </span><span style="color: #99968b; font-style: italic;">now we are at the copy</span>
        (print (point))
))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3eeddc8" class="outline-4">
<h4 id="org3eeddc8"><span class="section-number-4">31.4.2.</span> get value from buffer</h4>
<div class="outline-text-4" id="text-31-4-2">
<p>
two ways:
</p>
<ul class="org-ul">
<li>(provided-mode-derived-p (buffer-local-value 'major-mode (current-buffer)) 'dired-mode)</li>
<li>(with-current-buffer (current-buffer) (derived-mode-p 'dired-mode))</li>
</ul>
</div>
</div>
