lisp.md


<a id="org3dc50b6"></a>

# Error messages


<a id="org0573dae"></a>

## wrong-type-argument

symbol hello, not a number:

    (condition-case a
        (+ 2 nil)
      (error (print a)))

    
    (wrong-type-argument number-or-marker-p nil)

    

Wrong type argument: listp, notmuch-show-save-part

<https://www.gnu.org/software/emacs/manual/html_node/eintr/Wrong-Type-of-Argument.html>


<a id="orge91a0b8"></a>

## Lisp error: (invalid-function


<a id="org7b2fed7"></a>

## nil in debugger, Why nil if it is not nil?

    Debugger entered--Lisp error: (wrong-type-argument number-or-marker-p nil)
    * ediff-recenter-one-window(B)

Error is actually in defsubst inside of this function, it is like a bug because of inline function.


<a id="orgcb06c78"></a>

# Emacs API


<a id="org112c6b2"></a>

## terms

-   Emacs Terminology 	Description
-   Point 	Cursor position, number of characters from beggining of the buffer to current cursor position.
-   Mark 	Beginning of the selected area.
-   Region 	Selected area/ text
-   Buffer 	Place where the user edit something. Not all buffers are bound to a file.
-   Frame 	The current window of emacs. Windows are grouped into frames. Each frame contains at least one window.
-   Windows Each frame can be split in sections that Emacs documentation calls windows. subdivide a frame into
    multiple, non-overlapping windows.
-   Fill 	Word Wrap
-   Yank 	Copy
-   Kill Region 	Cut
-   Kill Ring 	Clipboard
-   Kill Buffer 	Close Buffer
-   Mode Line 	Status Bar
-   Font Locking 	Syntax Coloring


<a id="orgcc1072b"></a>

## Pointer

-   (point) - current position
-   (goto-char position)
-   (line-beginning-position &optional N) scan forward N - 1 lines first.
-   (beginning-of-line) - move cursor
-   (forward-line)
-   (next-line)
-   (current-column) - get position from begining of line
-   (current-indentation) - get position from begining of line where text exist (not white spaces)

(count-lines ? ?)

<http://xahlee.info/emacs/emacs/elisp_all_about_lines.html>


<a id="org1c50364"></a>

## Marker

The idea is that a marker positioned between two characters remains between those two characters despite
 insertion and deletion elsewhere in the buffer.
Marker:

-   **the marker position:** position in buffer at the begining -  Insertion and deletion of text in the buffer relocate the marker.
-   **the marker buffer:** .
-   **the insertion type:** define behavion when text was inserter right at marker position.


<a id="org280cac6"></a>

## Buffers

-   (current-buffer)
-   (with-current-buffer BUFFER-OR-NAME &rest BODY) ;; Temporarily make a buffer current.
-   (set-buffer BUFFER-OR-NAME) - Make a buffer current. (but does not make it visible.) Return that buffer object. switch-to-buffer or pop-to-buffer.
-   (save-current-buffer &rest BODY) - Execute BODY, then restore the current buffer that is before this function call.
-   (with-temp-buffer &rest BODY) - Create a temporary buffer, and evaluate BODY, return the last expression.
-   (buffer-name BUFFER) - Return the name of BUFFER, as a string.
-   (buffer-live-p b) - Return t if OBJECT is a buffer which has not been killed.

<http://xahlee.info/emacs/emacs/elisp_buffer_file_functions.html>


<a id="org2d71dd4"></a>

### create temp copy

    (defun ss ()
      (let ((buffer (get-buffer-create " *temp*"))
            (orbuf (current-buffer))
            (p (point)))
        (save-excursion
          (with-current-buffer buffer
            (insert (with-current-buffer orbuf (buffer-string))) ;; insert text from orbuf to this
            (goto-char p)
            ;; now we are at the copy
            (print (point))
    ))))


<a id="org34eee29"></a>

### get value from buffer

two ways:

-   (provided-mode-derived-p (buffer-local-value 'major-mode (current-buffer)) 'dired-mode)
-   (with-current-buffer (current-buffer) (derived-mode-p 'dired-mode))
