sources_org/lisp.org
** Windows
- (window-prev-buffers) - Return buffers previously shown in WINDOW.
- *window tree* - Windows on the same frame
- *root window* - The root node of a window tree.
- *live window* -  leaf nodes, acutally showing buffer. returned by (window-list)
- *selected window* - one of leaf nodes that is active.
- *internal window* - organizing the relationships between live windows
- *minibuffer window* - not part of its frame’s window tree, but is sibling window of the frame’s root window
- *Window Parameters* - associated additional information with window.
- *window-point/pos* - saved state of (point) in window, by default used by *window-in-direction* as reference.
- *reference position* - used as a source to decide a target in direction.
- *main-window* - used to distinguish window from windows marked as window-side/slot, returned by
 (window-main-window). is either a “normal” live window or specifies the area containing all the normal
 windows.
- *display-start or just start* - buffer position that specifies where in the buffer display should start to display text at screen.
*** side windows
C-x w s	window-toggle-side-windows
(scroll-right)
** Frames
https://elpa.gnu.org/packages/posframe.html
** temporary files
- (make-temp-file) - This function creates a temporary file or directory and returns its name, and may insert
 text in it.

- org-babel-temp-file - Create a temporary file
- org-babel-process-file-name - Prepare NAME to be used in an external process and return new name
- org-babel-eval-read-file - Return the contents of FILE as a string.

- with-temp-file file body - evaluates the BODY forms with a temporary buffer as the current buffer; then, at the end,
 it writes the buffer contents into file FILE.
- append-to-file - This function appends the contents of the region delimited by START and END in the current
 buffer to the end of file FILENAME.
- write-region - This function writes the region delimited by START and END in the current buffer into the
 file specified by FILENAME. or write string.

Notes
- ‘append-to-file’ and ‘write-region’ - Don’t use these functions to write to files that are being visited
*** ex
#+begin_src elisp
(make-temp-file
            (expand-file-name PREFIX
                              (or small-temporary-file-directory
                                  temporary-file-directory)))
#+end_src

#+begin_src elisp
(write-region <STRING> nil <FILENAME> 'append)
#+end_src

#+begin_src elisp
(defun my-append-string-to-file (s filename)
  (with-temp-buffer
    (insert s)
    (write-region (point-min) (point-max) filename t)))
#+end_src
*** links
- [[info:elisp#Unique File Names]]
- [[info:elisp#Writing to Files]]
** lines
(count-lines (point-min) (point-max))
** cleanup - temporary buffer
*unwind-protect* executes *body-form* with a guarantee that the *cleanup-forms* will be evaluated if control leaves
 body-form,
#+begin_src elisp :results output :exports both :eval no
(let ((buffer (get-buffer-create " *temp*")))
  (with-current-buffer buffer
    (unwind-protect
        (insert "asd") ; body-frm
      (kill-buffer buffer) ; cleanup-form
      )))
#+end_src

#+RESULTS:

https://www.gnu.org/software/emacs/manual/html_node/elisp/Cleanups.html

** highlight character at point
#+begin_src elisp :results output :exports both :eval no
(let ((ol (make-overlay (point) (1+ (point)))))
  (overlay-put ol 'face '(:background "dark red")))
#+end_src

** modes
variables:
- mode-name - name of current major mode: "Help"
- major-mode - name of current major mode: help-mode
- mode-line-buffer-identification

minor mode is buffer-local or global:
: (local-variable-if-set-p 'show-paren-mode)

there's nothing stopping you giving a global mode a buffer-local value(to check really global):
: (with-temp-buffer
:   (local-variable-if-set-p 'show-paren-mode))

