lisp.html
<div id="outline-container-orga7899fe" class="outline-4">
<h4 id="orga7899fe"><span class="section-number-4">31.4.3.</span> links</h4>
<div class="outline-text-4" id="text-31-4-3">
<p>
<a href="http://xahlee.info/emacs/emacs/elisp_buffer_file_functions.html">http://xahlee.info/emacs/emacs/elisp_buffer_file_functions.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org559dd28" class="outline-3">
<h3 id="org559dd28"><span class="section-number-3">31.5.</span> Windows</h3>
<div class="outline-text-3" id="text-31-5">
<ul class="org-ul">
<li>(window-prev-buffers) - Return buffers previously shown in WINDOW.</li>
<li><b>window tree</b> - Windows on the same frame</li>
<li><b>root window</b> - The root node of a window tree.</li>
<li><b>live window</b> -  leaf nodes, acutally showing buffer. returned by (window-list)</li>
<li><b>selected window</b> - one of leaf nodes that is active.</li>
<li><b>internal window</b> - organizing the relationships between live windows</li>
<li><b>minibuffer window</b> - not part of its frame’s window tree, but is sibling window of the frame’s root window</li>
<li><b>Window Parameters</b> - associated additional information with window.</li>
<li><b>window-point/pos</b> - saved state of (point) in window, by default used by <b>window-in-direction</b> as reference.</li>
<li><b>reference position</b> - used as a source to decide a target in direction.</li>
<li><b>main-window</b> - used to distinguish window from windows marked as window-side/slot, returned by
(window-main-window). is either a “normal” live window or specifies the area containing all the normal
windows.</li>
<li><b>display-start or just start</b> - buffer position that specifies where in the buffer display should start to display text at screen.</li>
</ul>
</div>
<div id="outline-container-org55f8609" class="outline-4">
<h4 id="org55f8609"><span class="section-number-4">31.5.1.</span> side windows</h4>
<div class="outline-text-4" id="text-31-5-1">
<p>
C-x w s	window-toggle-side-windows
(scroll-right)
</p>
</div>
</div>
</div>
<div id="outline-container-org06c4378" class="outline-3">
<h3 id="org06c4378"><span class="section-number-3">31.6.</span> Frames</h3>
<div class="outline-text-3" id="text-31-6">
<p>
<a href="https://elpa.gnu.org/packages/posframe.html">https://elpa.gnu.org/packages/posframe.html</a>
</p>
</div>
</div>
<div id="outline-container-org6e3fb78" class="outline-3">
<h3 id="org6e3fb78"><span class="section-number-3">31.7.</span> temporary files</h3>
<div class="outline-text-3" id="text-31-7">
<ul class="org-ul">
<li>(make-temp-file) - This function creates a temporary file or directory and returns its name, and may insert
text in it.</li>

<li>org-babel-temp-file - Create a temporary file</li>
<li>org-babel-process-file-name - Prepare NAME to be used in an external process and return new name</li>
<li>org-babel-eval-read-file - Return the contents of FILE as a string.</li>

<li>with-temp-file file body - evaluates the BODY forms with a temporary buffer as the current buffer; then, at the end,
it writes the buffer contents into file FILE.</li>
<li>append-to-file - This function appends the contents of the region delimited by START and END in the current
buffer to the end of file FILENAME.</li>
<li>write-region - This function writes the region delimited by START and END in the current buffer into the
file specified by FILENAME. or write string.</li>
</ul>

<p>
Notes
</p>
<ul class="org-ul">
<li>‘append-to-file’ and ‘write-region’ - Don’t use these functions to write to files that are being visited</li>
</ul>
</div>
<div id="outline-container-org82b3316" class="outline-4">
<h4 id="org82b3316"><span class="section-number-4">31.7.1.</span> ex</h4>
<div class="outline-text-4" id="text-31-7-1">
<div class="org-src-container">
<pre class="src src-elisp">(make-temp-file
            (expand-file-name PREFIX
                              (<span style="color: #8ac6f2; font-weight: bold;">or</span> small-temporary-file-directory
                                  temporary-file-directory)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(write-region &lt;STRING&gt; nil &lt;FILENAME&gt; 'append)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">defun</span> <span style="color: #cae682; font-weight: bold;">my-append-string-to-file</span> (s filename)
  (<span style="color: #8ac6f2; font-weight: bold;">with-temp-buffer</span>
    (insert s)
    (write-region (point-min) (point-max) filename t)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9f0fc1" class="outline-4">
<h4 id="orgc9f0fc1"><span class="section-number-4">31.7.2.</span> links</h4>
<div class="outline-text-4" id="text-31-7-2">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Unique-File-Names">elisp#Unique File Names</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Writing-to-Files">elisp#Writing to Files</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org16d33cc" class="outline-3">
<h3 id="org16d33cc"><span class="section-number-3">31.8.</span> lines</h3>
<div class="outline-text-3" id="text-31-8">
<p>
(count-lines (point-min) (point-max))
</p>
</div>
</div>
<div id="outline-container-orgc0ea46f" class="outline-3">
<h3 id="orgc0ea46f"><span class="section-number-3">31.9.</span> cleanup - temporary buffer</h3>
<div class="outline-text-3" id="text-31-9">
<p>
<b>unwind-protect</b> executes <b>body-form</b> with a guarantee that the <b>cleanup-forms</b> will be evaluated if control leaves
 body-form,
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">let</span> ((buffer (get-buffer-create <span style="color: #95e454;">" *temp*"</span>)))
  (<span style="color: #8ac6f2; font-weight: bold;">with-current-buffer</span> buffer
    (<span style="color: #8ac6f2; font-weight: bold;">unwind-protect</span>
        (insert <span style="color: #95e454;">"asd"</span>) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">body-frm</span>
      (kill-buffer buffer) <span style="color: #fa8072;">; </span><span style="color: #99968b; font-style: italic;">cleanup-form</span>
      )))
</pre>
</div>

<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Cleanups.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/Cleanups.html</a>
</p>
</div>
</div>

<div id="outline-container-org158a720" class="outline-3">
<h3 id="org158a720"><span class="section-number-3">31.10.</span> highlight character at point</h3>
<div class="outline-text-3" id="text-31-10">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #8ac6f2; font-weight: bold;">let</span> ((ol (make-overlay (point) (1+ (point)))))
  (overlay-put ol 'face '(<span style="color: #e5786d;">:background</span> <span style="color: #95e454;">"dark red"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org786dfa4" class="outline-3">
<h3 id="org786dfa4"><span class="section-number-3">31.11.</span> modes</h3>
<div class="outline-text-3" id="text-31-11">
<p>
variables:
</p>
<ul class="org-ul">
<li>mode-name - name of current major mode: "Help"</li>
<li>major-mode - name of current major mode: help-mode</li>
<li>mode-line-buffer-identification</li>
</ul>

<p>
minor mode is buffer-local or global:
</p>
<pre class="example">
(local-variable-if-set-p 'show-paren-mode)
</pre>


<p>
there's nothing stopping you giving a global mode a buffer-local value(to check really global):
</p>
<pre class="example">
(with-temp-buffer
  (local-variable-if-set-p 'show-paren-mode))
</pre>
</div>
</div>
