lisp.md


<a id="org8768ac0"></a>

### links

<http://xahlee.info/emacs/emacs/elisp_buffer_file_functions.html>


<a id="org3f2a7ef"></a>

## Windows

-   (window-prev-buffers) - Return buffers previously shown in WINDOW.
-   **window tree** - Windows on the same frame
-   **root window** - The root node of a window tree.
-   **live window** -  leaf nodes, acutally showing buffer. returned by (window-list)
-   **selected window** - one of leaf nodes that is active.
-   **internal window** - organizing the relationships between live windows
-   **minibuffer window** - not part of its frame’s window tree, but is sibling window of the frame’s root window
-   **Window Parameters** - associated additional information with window.
-   **window-point/pos** - saved state of (point) in window, by default used by **window-in-direction** as reference.
-   **reference position** - used as a source to decide a target in direction.
-   **main-window** - used to distinguish window from windows marked as window-side/slot, returned by
    (window-main-window). is either a “normal” live window or specifies the area containing all the normal
    windows.
-   **display-start or just start** - buffer position that specifies where in the buffer display should start to display text at screen.


<a id="orge53b3c2"></a>

### side windows

C-x w s	window-toggle-side-windows
(scroll-right)


<a id="orgfc80eae"></a>

## Frames

<https://elpa.gnu.org/packages/posframe.html>


<a id="org8c8c1af"></a>

## temporary files

-   (make-temp-file) - This function creates a temporary file or directory and returns its name, and may insert
    text in it.

-   org-babel-temp-file - Create a temporary file
-   org-babel-process-file-name - Prepare NAME to be used in an external process and return new name
-   org-babel-eval-read-file - Return the contents of FILE as a string.

-   with-temp-file file body - evaluates the BODY forms with a temporary buffer as the current buffer; then, at the end,
    it writes the buffer contents into file FILE.
-   append-to-file - This function appends the contents of the region delimited by START and END in the current
    buffer to the end of file FILENAME.
-   write-region - This function writes the region delimited by START and END in the current buffer into the
    file specified by FILENAME. or write string.

Notes

-   ‘append-to-file’ and ‘write-region’ - Don’t use these functions to write to files that are being visited


<a id="orgc4481f7"></a>

### ex

    (make-temp-file
                (expand-file-name PREFIX
                                  (or small-temporary-file-directory
                                      temporary-file-directory)))

    (write-region <STRING> nil <FILENAME> 'append)

    (defun my-append-string-to-file (s filename)
      (with-temp-buffer
        (insert s)
        (write-region (point-min) (point-max) filename t)))


<a id="orgb3371e8"></a>

### links

-   <elisp#Unique File Names>
-   <elisp#Writing to Files>


<a id="org9f38087"></a>

## lines

(count-lines (point-min) (point-max))


<a id="orgf01b02a"></a>

## cleanup - temporary buffer

**unwind-protect** executes **body-form** with a guarantee that the **cleanup-forms** will be evaluated if control leaves
 body-form,

    (let ((buffer (get-buffer-create " *temp*")))
      (with-current-buffer buffer
        (unwind-protect
            (insert "asd") ; body-frm
          (kill-buffer buffer) ; cleanup-form
          )))

<https://www.gnu.org/software/emacs/manual/html_node/elisp/Cleanups.html>


<a id="orgee9bf00"></a>

## highlight character at point

    (let ((ol (make-overlay (point) (1+ (point)))))
      (overlay-put ol 'face '(:background "dark red")))


<a id="orge1a0fe5"></a>

## modes

variables:

-   mode-name - name of current major mode: "Help"
-   major-mode - name of current major mode: help-mode
-   mode-line-buffer-identification

minor mode is buffer-local or global:

    (local-variable-if-set-p 'show-paren-mode)

there's nothing stopping you giving a global mode a buffer-local value(to check really global):

    (with-temp-buffer
      (local-variable-if-set-p 'show-paren-mode))
