lisp.html

<div id="outline-container-org8247dd1" class="outline-3">
<h3 id="org8247dd1"><span class="section-number-3">31.12.</span> Call external asynchronous</h3>
<div class="outline-text-3" id="text-31-12">
</div>
<div id="outline-container-orga09ab48" class="outline-4">
<h4 id="orga09ab48"><span class="section-number-4">31.12.1.</span> async-shell-command</h4>
<div class="outline-text-4" id="text-31-12-1">
<p>
(async-shell-command COMMAND &amp;optional OUTPUT-BUFFER ERROR-BUFFER)
</p>
<ul class="org-ul">
<li>OUTPUT-BUFFER is default of `shell-command-buffer-name-async' variable - name of a buffer or buffer or nil. That buffer is in shell mode.</li>
<li>To not display buffer: To run COMMAND without displaying the output in a window you can</li>
</ul>
<p>
configure ‘display-buffer-alist’ to use the action
‘display-buffer-no-window’ for the buffer given by
‘shell-command-buffer-name-async’.
</p>
</div>
</div>
<div id="outline-container-org241eeb3" class="outline-4">
<h4 id="org241eeb3"><span class="section-number-4">31.12.2.</span> call-process-shell-command</h4>
<div class="outline-text-4" id="text-31-12-2">
<p>
(call-process-shell-command (concat "timeout 15 bash -c \"while true; do " play-sound "; sleep 2.9 ; done \"") nil 0)
without return
</p>
</div>
</div>

<div id="outline-container-org5a323fa" class="outline-4">
<h4 id="org5a323fa"><span class="section-number-4">31.12.3.</span> <span class="todo TODO">TODO</span> <a href="https://github.com/tkf/python-epc">https://github.com/tkf/python-epc</a></h4>
<div class="outline-text-4" id="text-31-12-3">
<p>
Allow to create server.
</p>
</div>
</div>
<div id="outline-container-orgb3e7667" class="outline-4">
<h4 id="orgb3e7667"><span class="section-number-4">31.12.4.</span> <span class="todo TODO">TODO</span> <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/JSONRPC.html">https://www.gnu.org/software/emacs/manual/html_node/elisp/JSONRPC.html</a></h4>
</div>
</div>
<div id="outline-container-orgd5ae159" class="outline-3">
<h3 id="orgd5ae159"><span class="section-number-3">31.13.</span> Timer</h3>
<div class="outline-text-3" id="text-31-13">
<p>
(current-time) Elisp is a way to represent the number of seconds since the epoch (January 1, 1970, 00:00:00
 UTC)
</p>
<ul class="org-ul">
<li>HIGH: This represents the upper bits of the timestamp, typically the higher 16 bits of a 32-bit integer.</li>
<li>LOW: This represents the lower bits of the timestamp, typically the lower 16 bits of a 32-bit integer.</li>
<li>USEC: This represents the microseconds (millionths of a second) since the epoch.</li>
<li>PSEC: This represents the picoseconds (trillionths of a second) since the epoch.</li>
</ul>

<p>
To show epoch in seconds:
</p>
<pre class="example">
(print (time-convert (current-time) 'integer))
</pre>

<p>
To show saved Timer (run-at-time) in epoch:
</p>
<pre class="example">
(print (time-convert '(26277 20928) 'integer))
</pre>

<p>
To show saved Timer as readable string:
</p>
<pre class="example">
(print (current-time-string (time-convert '(26277 20928) 'integer)))
</pre>
</div>
</div>
<div id="outline-container-org62904b4" class="outline-3">
<h3 id="org62904b4"><span class="section-number-3">31.14.</span> autoload</h3>
</div>
<div id="outline-container-orge32e392" class="outline-3">
<h3 id="orge32e392"><span class="section-number-3">31.15.</span> links</h3>
<div class="outline-text-3" id="text-31-15">
<ul class="org-ul">
<li><a href="http://www.blogbyben.com/2011/04/10-concepts-emacs-newbie-should-master.html">http://www.blogbyben.com/2011/04/10-concepts-emacs-newbie-should-master.html</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfb75ef2" class="outline-2">
<h2 id="orgfb75ef2"><span class="section-number-2">32.</span> Libraries - popular</h2>
<div class="outline-text-2" id="text-32">
<ul class="org-ul">
<li>DamienCassou/hierarchy: Emacs library to create, query, navigate and display</li>
<li>magnars/dash.el: A modern list library for Emacs hierarchy structures</li>
</ul>
</div>

<div id="outline-container-orgab6b5e1" class="outline-3">
<h3 id="orgab6b5e1"><span class="section-number-3">32.1.</span> build in</h3>
<div class="outline-text-3" id="text-32-1">
<ul class="org-ul">
<li>seq.el</li>
<li>map.el</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9bee06a" class="outline-2">
<h2 id="org9bee06a"><span class="section-number-2">33.</span> links</h2>
<div class="outline-text-2" id="text-33">
<ul class="org-ul">
<li>Common Lisp the Language, 2nd Edition <a href="https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node1.html">https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node1.html</a></li>
<li><a href="https://caiorss.github.io/Emacs-Elisp-Programming/Elisp_Programming.html">https://caiorss.github.io/Emacs-Elisp-Programming/Elisp_Programming.html</a></li>
<li>free books <a href="https://www.linuxlinks.com/excellent-free-books-learn-lisp/">https://www.linuxlinks.com/excellent-free-books-learn-lisp/</a></li>
<li>free tutorials <a href="https://www.linuxlinks.com/excellent-free-tutorials-learn-lisp/">https://www.linuxlinks.com/excellent-free-tutorials-learn-lisp/</a></li>
<li><a href="http://landoflisp.com/">http://landoflisp.com/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-01-14 Tue 13:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
