lisp.md


<a id="orga59f0e2"></a>

## Call external asynchronous


<a id="org95ba4f8"></a>

### async-shell-command

(async-shell-command COMMAND &optional OUTPUT-BUFFER ERROR-BUFFER)

-   OUTPUT-BUFFER is default of \`shell-command-buffer-name-async' variable - name of a buffer or buffer or nil. That buffer is in shell mode.
-   To not display buffer: To run COMMAND without displaying the output in a window you can

configure ‘display-buffer-alist’ to use the action
‘display-buffer-no-window’ for the buffer given by
‘shell-command-buffer-name-async’.


<a id="org3c66f84"></a>

### call-process-shell-command

(call-process-shell-command (concat "timeout 15 bash -c \\"while true; do " play-sound "; sleep 2.9 ; done \\"") nil 0)
without return


<a id="org705acbc"></a>

### TODO <https://github.com/tkf/python-epc>

Allow to create server.


<a id="org456f988"></a>

### TODO <https://www.gnu.org/software/emacs/manual/html_node/elisp/JSONRPC.html>


<a id="org14c84e1"></a>

## Timer

(current-time) Elisp is a way to represent the number of seconds since the epoch (January 1, 1970, 00:00:00
 UTC)

-   HIGH: This represents the upper bits of the timestamp, typically the higher 16 bits of a 32-bit integer.
-   LOW: This represents the lower bits of the timestamp, typically the lower 16 bits of a 32-bit integer.
-   USEC: This represents the microseconds (millionths of a second) since the epoch.
-   PSEC: This represents the picoseconds (trillionths of a second) since the epoch.

To show epoch in seconds:

    (print (time-convert (current-time) 'integer))

To show saved Timer (run-at-time) in epoch:

    (print (time-convert '(26277 20928) 'integer))

To show saved Timer as readable string:

    (print (current-time-string (time-convert '(26277 20928) 'integer)))


<a id="org5b92c97"></a>

## autoload


<a id="org4adc82e"></a>

## links

-   <http://www.blogbyben.com/2011/04/10-concepts-emacs-newbie-should-master.html>


<a id="org44ff68d"></a>

# Libraries - popular

-   DamienCassou/hierarchy: Emacs library to create, query, navigate and display
-   magnars/dash.el: A modern list library for Emacs hierarchy structures


<a id="org0a27a95"></a>

## build in

-   seq.el
-   map.el


<a id="org00eb691"></a>

# links

-   Common Lisp the Language, 2nd Edition <https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node1.html>
-   <https://caiorss.github.io/Emacs-Elisp-Programming/Elisp_Programming.html>
-   free books <https://www.linuxlinks.com/excellent-free-books-learn-lisp/>
-   free tutorials <https://www.linuxlinks.com/excellent-free-tutorials-learn-lisp/>
-   <http://landoflisp.com/>

